{"id":14606,"date":"2024-02-26T06:30:16","date_gmt":"2024-02-26T05:30:16","guid":{"rendered":"https:\/\/amazingfba.com\/?p=14606"},"modified":"2024-02-23T19:52:06","modified_gmt":"2024-02-23T18:52:06","slug":"the-problem-of-self-perception-in-business","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/","title":{"rendered":"The problem of self-perception in business"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F_The_average_driver_thinks_they_are_above_average-the_problem_of_self-perception.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fthe-problem-of-self-perception-in-business%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/_The_average_driver_thinks_they_are_above_average-the_problem_of_self-perception.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14606-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/_The_average_driver_thinks_they_are_above_average-the_problem_of_self-perception.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"_The_average_driver_thinks_they_are_above_average-the_problem_of_self-perception.mp3\">Download<\/a> (Duration: 10:52 &#8212; 10.0MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Hey there. It&#8217;s Michael from Amazing FBA- welcome to mindset moments, little bite-sized chunks of thoughts and hopefully wisdom about business and life from my wanderings around London, and other parts of Europe. Today we are going to talk about how your self-perception in business is, how good is it and why does that even matter? Stay tuned.<\/p>\n<h3><a href=\"https:\/\/go.amazingfba.com\/mastermind-V2\" target=\"_blank\" rel=\"noopener\"><span style=\"text-decoration: underline;\"><span style=\"color: #000080; text-decoration: underline;\">The 10K Collective Mastermind <\/span><\/span><\/a><\/h3>\n<p>I&#8217;m the leader of the 10k Collective Mastermind, for private label sellers and product brand owners who sell at least half a million dollars a year or more on Amazon.<\/p>\n<p>Over the last five years we&#8217;ve had members triple their revenue in one year, grow to eight figures and one member get to a seven- figure exit. Now we&#8217;re taking it to the next level. I&#8217;m excited to introduce the 10K collective Uber mastermind.<\/p>\n<p>It&#8217;s a unique combination of peer group support in person and online and specialist coaching.<\/p>\n<p>If you&#8217;re ready to take your business to seven figures and beyond, then<\/p>\n<p>just go to <a href=\"https:\/\/go.amazingfba.com\/mastermind-V2\" target=\"_blank\" rel=\"noopener\">www.TheAmazonmastermind.com<\/a> to find out more today.<\/p>\n<h2><b>&#8220;The average driver thinks they are above average&#8221;<\/b><\/h2>\n<p>So we are on the road, I am on the road, I&#8217;m driving and I, like many people, think of myself as an above average driver.<\/p>\n<p>It turns out that statistically the average driver thinks they are above average. as in fact, in my experience the average parent thinks the child is above average ability.<\/p>\n<p>So in other words, There is a mismatch between the reality of what they do and how they are and their perception of themselves, which is really interesting, isn&#8217;t it?<\/p>\n<p>I guess that you could say that Delusion creates pain. , and yet positive thinking and optimism have a great correlation to success in many professions, including an entrepreneurship.<\/p>\n<p>So being Positive and optimistic is really, really important. But on the other hand assessing your own abilities incorrectly could also be a problem.<\/p>\n<p>So let&#8217;s unpick this.<\/p>\n<h2>Does accurate self-perception matter?<\/h2>\n<p>So first of all there&#8217;s a question of how accurate is it? And the second question is, does that even matter or is it even bad to be accurate? All interesting questions. Here&#8217;s my take for what it&#8217;s worth.<\/p>\n<p>I think within any given business or enterprise, whether it be a, you know starting an e commerce business or an orchestra, I happen to have done both or something else, naturally speaking, at least two people or sets of people.<\/p>\n<p>One is optimists who probably inaccurate about where you are currently at as a business, as a person, as a career. They&#8217;re probably overly optimistic and, and in fact, they think they&#8217;re better than they are. Like the average person thinking they&#8217;re better at driving than they are actually in real life.<\/p>\n<p>But I think it&#8217;s also important, or I should say and, and it&#8217;s also important to have somebody in the business who&#8217;s really good at the painful business of reality checking and going, well, actually you thought your business was doing better than it actually is.<\/p>\n<h2>Numbers bring objectivity to self perception<\/h2>\n<p>Because when we look at the numbers- and numbers are a great corrective, aren&#8217;t they?<\/p>\n<p>They bring an objectivity to it- well, guess what? Actually you&#8217;re not doing as well as you thought you were.<\/p>\n<p>And I would say delusion brings pain. And so does, not being optimistic enough, doesn&#8217;t get you as far as it could be.<\/p>\n<p>Now I tend to be more on the reality check side of life, I&#8217;m that kind of person.<\/p>\n<p>A bit glass is half empty or rather I&#8217;m necessarily half empty, but I would say, yeah, well the glass is half full or, but not, it&#8217;s not, it&#8217;s not completely full. And I&#8217;m not always pessimistic, but I&#8217;m a, I&#8217;m a pedant for sure. I was about to say I&#8217;m a bit of a pedant, but my wife would disagree and actually anyone who&#8217;s worked with me for a while probably would. I&#8217;m very, very precise.<\/p>\n<h2>You need an optimist to drive a business<\/h2>\n<p>Let&#8217;s not overcomplicate this. If you&#8217;re in a business and you don&#8217;t have enough optimism, you probably in the end aren&#8217;t the sort of person that is going to drive it to what it could be. You&#8217;re not necessarily in yourself complete to create a business.<\/p>\n<p>I would say I&#8217;m one of those people. You need to find yourself somebody who&#8217;s more of a leader, somebody who&#8217;s a bit more fearless and a bit more optimistic and willing to just be a bit, what&#8217;s the word? Not vague about details, but to ignore the smaller picture in, in service of a bigger picture that&#8217;s worthwhile.<\/p>\n<p>Unsurprisingly, I have married someone like that. I&#8217;ll say. My wife is not always more optimistic than me, more, more determined, more willing to overcome the bumps and be determined to get something she really wants or that we really want, like getting a house or going on holiday despite it being difficult to find a flight or and I&#8217;ve been wise enough to make one of the best decisions of my life, of course, is to decide for a good partner in life as in a wife, girlfriend, boyfriend, whatever.<\/p>\n<p>And that works partly because I&#8217;m a bit more of a picking up the pieces and being over precise and worrying about the details person and she&#8217;s an let&#8217;s get it done person.<\/p>\n<p>So I really think in, in business that is really, really important. And I think often in love romantic or sexual life opposites do attract to a degree, but in most of life they don&#8217;t. I mean, we&#8217;re not really opposites, my wife and I, in many, many ways, we have a lot of interest in common. We both love music. We&#8217;re both linguists. We both love Italy. We have a massive amount in common in fact. But we are in terms of personality different enough in those critical ways I&#8217;ve just described.<\/p>\n<h2>The danger of a business partner who is too similar<\/h2>\n<p>In business, I think it&#8217;s very easy to end up going for a business partner who&#8217;s very similar to you. So, for example, I have found somebody in the past who is, I believe, a great person in many, many ways. Incredibly intelligent, incredibly good at certain aspects of business and very trustworthy, very high quality character, I believe.<\/p>\n<p>And I was lucky to find him, but I just think he and I were too similar in the sense that we were both quite analytical, nerdy. I&#8217;m not as clever as he is, and I&#8217;m not as anything like as technologically capable as he is, but we both had that tendency to be very analytical and neither of us was particularly the person would drive things forward.<\/p>\n<p>I&#8217;m not necessarily saying that that&#8217;s why our business ventures didn&#8217;t flourish in the way that we hoped. But what I would say is that it didn&#8217;t make sense as a partnership. If I did it again, or if I were advising him again, I&#8217;d say, look, we could do certain things together in a wonderful way, but I think overall you and I are sort of people that need somebody who&#8217;s more driven, more optimistic more of the sort of big picture stuff.<\/p>\n<h2>How to handle being two people if you’re a solo-preneur<\/h2>\n<p>Swinging back to the original topic of how accurately you gauge things. Somebody needs to not be accurate and be optimistic and driven, and somebody needs to be accurate.<\/p>\n<p>Turns out though, if you are a solopreneur, that is a way of dealing with this. And this is one of the roles that I like to play, is to be a hopefully really positive, but nevertheless reality check guy.<\/p>\n<p>Not so much trying to be destructive or critical, criticizing anyone&#8217;s business for the sake of it. That would be very destructive, I think. But to find the problems and then offer precise solutions. Which I really enjoy doing.<\/p>\n<p>That&#8217;s business consulting and it turns out that quite a few of the best entrepreneurs I&#8217;ve worked with, I&#8217;ve been able to help the most, are quite driven, optimistic, big picture people who miss some of the detail.<\/p>\n<p>And if I can help them by analyzing what&#8217;s going on and the fact that they could, by some tweaks, turn all that revenue that&#8217;s going through their business into profit, for example, or free up a lot of cash flow, that&#8217;s when I feel it&#8217;s a great partnership between me and what I&#8217;m naturally like and those people.<\/p>\n<h2>How to get a more accurate image of yourself and your business<\/h2>\n<p>So an interesting one, isn&#8217;t it? So accuracy of perception, first of all, how does one achieve it? Well numbers help, right? If you think you&#8217;re a good driver, objectively: do you break the speed limit? Do you break the speed limit that, that is a safe speed for a road that&#8217;s more subjective, but in the end, physics will tell you. Physics is hard to argue with.<\/p>\n<p>Money is a bit more nebulous, but in the end, if your business hasn&#8217;t got much profit and it benchmarked against similar types of businesses. It&#8217;s below average. Then your business is below average. Probably, you know, profits not the only thing and you shouldn&#8217;t measure in the two short term. But if you measure in the medium term, then you know, you can get some hints.<\/p>\n<p>And that&#8217;s all doable. And, you know, I think finance is great. There are marketing metrics we can get distracted to by being over analytical. But the more important point is:<\/p>\n<h2>Action steps<\/h2>\n<p>Number one, recognize: is somebody in your business looking at reality, how accurate is your self- measurement?<\/p>\n<p>And number two do something about it.<\/p>\n<p>But number three, part of doing something about it is recognizing which end of the spectrum, if you like, you tend to err on.<\/p>\n<p>Do you tend to be overly optimistic or overly analytical and worrying? And find somebody who&#8217;s a bit the opposite, but who you can still relate to help you out with that.<\/p>\n<p>I am going to leave you with that thought and get back to focusing on driving. So make sure that I, in fact, don&#8217;t break the speed limit currently in a 20 zone, which is pretty extreme. A lot of those about in the UK these days. I will come back to you soon with some more thoughts from the world of driving that I believe will apply to the mindset needed for business success as well.<\/p>\n<p>Thanks for listening. Speak soon.<\/p>\n<h2><b><span style=\"text-decoration: underline;\"><span style=\"color: #000080; text-decoration: underline;\"><a style=\"color: #000080; text-decoration: underline;\" href=\"https:\/\/go.amazingfba.com\/mastermind-V2\" target=\"_blank\" rel=\"noopener\">The 10K Collective Mastermind<\/a> <\/span><\/span><br \/>\n<\/b><\/h2>\n<p>I&#8217;m Michael Veazey from Amazing FBA and I&#8217;m the leader of the 10k Collective Mastermind- a Mastermind for private label sellers and product brand owners who sell at least half a million dollars a year or more on Amazon.<\/p>\n<p>Over the last five years we&#8217;ve had members triple their revenue in one year, grow to eight figures and one member get to a seven- figure exit.<\/p>\n<p>Now we&#8217;re taking it to the next level. I&#8217;m excited to introduce the 10K collective Uber mastermind. It&#8217;s a unique combination of peer group support in person and online and specialist coaching. We give you everything you need to grow your business to high seven figures, and finally start to get that lifestyle you were promised when you went into this.<\/p>\n<p>You&#8217;ll get clear plans from world class specialists on things like intellectual property law, e commerce, image and video marketing, financial engineering and paid advertising to name but a few. You&#8217;ll create bulletproof plans to survive the recession. You&#8217;ll double check with your peers that they make sense and then you&#8217;ll make a plan to make a killing on the rebound.<\/p>\n<p>Most importantly, you will actually transform your business.<\/p>\n<p>You&#8217;ll create listings that convert, build a brand that connects and get premium pricing. You&#8217;ll learn the latest advertising hacks and master stock management, as well as avoiding Amazon curveballs. Above all, you will create a big, bold, three year plan for a seven figure exit. And unlike other programs, we don&#8217;t just hype you up and then abandon you.<\/p>\n<p>You&#8217;ll have your peers in the mastermind, giving you insights from their own businesses and keeping you on track through peer accountability and a little bit of friendly competition. And we&#8217;ll also have those experts double checking. Everything you do makes actual sense.<\/p>\n<p>If you finally want to start becoming the entrepreneur you&#8217;ve always known you can be, if you&#8217;re ready to take your business to seven figures and beyond, then click the button to find out more about the 10k Collective Uber Mastermind today.<\/p>\n<p>If you&#8217;re listening to this on a podcast, just go to <a href=\"https:\/\/go.amazingfba.com\/mastermind-V2\" target=\"_blank\" rel=\"noopener\">www.TheAmazonmastermind.com<\/a> to find out more today.<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F_The_average_driver_thinks_they_are_above_average-the_problem_of_self-perception.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fthe-problem-of-self-perception-in-business%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/_The_average_driver_thinks_they_are_above_average-the_problem_of_self-perception.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14606-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/_The_average_driver_thinks_they_are_above_average-the_problem_of_self-perception.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"_The_average_driver_thinks_they_are_above_average-the_problem_of_self-perception.mp3\">Download<\/a> (Duration: 10:52 &#8212; 10.0MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 10:52 &#8212; 10.0MB)Subscribe: Spotify | Email | RSSHey there. It&#8217;s Michael from Amazing FBA- welcome to mindset moments, little bite-sized chunks of thoughts and hopefully wisdom about business and life from my wanderings around London, and other parts of Europe. Today we are going to talk about [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":14608,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1857],"tags":[1853],"class_list":["post-14606","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-general-business","tag-amazing-fba-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The problem of self-perception in business - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"description\" content=\"Statistically the average driver thinks they are above average. There is a mismatch between how they see themselves and how they really are.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The problem of self-perception in business - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Statistically the average driver thinks they are above average. There is a mismatch between how they see themselves and how they really are.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2024-02-26T05:30:16+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-02-23T18:52:06+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/02\/monkey-4788328_640.jpg?fit=640%2C427&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"640\" \/>\n\t<meta property=\"og:image:height\" content=\"427\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"2 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"The problem of self-perception in business\",\"datePublished\":\"2024-02-26T05:30:16+00:00\",\"dateModified\":\"2024-02-23T18:52:06+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/\"},\"wordCount\":2240,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/02\/monkey-4788328_640.jpg?fit=640%2C427&ssl=1\",\"keywords\":[\"Amazing FBA Podcast\"],\"articleSection\":[\"General Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/\",\"url\":\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/\",\"name\":\"The problem of self-perception in business - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/02\/monkey-4788328_640.jpg?fit=640%2C427&ssl=1\",\"datePublished\":\"2024-02-26T05:30:16+00:00\",\"dateModified\":\"2024-02-23T18:52:06+00:00\",\"description\":\"Statistically the average driver thinks they are above average. There is a mismatch between how they see themselves and how they really are.\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/02\/monkey-4788328_640.jpg?fit=640%2C427&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/02\/monkey-4788328_640.jpg?fit=640%2C427&ssl=1\",\"width\":640,\"height\":427},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The problem of self-perception in business\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The problem of self-perception in business - Amazing FBA - Grow your 7-Figure Amazon Business","description":"Statistically the average driver thinks they are above average. There is a mismatch between how they see themselves and how they really are.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/","og_locale":"en_GB","og_type":"article","og_title":"The problem of self-perception in business - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Statistically the average driver thinks they are above average. There is a mismatch between how they see themselves and how they really are.","og_url":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2024-02-26T05:30:16+00:00","article_modified_time":"2024-02-23T18:52:06+00:00","og_image":[{"width":640,"height":427,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/02\/monkey-4788328_640.jpg?fit=640%2C427&ssl=1","type":"image\/jpeg"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"2 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"The problem of self-perception in business","datePublished":"2024-02-26T05:30:16+00:00","dateModified":"2024-02-23T18:52:06+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/"},"wordCount":2240,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/02\/monkey-4788328_640.jpg?fit=640%2C427&ssl=1","keywords":["Amazing FBA Podcast"],"articleSection":["General Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/","url":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/","name":"The problem of self-perception in business - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/02\/monkey-4788328_640.jpg?fit=640%2C427&ssl=1","datePublished":"2024-02-26T05:30:16+00:00","dateModified":"2024-02-23T18:52:06+00:00","description":"Statistically the average driver thinks they are above average. There is a mismatch between how they see themselves and how they really are.","breadcrumb":{"@id":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/02\/monkey-4788328_640.jpg?fit=640%2C427&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/02\/monkey-4788328_640.jpg?fit=640%2C427&ssl=1","width":640,"height":427},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/the-problem-of-self-perception-in-business\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"The problem of self-perception in business"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/02\/monkey-4788328_640.jpg?fit=640%2C427&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-3NA","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14606","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=14606"}],"version-history":[{"count":3,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14606\/revisions"}],"predecessor-version":[{"id":14611,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14606\/revisions\/14611"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/14608"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=14606"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=14606"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=14606"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}