{"id":14620,"date":"2024-03-04T06:30:21","date_gmt":"2024-03-04T05:30:21","guid":{"rendered":"https:\/\/amazingfba.com\/?p=14620"},"modified":"2024-03-01T15:32:52","modified_gmt":"2024-03-01T14:32:52","slug":"are-you-driving-towards-a-clear-goal-in-your-business","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/","title":{"rendered":"Are you driving towards a clear goal in your business?"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FSatnav_as_metaphor-do_you_have_a_clear_goal_you_re_driving_towards_in_your_business_.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fare-you-driving-towards-a-clear-goal-in-your-business%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Satnav_as_metaphor-do_you_have_a_clear_goal_you_re_driving_towards_in_your_business_.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14620-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Satnav_as_metaphor-do_you_have_a_clear_goal_you_re_driving_towards_in_your_business_.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Satnav_as_metaphor-do_you_have_a_clear_goal_you_re_driving_towards_in_your_business_.mp3\">Download<\/a> (Duration: 16:04 &#8212; 14.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>&nbsp;<\/p>\n<p>Today I&#8217;m in the car driving, and my mind is turning over on lots of metaphors to do with satnavs and navigation. Where do you want to go and how are you going to get there? Very good questions for life and business.<\/p>\n<h2><b>Do you have a sense of direction in business? <\/b><\/h2>\n<p>Hi, this is Michael Veazey from amazing FBA.<\/p>\n<p>So I am a driver with, I guess just over 30 years experience now. I&#8217;m an average driver , but I&#8217;m terrible at navigation. And I do think that a lack of sense of direction can be a problem in business and life as it can most clearly and obviously in the physical realm of navigation. Now if that&#8217;s you, how do we, what are the problems and how do we solve them?<\/p>\n<h2><b>Goldratt&#8217;s 3 Questions framework <\/b><\/h2>\n<p>Well, a good framework, I think for solving lots of problems is Goldratt&#8217;s three questions. Eliahu Goldratt wrote an amazing book called The Goal. He asked three very simple. profound questions . And my thanks to my old podcast cohost, Jason Miles of OmniRocket. If you need direct to consumer site advice, particularly based in America, then Jason and his partner, Kyle Hamer are the people to go to.<\/p>\n<p>So Jason put me onto the goal and The Goal has the three questions, which are:<\/p>\n<p>Number one, what do we want to change? Number two, what do we want to change it to? And number three, how are we going to make that change?<\/p>\n<p>Now, if you think about a sat nav, really it encapsulates that in a very physical form.<\/p>\n<p>Where do we want to go? Normally you put that in. Where are we is already answered by the GPS positioning satellites that are linked up to the satellite navigation system. And then how are we going to get there is really the question the satellite navigation answers, isn&#8217;t it? It navigates you gives you the path, gives you the roads and the route.<\/p>\n<h2><b>Simplify your life like a Satnav!<\/b><\/h2>\n<p>Now let&#8217;s think about this, break this down. Cause there&#8217;s a pretty profound metaphor, I think. And that doesn&#8217;t mean I&#8217;ve come up with anything clever, but it&#8217;s clear. And I like clarity because real life is murky and messy and difficult.<\/p>\n<p>I&#8217;m driving currently to Cardiff where I years ago, I studied conducting<\/p>\n<p>orchestras are very, very, very complex because you have a lot of people trying to make music, at the same time as each other. You&#8217;ve got the whole social dynamic of a whole bunch of people. And then you&#8217;ve got the music itself in front of you the score, which is like as the blueprint for construction. They say architecture is frozen music and music has kind of architectural site blueprints and they&#8217;re very precise things.<\/p>\n<p>My orchestra conducting teacher fantastic guy, lots of common sense, said,&#8221; So, Mike we deal with complicated things. But our job is not to add complexity as conductors is as the leader. Musical leader. It&#8217;s to simplify.&#8221;<\/p>\n<p>And so hopefully this this metaphor like a lot of mindset metaphors is a simplification device It is of course too simple to just simply apply to life, but I think it&#8217;s close enough to be pretty robust.<\/p>\n<h3><b>Where are you really now? <\/b><\/h3>\n<h3>Okay, so for somebody who hasn&#8217;t got a What do I need to do?<\/h3>\n<h3>Well, first of all clarify, where are you? You may not know where you are in your life and your business. We talked before about the most people, the average person thinks they&#8217;re above average. The average business owner, in my experience, thinks their business is better than it really is, as assessed by anyone who might.<\/h3>\n<h3>So you buy the business or anyone, he&#8217;s got a hard nosed reason to pay money, to buy it or to invest in it. Guess what? They&#8217;re going to want some proof. So I would say that the first thing to do, if you want to figure out what you&#8217;re doing is you know, work out where you are.<\/h3>\n<h3><b>Where do you want to be?<\/b><\/h3>\n<p>The second thing is then work out, clarify where you want to be.<\/p>\n<p>Now, the truth is about that.<\/p>\n<p>I&#8217;m not always goal oriented enough. I&#8217;m a bit more problem centric and I&#8217;m a bit more granular. So that&#8217;s maybe why I deal with the problems immediately in front of me and when I&#8217;m driving, but I don&#8217;t plan ahead. I don&#8217;t have a sense of direction so much. Okay. So maybe if you&#8217;re a goal oriented person, you work at where you want to go first and then you work out where you are second.<\/p>\n<p>If you&#8217;re more, you know, problem oriented or reality or obsessed with detail, then you might want to, you might start naturally with where you are. I don&#8217;t think it matters. Start with what works for you. Then you&#8217;ve got to work out how you&#8217;re going to get there.<\/p>\n<h3><b>The trap for goal-orientated people<\/b><\/h3>\n<p>If you&#8217;re a very goal oriented person, I think you need to take extra care to be accurate about where you are before you plan how to get where you&#8217;re going to go.<\/p>\n<p>If you are in fact making a hell of a lot less profit per year than it feels like you are making, then, you can&#8217;t just turn around and get investors to invest in you &#8217;cause they, you won&#8217;t be attractive to investors.<\/p>\n<p>Now, at any given point, the investment environment is different. E-commerce, for example, has gone through a whipsaw of being uninvestible, being overly invested in by all the aggregators for a brief sort of one or two year period and now people will be cautious .<\/p>\n<p>You can&#8217;t control that though.<\/p>\n<p>I would suggest that you, you need to make sure you know your numbers.<\/p>\n<h2><b>The trap for the detail-orientated<\/b><\/h2>\n<p>If you are like me, more sort of detail oriented and don&#8217;t see the bigger picture and have not much sense of direction, you&#8217;re going to have to go through the equally painful process of really defining where you want to go.<\/p>\n<p>And the problem with that is, is this: if my sat nav navigated in the way that I often navigate my life, it would say, I, I think I wanna go to Cardiff. Oh, oh, no, maybe I&#8217;ll go to Swansea. &#8217;cause that sounds attractive. Oh, but I&#8217;ve changed my mind. I&#8217;m gonna go to Newport &#8217;cause it&#8217;s nearer. And then as I was on the route, I would say, oh, this route&#8217;s a bit too slow. I&#8217;m gonna try and chase the motorway. And go down the motorway for a while and go, Oh, this is, this is good. But you know, there&#8217;s a bit of a snarl up ahead of me and it&#8217;s a bit stressful. I want to move to a more country route. And then I&#8217;d be on the country route and go, Oh, but there&#8217;s a lot of traffic on this route. It&#8217;s a bit slow. I think I better get back on the motorway.<\/p>\n<p>And of course, that&#8217;s incredibly inefficient and will lead to it&#8217;s taking hours longer to, to get to a goal that you know, in this case, the, the navigation was time to take about an hour and a half and probably would end up taking four or five hours if you did it that way, or you might just give up and never get there in the first place.<\/p>\n<h3><b>Are you living your life reactively?<\/b><\/h3>\n<p>That sounds kind of funny when I put it that crassly. If you were doing that, it would be obviously absurd, but I have lived a lot of my life that way. And I&#8217;m not the only person who I know like that. Even in the realm of business. You don&#8217;t have to do that. You don&#8217;t have necessarily to have a grand, massive plan. If I said to myself, how do I navigate to the middle of Central Africa from Europe, in an area that has been not very well mapped, in the manner of the British explorers in the 19th century, then, you&#8217;d have to take it much more one step at a time.<\/p>\n<p>But nevertheless, there would be known solutions.<\/p>\n<h3><b>Use ready-made solutions<\/b><\/h3>\n<p>The truth is that a lot of modern life is much more known than we think. If you&#8217;ve never heard of a sat nav, or you&#8217;ve never used one, like my father in law, it&#8217;s a revelation to him that it gets him from A to B more efficiently than he would without it, but for me it&#8217;s just a normal thing because I know it works.<\/p>\n<p>So a lot of paths have been plotted in life, including in say e commerce, or it turns out a lot of, this is where it&#8217;s like more metaphorical. A lot of paths are very, very similar to the path that you need to plot is very, very similar to a preexisting route. So you don&#8217;t necessarily need to go crazy and reinvent the wheel to use another travel metaphor, right?<\/p>\n<p>I think that often the solutions are more ready made than you might think.<\/p>\n<p>So if, for example, you, you want to set a goal of increasing your profits by a great deal, that. There are very, very standardised ways of doing that, at least in terms of an algorithm for how to do it. There are some routes that you can just follow that are ready made. And here&#8217;s the interesting thing.<\/p>\n<h3><b>Making your own path<\/b><\/h3>\n<p>So you might need to make your own route, in which case you need a sort of algorithm or heuristic, i. e. rule of thumb, which says, how am I going to do that? Now, if you&#8217;re navigating and you have A sense of direction and you want to go somewhere that&#8217;s southwest of where you are, like from Gloucester to Cardiff.<\/p>\n<p>I guess you would just come to a junction and go, do I go right or left if there&#8217;s a fork in the road? Or do I go left, right or straight on if there&#8217;s a roundabout? And you would work by the, you know, direction. That would cease to work at some point if you&#8217;ve got a giant river or even some sea in between, as you do in that particular journey.<\/p>\n<p>But you&#8217;d hit the coast and I guess you would then move to the point where you&#8217;d have to decide whether you think the coast continues or not. And I guess that is how people create maps or navigate when things are unknown, isn&#8217;t it? And, and sometimes you will be in the territory of the unknown, in which case you&#8217;ve got to use some simple sort of heuristic.<\/p>\n<p>But even if it takes you a while to find the route you may, you will at least, if you have a compass, and you, you&#8217;ve decided where you&#8217;re going and you&#8217;re using a compass to get there, at least it will mean that you&#8217;re moving roughly in the right direction, you have a chance of success.<\/p>\n<p>So I guess you could differentiate between navigating where there is a clear route and navigating either which way, if you&#8217;re struggling, I would say technology can help in theory and a sat nav does the job for me.<\/p>\n<p>But if things are a bit more mysterious or sat navs aren&#8217;t reliable and some automated get rich quick schemes kind of purport to be sat nav like in their automation and simplicity for building a business.<\/p>\n<h3><b>The difference in building a business &#8211; the landscape keeps changing!<\/b><\/h3>\n<p>Building a business isn&#8217;t really the same as navigating because you&#8217;re competing with other people.<\/p>\n<p>So the landscape, if you will, that you&#8217;re navigating in is constantly mutating. So that&#8217;s where the metaphor breaks down a tiny bit. However you can use, for example, automation to very precisely say where you are in terms of profit and loss. If you use systems that plug in, for example, Amazon via A2X or link My Books, there is a lot of automation that can be used, but equally you probably need to include include a bookkeeper to help you with that. So it&#8217;s a bit like not so much a navigator as somebody who can tell you where you are, which is sometimes surprisingly hard to determine in business as in life.<\/p>\n<h2><b>Getting help setting goals<\/b><\/h2>\n<p>And then you know, setting goals may be hard for you, and certainly navigating a route, even if it&#8217;s a well known route, if you&#8217;ve never done it before, even if you&#8217;re navigating using a sat nav, if you&#8217;ve had driving lessons, but you&#8217;ve never really had much experience of driving, it probably helps to, you know, have somebody who will You know, help you with actually how to do the mechanics of navigating even a well known, well trodden route.<\/p>\n<h3><b>Get help from a consultant or peer group<\/b><\/h3>\n<p>So people can come into the equation. I would say that the two best forms of help in that terms that I know about would be a coach or a consultant and a peer group. And a peer group might consist of other small business owners all the way down to other people who sell physical products on Amazon based in the UK, such as the 10K Collective Mastermind that I run.<\/p>\n<p>I mention that not so much as a plug, although obviously I do like to publicize that, but because it exists for a reason. It helps a lot if you&#8217;re navigating somewhat unknown territory to have other people who&#8217;ve done the same thing and they can either refer you to ready made routes or other guides.<\/p>\n<h3><b>Hire consultants with a specific skillset<\/b><\/h3>\n<p>The other thing about consultants and coaches is sometimes they get a bad press, but I think that&#8217;s because people don&#8217;t necessarily pick in a granular, granular enough way. And what I mean by that is. If you&#8217;re trying to navigate the rapids of finance, there are people who will have very many, many ready made solutions for you.<\/p>\n<p>In many cases, there will be software that will work, but also you&#8217;ll need to have a native guide, as it will as it were. So if you&#8217;re going up Everest, you&#8217;d use a Sherpa. If you&#8217;re navigating through a jungle, you&#8217;d use somebody who knows the jungle intimately. But you didn&#8217;t necessarily assume that one person can navigate you up the Himalayas and across central Africa or whatever.<\/p>\n<p>If you&#8217;re doing a round the world trip, I&#8217;m completely mixing my metaphors, but you got the idea. If I had a map and I wanted to navigate around Cardiff, I wouldn&#8217;t probably ask somebody who lives in London how to navigate around Cardiff. Not because the principles of navigation aren&#8217;t the same, but somebody who knows Cardiff will know the detail much, much better.<\/p>\n<p>And so somebody who knows the territory. So in other words, I&#8217;m saying consultants are great, but just pick your consultants and as your business grows and as you know, the areas that you need help with. Either to determine where the hell am I? You might need a bookkeeper for your finances in order to determine where do I want to go.<\/p>\n<p>You might want to have somebody who&#8217;s got a broader strategic goal setting ability. But in order to go, how do I get there? You might need to, again, break it down to somebody who&#8217;s great at logistics. Now, how do I get products moved around the world or get it cheaper or more efficient? You might want to have somebody who&#8217;s an expert in product design, so how to make my products better so that we can make more profit and so on.<\/p>\n<p>So consultants or experts in individual areas are, I think, underrated. Consultants that are more general are overrated.<\/p>\n<h3><b>Goldratt&#8217;s Questions &#8211; review<\/b><\/h3>\n<p>So getting help is helpful. But in the end, let me just bring it back to Goldratt&#8217;s questions. You&#8217;ve got to decide, where are you? Where do you want to go and how are you going to get there? And so you need to become a navigator, whether you use a sat nav or mini sat navs in part of your life or navigate yourself using maps or even create maps.<\/p>\n<p>If you&#8217;re doing something more radical that is undeniably incredibly important for long term businesses. I hope that was of use and thought provoking as ever. Thank you so much for listening. If, by the way, you wanted to check out the Mastermind, I&#8217;ll probably put some kind of pitch at the end of the recording, but it is at www.<\/p>\n<p>theamazonmastermind. com And if you are doing at least half a million dollars a year in revenue on Amazon, if you&#8217;re based in the UK or Western Europe, or we can get to London a few times a year and are available on Zoom in between. It could be for you. Check it out. Thanks for listening.<\/p>\n<h2><b>The 10K Collective Mastermind<br \/>\n<\/b><\/h2>\n<p>I&#8217;m Michael Veazey from Amazing FBA and I&#8217;m the leader of the 10k Collective Mastermind- a Mastermind for private label sellers and product brand owners who sell at least half a million dollars a year or more on Amazon.<\/p>\n<p>Over the last five years we&#8217;ve had members triple their revenue in one year, grow to eight figures and one member get to a seven- figure exit.<\/p>\n<p>Now we&#8217;re taking it to the next level. I&#8217;m excited to introduce the 10K collective Uber mastermind. It&#8217;s a unique combination of peer group support in person and online and specialist coaching. We give you everything you need to grow your business to high seven figures, and finally start to get that lifestyle you were promised when you went into this.<\/p>\n<p>You&#8217;ll get clear plans from world class specialists on things like intellectual property law, e commerce, image and video marketing, financial engineering and paid advertising to name but a few. You&#8217;ll create bulletproof plans to survive the recession. You&#8217;ll double check with your peers that they make sense and then you&#8217;ll make a plan to make a killing on the rebound.<\/p>\n<p>Most importantly, you will actually transform your business.<\/p>\n<p>You&#8217;ll create listings that convert, build a brand that connects and get premium pricing. You&#8217;ll learn the latest advertising hacks and master stock management, as well as avoiding Amazon curveballs. Above all, you will create a big, bold, three year plan for a seven figure exit. And unlike other programs, we don&#8217;t just hype you up and then abandon you.<\/p>\n<p>You&#8217;ll have your peers in the mastermind, giving you insights from their own businesses and keeping you on track through peer accountability and a little bit of friendly competition. And we&#8217;ll also have those experts double checking. Everything you do makes actual sense.<\/p>\n<p>If you finally want to start becoming the entrepreneur you&#8217;ve always known you can be, if you&#8217;re ready to take your business to seven figures and beyond, then  to find out more about the <a href=\"https:\/\/go.amazingfba.com\/mastermind-V2\" target=\"_blank\" rel=\"noopener\">10k Collective Uber Mastermind<\/a> by clicking here.<\/p>\n<p>If you&#8217;re listening to this on a podcast, just go to TheAmazonmastermind.com. that&#8217;s theAmazonmastermind.com to find out more today.<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FSatnav_as_metaphor-do_you_have_a_clear_goal_you_re_driving_towards_in_your_business_.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fare-you-driving-towards-a-clear-goal-in-your-business%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Satnav_as_metaphor-do_you_have_a_clear_goal_you_re_driving_towards_in_your_business_.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14620-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Satnav_as_metaphor-do_you_have_a_clear_goal_you_re_driving_towards_in_your_business_.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Satnav_as_metaphor-do_you_have_a_clear_goal_you_re_driving_towards_in_your_business_.mp3\">Download<\/a> (Duration: 16:04 &#8212; 14.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 16:04 &#8212; 14.7MB)Subscribe: Spotify | Email | RSS&nbsp; Today I&#8217;m in the car driving, and my mind is turning over on lots of metaphors to do with satnavs and navigation. Where do you want to go and how are you going to get there? Very good questions [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1857],"tags":[1853],"class_list":["post-14620","post","type-post","status-publish","format-standard","hentry","category-general-business","tag-amazing-fba-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Are you driving towards a clear goal in your business? - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Are you driving towards a clear goal in your business? - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 16:04 &#8212; 14.7MB)Subscribe: Spotify | Email | RSS&nbsp; Today I&#8217;m in the car driving, and my mind is turning over on lots of metaphors to do with satnavs and navigation. Where do you want to go and how are you going to get there? Very good questions [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2024-03-04T05:30:21+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-03-01T14:32:52+00:00\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"2 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Are you driving towards a clear goal in your business?\",\"datePublished\":\"2024-03-04T05:30:21+00:00\",\"dateModified\":\"2024-03-01T14:32:52+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/\"},\"wordCount\":3361,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"keywords\":[\"Amazing FBA Podcast\"],\"articleSection\":[\"General Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/\",\"url\":\"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/\",\"name\":\"Are you driving towards a clear goal in your business? - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"datePublished\":\"2024-03-04T05:30:21+00:00\",\"dateModified\":\"2024-03-01T14:32:52+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Are you driving towards a clear goal in your business?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Are you driving towards a clear goal in your business? - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/","og_locale":"en_GB","og_type":"article","og_title":"Are you driving towards a clear goal in your business? - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 16:04 &#8212; 14.7MB)Subscribe: Spotify | Email | RSS&nbsp; Today I&#8217;m in the car driving, and my mind is turning over on lots of metaphors to do with satnavs and navigation. Where do you want to go and how are you going to get there? Very good questions [&hellip;]","og_url":"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2024-03-04T05:30:21+00:00","article_modified_time":"2024-03-01T14:32:52+00:00","author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"2 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Are you driving towards a clear goal in your business?","datePublished":"2024-03-04T05:30:21+00:00","dateModified":"2024-03-01T14:32:52+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/"},"wordCount":3361,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"keywords":["Amazing FBA Podcast"],"articleSection":["General Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/","url":"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/","name":"Are you driving towards a clear goal in your business? - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"datePublished":"2024-03-04T05:30:21+00:00","dateModified":"2024-03-01T14:32:52+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/are-you-driving-towards-a-clear-goal-in-your-business\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Are you driving towards a clear goal in your business?"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-3NO","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14620","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=14620"}],"version-history":[{"count":1,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14620\/revisions"}],"predecessor-version":[{"id":14622,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14620\/revisions\/14622"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=14620"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=14620"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=14620"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}