{"id":14635,"date":"2024-03-07T06:30:51","date_gmt":"2024-03-07T05:30:51","guid":{"rendered":"https:\/\/amazingfba.com\/?p=14635"},"modified":"2024-03-04T23:20:02","modified_gmt":"2024-03-04T22:20:02","slug":"the-power-of-painful-tradeoffs-in-successful-strategy","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/","title":{"rendered":"The Power of Painful Tradeoffs in Successful Strategy"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FThe_Power_of_Painful_Tradeoffs_in_Successful_Strategy-STRATEGY_THURSDAYS.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fthe-power-of-painful-tradeoffs-in-successful-strategy%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/The_Power_of_Painful_Tradeoffs_in_Successful_Strategy-STRATEGY_THURSDAYS.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14635-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/The_Power_of_Painful_Tradeoffs_in_Successful_Strategy-STRATEGY_THURSDAYS.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"The_Power_of_Painful_Tradeoffs_in_Successful_Strategy-STRATEGY_THURSDAYS.mp3\">Download<\/a> (Duration: 15:21 &#8212; 14.1MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>The word strategy is often used and often used wrongly. And there is a mentality that I want to address today around strategy, which is that you can have your cake and eat it. As one of our famous British leaders recently said, that is never true when it comes to strategy. Stay tuned. We&#8217;ll explore why and what you can do instead.<\/p>\n<h2><b>The 10K Collective Mastermind<br \/>\n<\/b><\/h2>\n<p>Hi, I&#8217;m Michael Veazey from Amazing FBA and I&#8217;m the leader of the 10k Collective Mastermind, for private label sellers and product brand owners who sell at least half a million dollars a year or more on Amazon.<\/p>\n<p>Over the last five years we&#8217;ve had members triple their revenue in one year, grow to eight figures and one member get to a seven- figure exit. Now we&#8217;re taking it to the next level. I&#8217;m excited to introduce the 10K collective Uber mastermind.<\/p>\n<p>It&#8217;s a unique combination of peer group support in person and online and specialist coaching.<\/p>\n<p>If you&#8217;re ready to take your business to seven figures and beyond,<\/p>\n<p>just go to TheAmazonmastermind.com. to find out more today.<\/p>\n<h2><b>You Can NOT have your cake and eat it!<\/b><\/h2>\n<p>Let&#8217;s deal with an unpleasant reality. So one of our recent British leaders said,<\/p>\n<p>&#8220;I&#8217;m pro having my cake and pro eating it,&#8221; which is obviously stupid because the whole point of eating a cake is you no longer have a cake. And just as a lot of deluded things came from that person. This was a delusion as well.<\/p>\n<p>What I am going to do is refer to an earlier British leader who said,&#8221; I can only offer you blood, sweat, and tears.&#8221;<\/p>\n<p>Now that&#8217;s not quite true either. What I can offer you as a painful trade offs now in exchange for really powerful strategy and great business growth, if you are willing to embrace the fact that you can&#8217;t have everything. You can have anything you want, but you can&#8217;t have everything you want.<\/p>\n<h2><b>Competitive strategy IS strategy<\/b><\/h2>\n<p>So what am I talking about? Well one of the great books about strategy and competitive strategy specifically, which is most of strategy, I would argue your positioning is kind of to a degree defined by your competition, I would argue.<\/p>\n<p>Certainly in a very crowded market space like Amazon it&#8217;s really almost literally true and pretty much true for everyone because we&#8217;re all in crowded marketplaces because we all depend on either Google or Amazon or possibly Facebook or TikTok, all of which are crowded, all of which are very full of competition.<\/p>\n<p>So let me allay two things to start with. Competitive strategy is strategy.<\/p>\n<h3><b>Strategy IS about tradeoffs<\/b><\/h3>\n<p>And secondly Porter, Michael Porter in his book, Competitive Strategy, basically nails the fact that Strategy is about trade offs. If you have A, you don&#8217;t do B. And if you have B, you don&#8217;t do A, basically.<\/p>\n<h3><b>A time-tested truth<\/b><\/h3>\n<p>Now it&#8217;s an old book, by the way. Some of the 70s or 80s. Examples are a bit dated, but I believe that the, the insights are very, very time tested. And that&#8217;s great because time tested truths of business are not easy to find. And particularly in the digital era, things come and go very quickly. Tactics come and go, but strategic things I think are long lived and strategic truths I think are long lived truths as well.<\/p>\n<p>So that&#8217;s the great news. First of all, if you get this stuff, right, you get the principles, right? If you get into the habits of thoughts and action, they can stick and be valuable for decades. That&#8217;s the great news. The other great thing is if you are willing to make trade offs, there are great Prices at the other side of that, but let&#8217;s explore why you have to make trade offs.<\/p>\n<h2>Examples of strategic tradeoffs<\/h2>\n<h3><b>Premium vs mass market products<\/b><\/h3>\n<p>Let&#8217;s run a thought experiment. Let&#8217;s say that you are selling a USB webcam, such as the one I&#8217;m using by Logitech. Now Logitech has built a brand, that&#8217;s why I bought not one, but I had a good experience, so I bought two Logitech cameras. I may buy another one at some point. Equally, there are much cheaper webcams out there.<\/p>\n<p>Now, you can, if you want, try to create a premium webcam that is better than Logitech. And I&#8217;m sure that people who are into gaming or possibly do Zoom calls using webcams. I now use a digital SLR, which is out of action today may have much, much higher end webcams that cost several hundred dollars or something.<\/p>\n<p>This was, I think, 99 pounds or 120 bucks. There are probably cameras from 10 bucks upwards. Okay. So that&#8217;s a scenario. Now, if you look on Amazon for webcams, you can find something for 30 bucks, 40 bucks, 50 bucks, 99. There&#8217;s probably one at 500. Now you could think of Pricing as one of the aspects of positioning and positioning is a key part of strategy.<\/p>\n<p>We will hopefully explore as well, but one of the positioning tools is price. In other words, are you seen as low price, mid price, high, mid price? Premium price, ultra premium. There&#8217;s no kind of limit in many markets to where that can be positioned.<\/p>\n<h3><b>Tradeoff example &#8211; high price vs unit volume<\/b><\/h3>\n<p>But obviously there&#8217;s a trade off between how many units you sell and your premium positioning. Somebody who&#8217;s selling say a 500 webcam probably doesn&#8217;t expect to sell. 1000 units a month relative to if that&#8217;s the norm for somebody selling a 30 webcam, and maybe it&#8217;s 10, 000 versus 100, 000 or whatever. You get the idea. Let&#8217;s keep the number simple. In other words, there is a trade off between the price you sell at and the number of units you sell normally.<\/p>\n<h3><b>Example iPhone vs Galaxy &#8211; unit share vs market share ($ value) <\/b><\/h3>\n<p>Now, not always true. You could take the iPhone as an account, for example which became and has stayed immensely popular in terms of unit sales, except. That&#8217;s not true either. If you take that as an example, you can look at Samsung Galaxy versus iPhones. And if you look at the statistics that I&#8217;ve read, in unit sales terms, in other words, the number of phones that are sold per year, Galaxy is, has got a huge percentage of the phone, smartphone market globally.<\/p>\n<p>But if you look in terms of the revenue generated, that is to say the amount of money that is made, nevermind the profits that&#8217;s a different thing. Again, if you look at the revenue generated you&#8217;ll find that the iPhone has a very big share of market because although they sell fewer units, they sell for so much more money. Their market share is pretty high.<\/p>\n<h3><b>Profit vs Market Share<\/b><\/h3>\n<p>And if you look again at Samsung versus Apple now, I don&#8217;t know the breakdown by, by their phone divisions, but I do know that Apple is one of the most profitable companies ever. Now I don&#8217;t know if Samsung is as profitable. Haven&#8217;t looked at it, but chances are it is less profitable because the, the gross, the premium pricing isn&#8217;t there per product. So there&#8217;s just less margin to play with. There&#8217;s less price coming in to play with, to, to pay for the actual physical product itself, the marketing, the delivery, and so on and so forth, or the costs, the direct costs and the overhead.<\/p>\n<p>Apple is that rare beast, which is a large, large, well, huge, probably the hugest company at any given point that is also got a very high profit margin. I believe sometimes it&#8217;s 20 to 30 percent rate. So there is a trade off there. I&#8217;m sure that if Apple reduced the cost of its units, it can increase its market share in revenue terms, it could certainly increase the number of units it sells, but it would massively decrease the profit margin.<\/p>\n<h2><b>Chasing the wrong target destroys business value <\/b><\/h2>\n<p>And personally, I think that would be a bit of a stupid thing to do because they built a premium positioning. If they destroyed that, they&#8217;re basically destroying the whole basis of not just their business model, but their reputation as well. So there is a trade off there. And that is an example of what I mean by trade offs.<\/p>\n<h3><b>Cheap products vs Premium positioning <\/b><\/h3>\n<p>and you can find it everywhere. You cannot be known as a really high quality provider of things. And have the cheapest cost price. I&#8217;m not saying over time, you can&#8217;t reduce your cost price. I&#8217;m not saying you wouldn&#8217;t look for efficiency savings. I&#8217;m sure that iPhones are produced with an eye to efficiency and cost saving all the time.<\/p>\n<p>But that is different from trying to be the cheapest to produce and the most expensive to sell. And it sounds really obvious when I put it like this, but a lot of people that come into my world, particularly, it&#8217;s got to be said. People who are early stage entrepreneurs try and achieve both. And of course that is never going to work.<\/p>\n<h3><b>A foolish tradeoff- being &#8220;good at everything&#8221; with a high product cost<\/b><\/h3>\n<p>Other people fall into other traps. For example, they up their cost per unit to being very high compared to their competition, which is a competitive disadvantage in itself. If you take that in isolation and then they kid themselves that because they&#8217;ve added 10 different features. And all to a high generic quality, which may well be true, by the way, that they can then out compete other people who are much clearer about what their value proposition is and, and are much, much better building a brand.<\/p>\n<p>In other words, a, a differentiated. Offering a feeling of connection, name recognition, a look, feel, and mood and so on, that is very, very clear for the best brands. So that is another form of failed trade off because you can&#8217;t just go for quotes quality, for example, without having a, a decision of which aspects of your device are going to be great quality.<\/p>\n<h3><b>Size and weight vs funcationality<\/b><\/h3>\n<p>Size<\/p>\n<p>For example, again, to take the iPhone or a Logitech USB camera. A webcam, you could probably get much, much better resolution by making the webcam five times bigger and heavier. And it might not even be that much more expensive because miniaturization is expensive to, to create. Although once you mass produce it cheaper per unit.<\/p>\n<p>But let&#8217;s say that the webcam is five times bigger. Well, now I&#8217;ve got to lug this thing around with me if I take it on the road with me, which I do. So that is less attractive. So it turns out that what Logitech is trying to do is not to be the best webcam ever, but the best webcam at a certain price range with a certain capability and a certain size, weight, and convenience in terms of the packaging that it has.<\/p>\n<p>And so in the end You have to decide what trade offs you&#8217;re going to make. Nothing you do is going to be A and B. It&#8217;s not going to be small and the best featured product in the world. It&#8217;s not going to be light and as robust possibly as a really big one.<\/p>\n<h2><b>The hidden tradeoff of Research &amp; Development costs (and time) <\/b><\/h2>\n<p>Although it&#8217;s possible to combine the two, by the way -if you can you&#8217;ve really cracked something there.<\/p>\n<h3><b>Ford&#8217;s cheap cars came at a cost &#8211; to Ford<\/b><\/h3>\n<p>For example, Ford with the cars that he produced. One had produced cheap cars. It&#8217;s back in the 1920s and have really, really strong cars and have lighter cars. And he just achieved that by using, I believe, vanadium steel, some form of steel alloy anyway, as opposed to just straight up steel because it was the same strength for a smaller weight, which meant that the cars were lighter, they went faster, they were more fuel efficient, and they were probably in the end, cheaper to produce.<\/p>\n<h3><b>The R &amp;D costs for Ford&#8217;s vanadium steel<\/b><\/h3>\n<p>But there was a trade off, which is he had to develop a whole new expensive technology, which took a lot of capital investment upfront and time and effort and focus and lots of failures before you then succeeded in creating this new thing, at which point then the trade off. paid off massively for him and his company, but that&#8217;s another example of a trade off. You may want to develop something with great capital intensity and research and development R&amp; D costs that then pays off in the future. You hope if it works, but again, that is a trade off.<\/p>\n<h2><b>Tradeoffs are INTRINSIC to Strategy &#8211; a feature not a bug!<\/b><\/h2>\n<p>So I just wanted to get that right out there, up front and center, before we get into any further discussion about strategy, because the essential thing to realize is you can be A, but not B, or you can be A and B, but there&#8217;s some hidden C there.<\/p>\n<p>For example, if in Ford&#8217;s case, it was both lighter and cheaper than the competition, but the trade off was it wasn&#8217;t cheap and easy to produce that process to start with. Took a lot of R&amp; D costs and a lot of expensive failures as, as all research and development does. And again, that&#8217;s another thing that is a trade off.<\/p>\n<h3><b>Standard vs unique products<\/b><\/h3>\n<p>Are you just creating something that is fairly. Standard, but in a mildly better form while you&#8217;re going very radical as, as as was the case with Ford or creating the smartphone, an entirely new type of device really, or fairly much new? And there is massive trade off there.<\/p>\n<h3><b>Is your product really &#8220;The next iPhone&#8221;?<\/b><\/h3>\n<p>So again, don&#8217;t kid yourself that you can create the next iPhone, the next Model T Ford, the next great AI program, whatever it may be. And not have the research and development costs and, and difficulties and challenges. Dyson who created the Hoover or the vacuum cleaner that was bagless took thousands of of goes and many, many, many years of spending a lot of money to get to that point. That&#8217;s another example. There are many other examples of that.<\/p>\n<h3><b>Key strategy question: is the tradeoff worthwhile?<\/b><\/h3>\n<p>So again, is it a trade off that is worthwhile? That&#8217;s a different question. And we will get into that more nuanced question later.<\/p>\n<h3><b>Are you grown up enough to accept tradeoffs? <\/b><\/h3>\n<p>But as long as you&#8217;re grown up enough, if I may say that word, to accept that the brutal absolute reality of trade offs is at the center of strategy, then we can talk Turkey, we can talk business, and we can actually help you with your strategy.<\/p>\n<h3><b>Tradeoffs as business strategy are time-proof<\/b><\/h3>\n<p>I do find that, that looking across the broader business landscape for strategic lessons, not literally copying, not tactical, not do this. And I got rich last year questions, but what happened a hundred years ago, 150 years ago, that is still true.<\/p>\n<p>Now I find those are very robust for a time proof lessons. And I find those therefore. Very, very worthwhile. So I hope you are also as impassioned about those sorts of topics as I am. Thank you for listening and stay tuned as ever to the 10k collective podcast. Thanks for listening.<\/p>\n<h1><b>The 10K Collective Mastermind <\/b><\/h1>\n<p>I&#8217;m Michael Veazey from Amazing FBA and I&#8217;m the leader of the 10k Collective Mastermind- a Mastermind for private label sellers and product brand owners who sell at least half a million dollars a year or more on Amazon.<\/p>\n<p>Over the last five years we&#8217;ve had members triple their revenue in one year, grow to eight figures and one member get to a seven- figure exit.<\/p>\n<p>Now we&#8217;re taking it to the next level. I&#8217;m excited to introduce the 10K collective Uber mastermind. It&#8217;s a unique combination of peer group support in person and online and specialist coaching. We give you everything you need to grow your business to high seven figures, and finally start to get that lifestyle you were promised when you went into this.<\/p>\n<p>You&#8217;ll get clear plans from world class specialists on things like intellectual property law, e commerce, image and video marketing, financial engineering and paid advertising to name but a few. You&#8217;ll create bulletproof plans to survive the recession. You&#8217;ll double check with your peers that they make sense and then you&#8217;ll make a plan to make a killing on the rebound.<\/p>\n<p>Most importantly, you will actually transform your business.<\/p>\n<p>You&#8217;ll create listings that convert, build a brand that connects and get premium pricing. You&#8217;ll learn the latest advertising hacks and master stock management, as well as avoiding Amazon curveballs. Above all, you will create a big, bold, three year plan for a seven figure exit. And unlike other programs, we don&#8217;t just hype you up and then abandon you.<\/p>\n<p>You&#8217;ll have your peers in the mastermind, giving you insights from their own businesses and keeping you on track through peer accountability and a little bit of friendly competition. And we&#8217;ll also have those experts double checking. Everything you do makes actual sense.<\/p>\n<p>If you finally want to start becoming the entrepreneur you&#8217;ve always known you can be, if you&#8217;re ready to take your business to seven figures and beyond,<\/p>\n<p>go to TheAmazonmastermind.com. to find out more today.<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FThe_Power_of_Painful_Tradeoffs_in_Successful_Strategy-STRATEGY_THURSDAYS.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fthe-power-of-painful-tradeoffs-in-successful-strategy%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/The_Power_of_Painful_Tradeoffs_in_Successful_Strategy-STRATEGY_THURSDAYS.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14635-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/The_Power_of_Painful_Tradeoffs_in_Successful_Strategy-STRATEGY_THURSDAYS.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"The_Power_of_Painful_Tradeoffs_in_Successful_Strategy-STRATEGY_THURSDAYS.mp3\">Download<\/a> (Duration: 15:21 &#8212; 14.1MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 15:21 &#8212; 14.1MB)Subscribe: Spotify | Email | RSSThe word strategy is often used and often used wrongly. And there is a mentality that I want to address today around strategy, which is that you can have your cake and eat it. As one of our famous British [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1857],"tags":[1853],"class_list":["post-14635","post","type-post","status-publish","format-standard","hentry","category-general-business","tag-amazing-fba-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Power of Painful Tradeoffs in Successful Strategy - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"description\" content=\"Can you your cake and eat it? No you can&#039;t! Accepting this is a cornestone of successful strategy. We explore why.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Power of Painful Tradeoffs in Successful Strategy - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Can you your cake and eat it? No you can&#039;t! Accepting this is a cornestone of successful strategy. We explore why.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2024-03-07T05:30:51+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-03-04T22:20:02+00:00\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"2 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"The Power of Painful Tradeoffs in Successful Strategy\",\"datePublished\":\"2024-03-07T05:30:51+00:00\",\"dateModified\":\"2024-03-04T22:20:02+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/\"},\"wordCount\":3023,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"keywords\":[\"Amazing FBA Podcast\"],\"articleSection\":[\"General Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/\",\"url\":\"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/\",\"name\":\"The Power of Painful Tradeoffs in Successful Strategy - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"datePublished\":\"2024-03-07T05:30:51+00:00\",\"dateModified\":\"2024-03-04T22:20:02+00:00\",\"description\":\"Can you your cake and eat it? No you can't! Accepting this is a cornestone of successful strategy. We explore why.\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Power of Painful Tradeoffs in Successful Strategy\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Power of Painful Tradeoffs in Successful Strategy - Amazing FBA - Grow your 7-Figure Amazon Business","description":"Can you your cake and eat it? No you can't! Accepting this is a cornestone of successful strategy. We explore why.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/","og_locale":"en_GB","og_type":"article","og_title":"The Power of Painful Tradeoffs in Successful Strategy - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Can you your cake and eat it? No you can't! Accepting this is a cornestone of successful strategy. We explore why.","og_url":"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2024-03-07T05:30:51+00:00","article_modified_time":"2024-03-04T22:20:02+00:00","author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"2 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"The Power of Painful Tradeoffs in Successful Strategy","datePublished":"2024-03-07T05:30:51+00:00","dateModified":"2024-03-04T22:20:02+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/"},"wordCount":3023,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"keywords":["Amazing FBA Podcast"],"articleSection":["General Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/","url":"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/","name":"The Power of Painful Tradeoffs in Successful Strategy - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"datePublished":"2024-03-07T05:30:51+00:00","dateModified":"2024-03-04T22:20:02+00:00","description":"Can you your cake and eat it? No you can't! Accepting this is a cornestone of successful strategy. We explore why.","breadcrumb":{"@id":"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/the-power-of-painful-tradeoffs-in-successful-strategy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"The Power of Painful Tradeoffs in Successful Strategy"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-3O3","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14635","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=14635"}],"version-history":[{"count":1,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14635\/revisions"}],"predecessor-version":[{"id":14636,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14635\/revisions\/14636"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=14635"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=14635"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=14635"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}