{"id":14649,"date":"2024-03-18T06:30:23","date_gmt":"2024-03-18T05:30:23","guid":{"rendered":"https:\/\/amazingfba.com\/?p=14649"},"modified":"2024-03-15T16:02:45","modified_gmt":"2024-03-15T15:02:45","slug":"getting-your-short-term-goals-your-day-job-ninja-skills","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/","title":{"rendered":"Getting your short term goals &#8211;  your Day Job Ninja skills"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FYour_ninja_day_job_skills_MINDSET_MONDAY.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fgetting-your-short-term-goals-your-day-job-ninja-skills%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Your_ninja_day_job_skills_MINDSET_MONDAY.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14649-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Your_ninja_day_job_skills_MINDSET_MONDAY.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Your_ninja_day_job_skills_MINDSET_MONDAY.mp3\">Download<\/a> (Duration: 11:06 &#8212; 10.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>You&#8217;ve presumably at some point commuted for work or travelled for work. I certainly have. I would often do that for not a lot of money and I would do it repeatedly to earn a living. Assuming you were reliable, you were achieving a simple short-term goal: turning up at work.<\/p>\n<p>And yet when I look back over the preceding years or decade and the short term goals I had for my life in business, I would say, well, how come I haven&#8217;t achieved those? I haven&#8217;t been reliable for myself doing big stuff with big payoffs myself. And yet I&#8217;ve been reliable for some petty stuff for other people. Why that difference? Well, let&#8217;s explore that today.<\/p>\n<h2>The 10K Collective Mastermind<\/h2>\n<p>Hi, I&#8217;m Michael Veazey from Amazing FBA and I&#8217;m the leader of the 10k Collective Mastermind, for private label sellers and product brand owners who sell at least half a million dollars a year or more on Amazon.<\/p>\n<p>Over the last five years we&#8217;ve had members triple their revenue in one year, grow to eight figures and one member get to a seven-figure exit. Now we&#8217;re taking it to the next level. I&#8217;m excited to introduce the 10K collective Uber mastermind.<\/p>\n<p>It&#8217;s a unique combination of peer group support in person and online and specialist coaching.<\/p>\n<p>If you&#8217;re ready to take your business to seven figures and beyond, just go to <a href=\"https:\/\/go.amazingfba.com\/mastermind-V2\" target=\"_blank\" rel=\"noopener\">TheAmazonmastermind.com<\/a>. to find out more today.<\/p>\n<h2>Becoming as reliable for your own short term goals as you were for others<\/h2>\n<p>You&#8217;ve presumably at some point commuted for work or traveled for work. I certainly have. Imagine that we, we think back to when I would rush out of one bit of work, jump on a bike, risk death, drive, cycle through the rain- welcome to London- jump into a crowded train having hustled past the barriers and the idiots that always seem to be in the way in London and then folded my bike up, got on the train, folded it out the other end and went somewhere else.<\/p>\n<p>That sounds exhausting and I would often do that for not a lot of money and I would do it repeatedly to earn a living.<\/p>\n<p>And yet when I look back over the pre preceding years or decade and the big goals I had for my life in business, I would say, well, how come I haven&#8217;t achieved those?<\/p>\n<h2>We care about other people&#8217;s opinions &#8211; use that!<\/h2>\n<p>So first of all, I think other people is a really neglected thing in motivation. It&#8217;s pretty simple, but it&#8217;s really true that if you try and do stuff on your own and you haven&#8217;t got anyone else involved, they don&#8217;t know what you are trying to achieve and therefore you can&#8217;t be seen to win, but you can&#8217;t be seen to fail.<\/p>\n<p>And it turns out that loss aversion is a much bigger motivator for action in the day-to-day world. So if you&#8217;re going to be seen by somebody who&#8217;s being late at work and you think you&#8217;re going to lose your source of income, i.e. your job or a piece of employment and you&#8217;re going to look a professional and people are going to look down at you, you&#8217;re very highly motivated to do that thing.<\/p>\n<p>How much work do you put into thinking how bad life&#8217;s going to be if you don&#8217;t achieve your business short term goals?<\/p>\n<p>So how can you apply that to your own business?<\/p>\n<h3>How to get accountability<\/h3>\n<p>I would suggest you want to make as many promises to other people as you can, and then make sure you hold yourself to them. That&#8217;s the first thing. Shareholders. Customers if you&#8217;re selling products on Amazon or an e-commerce site getting something out there and forcing yourself to get into action really forces you to stay in action in my experience.<\/p>\n<p>And of course, your own community of peers, nobody wants to look like an unsuccessful person in the community of peers. Just make sure you judge success in the right way.<\/p>\n<p>. Now I want to explore a couple of things as well about how I specifically would make sure that I, even though I&#8217;m not a person who&#8217;s naturally on time, I would make sure I got to a train or for that matter, years before that would be driving to appointments.<\/p>\n<h2>Extreme Short Term Goal clarity<\/h2>\n<p>First of all, short term goal clarity: We&#8217;ve got to get to a defined place &#8211;  a train station, an exact platform, a very defined time &#8211; and there&#8217;s a deadline. If I get to the platform For an 1857 train at 1859, assuming it&#8217;s on time, I&#8217;ve missed it. And public transport, by the way, does force that sort of what&#8217;s the word, digitizes life.<\/p>\n<p>You either make it or you don&#8217;t. It&#8217;s not quite like being in a car where you can be running 10 minutes late, but still roughly arrive on time. And that level of goal clarity is very powerful.<\/p>\n<p>And we don&#8217;t tend, I don&#8217;t tend, and my clients don&#8217;t tend to have that in business that they let themselves off it it&#8217;s not a deadline. It&#8217;s a kind of wish time.<\/p>\n<h2>Clear steps to the short term goal<\/h2>\n<p>It&#8217;s important again, to be rigorous in this stuff: clear, exact steps of how to get from A to B.<\/p>\n<p>I used to cycle around from school to school or drive from school to school.<\/p>\n<p>If I&#8217;m leaving the building, I&#8217;ve got to go up the steps. I&#8217;ve got to go along a path. I&#8217;ve got to cycle down certain routes and then. I&#8217;ve got to walk through the station, I&#8217;ve got to follow the bike up, I&#8217;ve got to get through the ticket barriers. It&#8217;s all very, very predefined and precise and straightforward, but clear.<\/p>\n<p>How much clarity have you got about the next steps that you need for your next big project? Have you broken it right down? Right, right, right down? If not, that is one of the barriers between you doing it and not doing it, if this is an amorphous mass in your mind, no wonder you&#8217;re not doing it. Because it doesn&#8217;t seem doable and at an unconscious level, you&#8217;re gonna be shying away from it as opposed to going, right, I know where I&#8217;m going.<\/p>\n<p>I see it. Visualize it in my mind.<\/p>\n<h3>Clear route (hint use existing maps and technology)<\/h3>\n<p>Next thing talking of a route and cycling along, a satnav will, will define your route exactly for you. How do you get from A to B on a bike in London or anywhere else? And it turns out that actually in e commerce life and business life and careers, a lot of the time, there are a lot of very, Simple predefined routes that can be worked out for you either by a piece of software.<\/p>\n<p>For example, if you&#8217;re analyzing Amazon markets, you could use Data Dive or Helium 10, Jungle scout one of those, or if you&#8217;re trying to move freight from China to the USA, for example, these are things that have been done many hundreds of thousands, if not millions of times before. And there are predefined routes.<\/p>\n<p>Have you found those routes?<\/p>\n<h2>Use the right vehicles to get to your short term goal<\/h2>\n<p>And then the final thing to touch on is the right vehicles.<\/p>\n<p>Now, when I lived in Surrey and was doing some teaching and playing and conducting, I would drive around by car because it&#8217;s in the country and it&#8217;s easy to get around that way.<\/p>\n<p>I tried that when I moved to London from Surrey and it was a total and utter nightmare because London&#8217;s got the slowest traffic jams in the world now, including LA.<\/p>\n<p>And so if I want to get around London, I use a mixture of public transport and walking, but also the secret now I&#8217;ve discovered is a folding bike, which means I can cycle between points where I can&#8217;t use public transport very quickly or easily, which is a lot quicker than walking.<\/p>\n<p>I can fold it up so I can use peak time public transport, like trains or tubes, the Underground, Subway, or whatever you want to call it. And it just means I&#8217;m really maximizing my speed around the system in a pretty cost-effective way as well. It&#8217;s hard work. I&#8217;m not saying it&#8217;s the perfect vehicle.<\/p>\n<p>Maybe at some point, I will start using a car more again, but the point is this, certain vehicles are right for certain contexts and situations that will be completely wrong for others.<\/p>\n<h3>Literally changing freight vehicles<\/h3>\n<p>If you want to use a, if you want to use that metaphor very literally in your business, we&#8217;ll think about freight<\/p>\n<p>If you are launching new products that are quite light and quite high value density, if you&#8217;re selling watches, for example, they don&#8217;t weigh much or take much space up. You should be considering air freighting stuff, particularly if you&#8217;re launching new products or if you&#8217;re going back to run out of stock and make a huge lose opportunity costs, if you like, not something that shows up in your finances, but an opportunity cost of a lot of lost sales.<\/p>\n<p>On the other hand, if you&#8217;re shipping expensive stuff around the world, using inefficient freight, then you may want to start considering getting a less-than-container loading and getting consolidated containers.<\/p>\n<p>And guess what? You don&#8217;t need to become an expert at this. You just need to look into it, consider the possibilities, and then talk to somebody who is an expert, otherwise known as a freight forwarder. And again, it&#8217;s thinking about the mix of vehicles for your physical products.<\/p>\n<h3>Wealth Vehicles<\/h3>\n<p>Now we talked about vehicles as a wealth vehicle metaphor That&#8217;s more complex. I&#8217;m not going to get too much into that except to say that you may be misperceiving the business you&#8217;re in.<\/p>\n<p>If you want to generate cash flow, I would argue that an e-commerce business is not a great vehicle for that necessarily, because you&#8217;re going to have to keep putting money back into inventory. But it is a great vehicle for generating wealth if you build a sellable business.<\/p>\n<p>Having said that, if you want to generate more cash, you might want to do something else. You might do some consulting or run an Amazon agency. By the way, I believe there are about 438, 000 Amazon agencies. So don&#8217;t assume if you&#8217;re selling Amazon products on Amazon, that it is going to be easier to be a consultant, run a podcast, or be an Amazon agency owner. But if you want certain outcomes, certain vehicles will create different outcomes. And you need to be clear again, short term goal clarity. What are you trying to get? What vehicle will help you get it the most efficiently?<\/p>\n<h2>Use your ninja day job skills to get your short term goal<\/h2>\n<p>So just to recap.<\/p>\n<p>I&#8217;m assuming that the people listening to the podcast are employable people, economically viable, then just really think about all those different habits that you&#8217;ve got over the years and apply those to your business work.<\/p>\n<p>Or for that matter, your dream career, that rigour, that clarity, that step-by-step and that accountability. And I swear that you are going to do better in your job of building your dream business rather than just building somebody else&#8217;s wealth.<\/p>\n<p>Thank you so much for listening. I hope that was useful. I will speak to you soon.<\/p>\n<h1>The 10K Collective Mastermind<\/h1>\n<p>I&#8217;m Michael Veazey from Amazing FBA and I&#8217;m the leader of the 10k Collective Mastermind- a Mastermind for private label sellers and product brand owners who sell at least half a million dollars a year or more on Amazon.<\/p>\n<p>Over the last five years we&#8217;ve had members triple their revenue in one year, grow to eight figures and one member get to a seven-figure exit.<\/p>\n<p>Now we&#8217;re taking it to the next level. I&#8217;m excited to introduce the 10K collective Uber mastermind. It&#8217;s a unique combination of peer group support in person and online and specialist coaching. We give you everything you need to grow your business to high seven figures, and finally start to get that lifestyle you were promised when you went into this.<\/p>\n<p>You&#8217;ll get clear plans from world-class specialists on things like intellectual property law, e-commerce, image and video marketing, financial engineering and paid advertising to name but a few. You&#8217;ll create bulletproof plans to survive the recession. You&#8217;ll double-check with your peers that they make sense and then you&#8217;ll make a plan to make a killing on the rebound.<\/p>\n<p>Most importantly, you will transform your business.<\/p>\n<p>You&#8217;ll create listings that convert, build a brand that connects and get premium pricing. You&#8217;ll learn the latest advertising hacks and master stock management, as well as avoiding Amazon curveballs. Above all, you will create a big, bold, three-year plan for a seven-figure exit. And unlike other programs, we don&#8217;t just hype you up and then abandon you.<\/p>\n<p>You&#8217;ll have your peers in the mastermind, giving you insights from their own businesses and keeping you on track through peer accountability and a little bit of friendly competition. And we&#8217;ll also have those experts double-checking. Everything you do makes actual sense.<\/p>\n<p>If you finally want to start becoming the entrepreneur you&#8217;ve always known you can be, if you&#8217;re ready to take your business to seven figures and beyond, go to <a href=\"https:\/\/go.amazingfba.com\/mastermind-V2\" target=\"_blank\" rel=\"noopener\">TheAmazonmastermind.com<\/a>. to find out more today.<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FYour_ninja_day_job_skills_MINDSET_MONDAY.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fgetting-your-short-term-goals-your-day-job-ninja-skills%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Your_ninja_day_job_skills_MINDSET_MONDAY.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14649-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Your_ninja_day_job_skills_MINDSET_MONDAY.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Your_ninja_day_job_skills_MINDSET_MONDAY.mp3\">Download<\/a> (Duration: 11:06 &#8212; 10.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 11:06 &#8212; 10.2MB)Subscribe: Spotify | Email | RSSYou&#8217;ve presumably at some point commuted for work or travelled for work. I certainly have. I would often do that for not a lot of money and I would do it repeatedly to earn a living. Assuming you were reliable, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":14652,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1853],"class_list":["post-14649","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-amazing-fba-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Getting your short term goals - your Day Job Ninja skills - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"description\" content=\"You&#039;ve probably travelled for work for small money and yet been reliable. But what about your own short term goals you care about?\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Getting your short term goals - your Day Job Ninja skills - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"You&#039;ve probably travelled for work for small money and yet been reliable. But what about your own short term goals you care about?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2024-03-18T05:30:23+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-03-15T15:02:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/03\/bicycling-1322416_640.jpg?fit=640%2C427&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"640\" \/>\n\t<meta property=\"og:image:height\" content=\"427\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Getting your short term goals &#8211; your Day Job Ninja skills\",\"datePublished\":\"2024-03-18T05:30:23+00:00\",\"dateModified\":\"2024-03-15T15:02:45+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/\"},\"wordCount\":2374,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/03\/bicycling-1322416_640.jpg?fit=640%2C427&ssl=1\",\"keywords\":[\"Amazing FBA Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/\",\"url\":\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/\",\"name\":\"Getting your short term goals - your Day Job Ninja skills - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/03\/bicycling-1322416_640.jpg?fit=640%2C427&ssl=1\",\"datePublished\":\"2024-03-18T05:30:23+00:00\",\"dateModified\":\"2024-03-15T15:02:45+00:00\",\"description\":\"You've probably travelled for work for small money and yet been reliable. But what about your own short term goals you care about?\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/03\/bicycling-1322416_640.jpg?fit=640%2C427&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/03\/bicycling-1322416_640.jpg?fit=640%2C427&ssl=1\",\"width\":640,\"height\":427},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Getting your short term goals &#8211; your Day Job Ninja skills\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Getting your short term goals - your Day Job Ninja skills - Amazing FBA - Grow your 7-Figure Amazon Business","description":"You've probably travelled for work for small money and yet been reliable. But what about your own short term goals you care about?","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/","og_locale":"en_GB","og_type":"article","og_title":"Getting your short term goals - your Day Job Ninja skills - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"You've probably travelled for work for small money and yet been reliable. But what about your own short term goals you care about?","og_url":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2024-03-18T05:30:23+00:00","article_modified_time":"2024-03-15T15:02:45+00:00","og_image":[{"width":640,"height":427,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/03\/bicycling-1322416_640.jpg?fit=640%2C427&ssl=1","type":"image\/jpeg"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Getting your short term goals &#8211; your Day Job Ninja skills","datePublished":"2024-03-18T05:30:23+00:00","dateModified":"2024-03-15T15:02:45+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/"},"wordCount":2374,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/03\/bicycling-1322416_640.jpg?fit=640%2C427&ssl=1","keywords":["Amazing FBA Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/","url":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/","name":"Getting your short term goals - your Day Job Ninja skills - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/03\/bicycling-1322416_640.jpg?fit=640%2C427&ssl=1","datePublished":"2024-03-18T05:30:23+00:00","dateModified":"2024-03-15T15:02:45+00:00","description":"You've probably travelled for work for small money and yet been reliable. But what about your own short term goals you care about?","breadcrumb":{"@id":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/03\/bicycling-1322416_640.jpg?fit=640%2C427&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/03\/bicycling-1322416_640.jpg?fit=640%2C427&ssl=1","width":640,"height":427},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/getting-your-short-term-goals-your-day-job-ninja-skills\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Getting your short term goals &#8211; your Day Job Ninja skills"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/03\/bicycling-1322416_640.jpg?fit=640%2C427&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-3Oh","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14649","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=14649"}],"version-history":[{"count":2,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14649\/revisions"}],"predecessor-version":[{"id":14675,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14649\/revisions\/14675"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/14652"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=14649"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=14649"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=14649"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}