{"id":14681,"date":"2024-04-02T07:00:35","date_gmt":"2024-04-02T06:00:35","guid":{"rendered":"https:\/\/amazingfba.com\/?p=14681"},"modified":"2024-04-11T12:21:23","modified_gmt":"2024-04-11T11:21:23","slug":"why-an-ecommerce-business-isnt-really-a-cash-cow","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/","title":{"rendered":"Why an Ecommerce business isn&#8217;t really a cash cow"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FWhy_an_Ecommerce_business_isn_t_really_a_cash_cow_v_2_0.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fwhy-an-ecommerce-business-isnt-really-a-cash-cow%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Why_an_Ecommerce_business_isn_t_really_a_cash_cow_v_2_0.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14681-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Why_an_Ecommerce_business_isn_t_really_a_cash_cow_v_2_0.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Why_an_Ecommerce_business_isn_t_really_a_cash_cow_v_2_0.mp3\">Download<\/a> (Duration: 10:34 &#8212; 9.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Hey folks. I want to discuss what is kind of a hard topic, which is why an e-commerce business isn&#8217;t a cash cow. It&#8217;s not what is advertised to be on the internet, but the good news is it could make you more money than you think, as long as you know what you&#8217;re dealing with.<\/p>\n<h2>The myth of the e-com cash cow<\/h2>\n<p>So folks let&#8217;s talk about the myth of an e-commerce business as a cash cow.<\/p>\n<p>There is a lot of misconception on the internet about the cash-generating potential of e-commerce ventures. I&#8217;m talking about things with physical products at their heart, and therefore inventory, which changes everything. And we need to examine this.<\/p>\n<h2>Typical cash cow digital businesses<\/h2>\n<p>Now let&#8217;s talk about what we mean by cash cow.<\/p>\n<p>First of all, I&#8217;m talking really about things that produce money. In cash in other words without much capital investment.<\/p>\n<p>The examples that spring to mind: are coaching. I know all about that because I&#8217;ve been doing that online for years. The upsides: you don&#8217;t need to pay much money, or even any to start, if you just use influencer platforms like podcasting as I did to start with, but you need to spend a little bit of money on a little bit of equipment- podcast, mics very, very cheap. You can do it with your phone these days.<\/p>\n<p>Downsides of course. You cannot just sell that easily, because it depends on your face and your brand. Also, you&#8217;re trading time for money, unless you scale it up to be running a huge coaching practice.<\/p>\n<p>And then you&#8217;re trying to scale up people. and hiring people is not easy to scale in the same way as digital systems or physical products. So it is not the easy option it might appear.<\/p>\n<p>But it doesn&#8217;t require necessarily a lot of capital stuck in the business.<\/p>\n<p>Digital business models, also digital products like books, have the same characteristic.<\/p>\n<p>So I&#8217;m not discussing those; what I mean is an e-commerce business model is where you own the inventory that you sell.<\/p>\n<h2>Challenge 1: Profit margins<\/h2>\n<p>So let&#8217;s talk about the challenges of e-commerce business models and what I think they are not. And what I think they are.<\/p>\n<p>First of all. It&#8217;s not a profit monster. There are certain types of business models where you might spend some money on YouTube ads for example, and then you sell your coaching &#8211; time for money trade, but at least it&#8217;s 70% profit.<\/p>\n<p>But you have quite healthy profit margins in that kind of business- digital product businesses, very healthy margins.<\/p>\n<p>Not so much with physical products.<\/p>\n<p>You have to buy the products. You have to ship them around, you have to store them, you have to fulfill them.<\/p>\n<p>And then you&#8217;ve got to pay for whichever platform helps you sell them. Amazon takes a 15% sales commission.<\/p>\n<p>Plus then you&#8217;ve got to pay for traffic in the form of ads to wherever you sell them, you&#8217;ve got to pay for ads.<\/p>\n<p>So the Operating costs are pretty high.<\/p>\n<h2>The heart of the matter: capital intensity<\/h2>\n<p>But here&#8217;s the true meat of the matter. The heart of the matter is capital.<\/p>\n<p>If you want to have an inventory-based business, you need to think about the balance sheet.<\/p>\n<h3>All assets are not created equal<\/h3>\n<p>To put it simply, the assets are the things that the company owns. Most Amazon or Shopify-type businesses don&#8217;t tend to own many things that unless you&#8217;ve been, you&#8217;ve got a very big business. They don&#8217;t tend to own warehouses and offices unless they&#8217;re really big, but they do own normally two major assets, which is cash and inventory.<\/p>\n<p>And if you want to have stock in inventory, you&#8217;re swapping cash for inventory.<\/p>\n<h3>Profit is not the same as cash (not even close)<\/h3>\n<p>And here&#8217;s the thing. If you increase the value of the equity in the business and assume there&#8217;s no debt, that&#8217;s the same as the assets in the business, you can have a paper profit.<\/p>\n<p>Let&#8217;s say you have at the start of your trading a hundred thousand dollars in cash and zero inventory.<\/p>\n<p>And at the end of the year, you&#8217;ve turned the cash into inventory. You&#8217;ve turned the inventory twice. And you&#8217;ve maybe got $200,000 in inventory and $10,000 in cash.<\/p>\n<p>While you&#8217;ve increased the equity in that business from a hundred thousand to 210,000, so you&#8217;ve made a whopping profit that year.<\/p>\n<p>Haven&#8217;t you? Because the equity&#8217;s increased.<\/p>\n<h3>You can&#8217;t spend profits!<\/h3>\n<p>But, &#8211; oh but &#8211; my friends, the cash has gone down from a hundred thousand to 10,000.<\/p>\n<p>So you can&#8217;t go away and start spending that profit of 110,000 you&#8217;ve made because you need that money in the business  to pay a few bills.<\/p>\n<h2>Real estate is the closest familiar business model<\/h2>\n<p>The best analogy for this, as a business model, is real estate I think, or property, which is to say you put money in and it&#8217;s there. You don&#8217;t take it back out again. And you get the rent and if you want to, at some point sell the property, then you sell it and then you don&#8217;t get the rent anymore. And that&#8217;s the way you get your cash back out.<\/p>\n<p>Now, an e-commerce business or an inventory-based business isn&#8217;t as rigid as that, because obviously, you can take your money out by selling through the inventory and turning all inventory back into cash. And if it&#8217;s profitably done, then it will come back with friends. In other words, profit.<\/p>\n<p>But that means you&#8217;ve got no inventory left to sell.<\/p>\n<p>So it&#8217;s a bit like having an apartment complex that you own, like 24 apartments, you can sell one of the apartments and then you get your money back out of it, but then you can&#8217;t rent it out anymore. So you don&#8217;t get that income stream. So if you have 24 product lines, You have, if you think of it, it&#8217;s 24 mini apartments. So you&#8217;re tying up the money and really there&#8217;s a big hint there, which is to say, you will find that the money is tied up.<\/p>\n<h2>Growth sucks cash<\/h2>\n<p>And the quicker you want to scale it, the more you tie your money up.<\/p>\n<p>They say growth sucks cash. So that&#8217;s true in all business models.  If I want to grow my consulting practice and I&#8217;m doing say 10 hours a week, if I want to double it to more money. I&#8217;d probably go and advertise and spend some more money on that. It will take some cash, But it won&#8217;t take all of the cash.<\/p>\n<h3>Nike before IPO &#8211; the classic example of a physical product brand &#8220;growing broke&#8221;<\/h3>\n<p>Whereas if you go and you double your e-commerce business or your physical product retail business every year, like Nike, if you go and read <em>Shoe Dog<\/em> by Phil Knight. That really tracks that.<\/p>\n<p>So he had 12 years, I think of growing his own business. Brand having, then we sold other people&#8217;s products earlier. And every year he was practically, personally broke and he was always going to the bank and begging for more money.<\/p>\n<p>Why?<\/p>\n<p>Because although there was a lot of revenue and thus, also profit, because they were selling profitably, they had to re. Invest those profits in more inventory in order to meet next year&#8217;s demand and so on and so forth.<\/p>\n<h3>It takes cash to scale an inventory-based business<\/h3>\n<p>So if you want to scale the same product lines, you need more cash tied up in those to do that.<\/p>\n<p>If you want to grow the business by new product lines, same thing. They also take cash.<\/p>\n<p>Plus product development costs. There are one-off costs every time you launch a new product line, and then once you&#8217;ve got the product line launched, you&#8217;ve got a little bit of tweaking and, and keeping it on top of it.<\/p>\n<p>But most of the money is tied up in that actual inventory.<\/p>\n<h2>So where&#8217;s the good news?<\/h2>\n<p>So this all sounds like bad news and kind of is a problem while you&#8217;re operating the businesses. But the good news is just like property or real estate. That is the analogy you expect to make money in real estate. Probably not mostly from the rents, although that&#8217;s nice to have, but the big money is made on capital appreciation, not on cash flow.<\/p>\n<h1>Residential vs commercial real estate<\/h1>\n<p>Now it&#8217;s interesting to compare commercial and residential property as a sort of model that&#8217;s more familiar to most of us to an e-commerce business to see an e-commerce business in its true light.<\/p>\n<h3>Residential property value appreciation is speculative<\/h3>\n<p>The value of residential property is somewhat speculatively. Really it depends on the regional valuation. So if you happen to live in London and London has prices go shooting up from the value when you bought it, then you make a lot of money, but that is really not dependent so much on your operating excellence, just the market as a whole.<\/p>\n<h3>Commercial real estate is valued based on future cashflows<\/h3>\n<p>Now commercial real estate is a little bit different. It&#8217;s valued as a multiple of the rent, the income. So you expect to make the most money not on the cashflow each year but on the capital appreciation over time.<\/p>\n<p>And that is something you can change. You can buy a dilapidated building and refurbish it. You can put new tenants in, you can get new, higher-paying tenants. You can get the same tenants and charge them more rent. And so on.<\/p>\n<p>I think that is really the nature of the beast with e-commerce businesses. So if you&#8217;re relatively new, To the e-commerce markets, but you have a good business mindset and experience. Then I think that&#8217;s a way to look at it.<\/p>\n<h2>Should you buy an e-commerce business?<\/h2>\n<p>So it doesn&#8217;t mean you shouldn&#8217;t buy an e-commerce business. The conversation I was having with a client just the other day. I said, yeah, for sure. There are many things you can tweak about the model we haven&#8217;t even touched on. How to improve the working capital and capital of characteristics of a business, which can be done in a huge measure.<\/p>\n<p>But nevertheless, the nature of the beast is what it is.<\/p>\n<p>And I think the key thing is to. Make sure that it&#8217;s a vehicle that makes sense for you.<\/p>\n<p>If you need cash now. It could be that you need to go and exchange time for money- freelancing, setting up a service-type business, or just getting a good old job. There&#8217;s nothing wrong with that. Those are vehicles that suit a certain purpose.<\/p>\n<p>If you want to create a sellable business, e-commerce is an excellent avenue. If you create your own product brand rather than reselling other people&#8217;s.<\/p>\n<h3>Why are you buying?<\/h3>\n<p>But it literally has its cost and you need to be clear-minded about what it is you&#8217;re getting into.<\/p>\n<p>Are you in it for capital appreciation in the future and a big payday, or are you in it for cash flow now? And you need to be clear about what this model will do for you and what it won&#8217;t do for you.<\/p>\n<h2>Your Amazon (target) business Audit<\/h2>\n<p>If you are considering acquiring an e-commerce business and you are not so familiar with the e-commerce markets, you could get some help from me as I&#8217;ve done for a couple of my clients recently. It&#8217;s quite a growing part of my consulting business,<\/p>\n<h3>2 Perspectives on the business<\/h3>\n<p>which is that I can have a look at an e-commerce business from you from really two perspectives. And see if it would make sense for you to buy the thing before you get to the point of even putting in a, an LOI or letter of intent, or, a Heads of Terms, depending on which side of The Pond you&#8217;re on.<\/p>\n<p>And  that would be the commercial due diligence and some basic financial areas.<\/p>\n<p>Now that the legal side, I don&#8217;t cover myself and I&#8217;m not an accountant nor do I play one on the internet, but the basic financials of it nevertheless, still tell you a bit of a tale, as I hope today illustrates.<\/p>\n<h3>Market Evaluation<\/h3>\n<p>And then what I can also do is look at the market you&#8217;re considering going into look at the demand, look at the competition and evaluate really, is this a growing market? Is this competition manageable? Does the business have a solid grasp on the market, even a dominance of the market that would make it a more attractive proposition?<\/p>\n<p>So if you want some help with that, just go to myamazonaudit.com and I will be happy to give you half an hour of my time for free to look at that.<\/p>\n<h3>How to book an audit<\/h3>\n<p>And if you send me some documents, I&#8217;ll even put in a bit of time having a quick look at the financials. And a quick look at the market on Amazon as well, to give you a good early steer of whether you should consider buying the business or not.<\/p>\n<p>Obviously, if you own a business of your own already on Amazon, I can give you similar feedback as well.<\/p>\n<p>It may be with a view to selling it potentially. I tend to act on behalf of people buying, more often than those selling, but the same insights apply in best cases.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FWhy_an_Ecommerce_business_isn_t_really_a_cash_cow_v_2_0.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fwhy-an-ecommerce-business-isnt-really-a-cash-cow%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Why_an_Ecommerce_business_isn_t_really_a_cash_cow_v_2_0.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14681-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Why_an_Ecommerce_business_isn_t_really_a_cash_cow_v_2_0.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Why_an_Ecommerce_business_isn_t_really_a_cash_cow_v_2_0.mp3\">Download<\/a> (Duration: 10:34 &#8212; 9.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 10:34 &#8212; 9.7MB)Subscribe: Spotify | Email | RSSHey folks. I want to discuss what is kind of a hard topic, which is why an e-commerce business isn&#8217;t a cash cow. It&#8217;s not what is advertised to be on the internet, but the good news is it could [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":14683,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1910],"tags":[1853],"class_list":["post-14681","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-buying-a-business","tag-amazing-fba-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Why an Ecommerce business isn&#039;t really a cash cow - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Why an Ecommerce business isn&#039;t really a cash cow - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 10:34 &#8212; 9.7MB)Subscribe: Spotify | Email | RSSHey folks. I want to discuss what is kind of a hard topic, which is why an e-commerce business isn&#8217;t a cash cow. It&#8217;s not what is advertised to be on the internet, but the good news is it could [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2024-04-02T06:00:35+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-04-11T11:21:23+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/amazingfba.com\/wp-content\/uploads\/2024\/04\/cow-7347854_640.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"640\" \/>\n\t<meta property=\"og:image:height\" content=\"427\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Why an Ecommerce business isn&#8217;t really a cash cow\",\"datePublished\":\"2024-04-02T06:00:35+00:00\",\"dateModified\":\"2024-04-11T11:21:23+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/\"},\"wordCount\":2339,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/cow-7347854_640.jpg?fit=640%2C427&ssl=1\",\"keywords\":[\"Amazing FBA Podcast\"],\"articleSection\":[\"Buying a Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/\",\"url\":\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/\",\"name\":\"Why an Ecommerce business isn't really a cash cow - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/cow-7347854_640.jpg?fit=640%2C427&ssl=1\",\"datePublished\":\"2024-04-02T06:00:35+00:00\",\"dateModified\":\"2024-04-11T11:21:23+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/cow-7347854_640.jpg?fit=640%2C427&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/cow-7347854_640.jpg?fit=640%2C427&ssl=1\",\"width\":640,\"height\":427,\"caption\":\"Cash cow (calf suckling on Cow's udder)\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Why an Ecommerce business isn&#8217;t really a cash cow\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Why an Ecommerce business isn't really a cash cow - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/","og_locale":"en_GB","og_type":"article","og_title":"Why an Ecommerce business isn't really a cash cow - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 10:34 &#8212; 9.7MB)Subscribe: Spotify | Email | RSSHey folks. I want to discuss what is kind of a hard topic, which is why an e-commerce business isn&#8217;t a cash cow. It&#8217;s not what is advertised to be on the internet, but the good news is it could [&hellip;]","og_url":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2024-04-02T06:00:35+00:00","article_modified_time":"2024-04-11T11:21:23+00:00","og_image":[{"width":640,"height":427,"url":"https:\/\/amazingfba.com\/wp-content\/uploads\/2024\/04\/cow-7347854_640.jpg","type":"image\/jpeg"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Why an Ecommerce business isn&#8217;t really a cash cow","datePublished":"2024-04-02T06:00:35+00:00","dateModified":"2024-04-11T11:21:23+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/"},"wordCount":2339,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/cow-7347854_640.jpg?fit=640%2C427&ssl=1","keywords":["Amazing FBA Podcast"],"articleSection":["Buying a Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/","url":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/","name":"Why an Ecommerce business isn't really a cash cow - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/cow-7347854_640.jpg?fit=640%2C427&ssl=1","datePublished":"2024-04-02T06:00:35+00:00","dateModified":"2024-04-11T11:21:23+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/cow-7347854_640.jpg?fit=640%2C427&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/cow-7347854_640.jpg?fit=640%2C427&ssl=1","width":640,"height":427,"caption":"Cash cow (calf suckling on Cow's udder)"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/why-an-ecommerce-business-isnt-really-a-cash-cow\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Why an Ecommerce business isn&#8217;t really a cash cow"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/cow-7347854_640.jpg?fit=640%2C427&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-3ON","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14681","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=14681"}],"version-history":[{"count":1,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14681\/revisions"}],"predecessor-version":[{"id":14682,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14681\/revisions\/14682"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/14683"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=14681"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=14681"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=14681"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}