{"id":14716,"date":"2024-04-29T12:41:48","date_gmt":"2024-04-29T11:41:48","guid":{"rendered":"https:\/\/amazingfba.com\/?p=14716"},"modified":"2024-04-29T12:41:52","modified_gmt":"2024-04-29T11:41:52","slug":"why-tesla-might-go-bust-lessons-for-amazon-sellers","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/","title":{"rendered":"Why Tesla might go bust &#8211; Lessons for Amazon Sellers"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FIs_Tesla_going_bankrupt_More_importantly-is_your_ecommerce_business_.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fwhy-tesla-might-go-bust-lessons-for-amazon-sellers%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Is_Tesla_going_bankrupt_More_importantly-is_your_ecommerce_business_.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14716-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Is_Tesla_going_bankrupt_More_importantly-is_your_ecommerce_business_.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Is_Tesla_going_bankrupt_More_importantly-is_your_ecommerce_business_.mp3\">Download<\/a> (Duration: 13:05 &#8212; 12.0MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p>\n<p>Is Tesla going bankrupt? More importantly &#8211; is your ecommerce business? <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Tesla isn&#8217;t the Point<\/h2>\n\n\n\n<p>Sorry for the enigmatic start. I&#8217;ve just got to get your attention somehow. I&#8217;m trying to educate you, but I sneakily got to make it entertaining, I guess. So I was just going through my LinkedIn feed earlier and up pops an analyst talking about Tesla. And what struck me wasn&#8217;t the fact that he thought Tesla could go bankrupt, that it is &#8220;the most overvalued stock in history&#8221; and that its business model is broken.<\/p>\n\n\n\n<p>Although if you invest in Tesla, those are important things, that&#8217;s not the point of today&#8217;s post. <\/p>\n\n\n\n<p>By the way, just to disclose, I am an investor in Tesla currently, but I may not be soon. I may choose to divest. Now I am not giving you any stock investing advice. God only knows that is not something I&#8217;m qualified in or experienced enough to give any advice to anyone about.<\/p>\n\n\n\n<p>So that&#8217;s not what I&#8217;m doing. Do your own homework on Tesla. But the point is this I haven&#8217;t done enough homework. I didn&#8217;t do enough homework in the first place when I bought it. I just thought it would be a fun ride and it&#8217;s educational and it has been both of those things. Sounds a bit playful, but it was only 1, 000 invested.<\/p>\n\n\n\n<p>So I figure I&#8217;m not going to lose my life savings or bet my pension on it.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">The business model evaluation matters most<\/h2>\n\n\n\n<p>But the education component is vital because I think what interests me is not whether this guy is right or wrong, but the way he argued, And talked about the stock and how he thought it was overvalued was for me, the right way of thinking.<\/p>\n\n\n\n<p>Now the results are not always going to be the same as reality. The result of your thinking and calculations all the time. But over time, if you have an accurate mental model, mental models of the world, I think your results should track reality. And over time that will guide you. Well, so what this guy was talking about<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Per Lakander&#8217;s analysis<\/h2>\n\n\n\n<p>per Lakander of Clean Energy Transition to give him credit. Sounded Scandinavian. And basically, if I summarize what I understood from it, he&#8217;s saying that. Whilst Tesla has claimed issues, okay, that the headline is, I guess Tesla is about to report some really bad quarterly earnings publicly listed companies report and its quarterly and indeed all the other financial statements.<\/p>\n\n\n\n<p>Of course, smaller businesses tend to think only in terms of annual reports, although they&#8217;re mainly broken down monthly. So here&#8217;s the thing, he said the<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">The balance sheet and income statement reveal a lot<\/h2>\n\n\n\n<p>First of all, there has been a claim that, maybe by Elon Musk, maybe by other people who are more fans of Tesla, that they had some arson, and therefore there was a production problem. But he said, well, but if you look at the inventory, it&#8217;s excess inventory. They have a huge pile of unsold cars somewhere, in other words, car parts, or work in progress towards cars. Which he says implies that there&#8217;s excess inventory, that&#8217;s a demand-side problem, not a supply-side problem. Hard to argue with that.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Competition Analysis is critical<\/h2>\n\n\n\n<p>And the other thing he&#8217;s saying is that the competition such as Volkswagen is coming up with 30 new electric vehicles or mostly electric vehicle models this year.<\/p>\n\n\n\n<p>Tesla has two models and it&#8217;s going to create a new one allegedly by the end of 2025. And he says, well, realistically probably the end of 2026. And then he talks about the business model, which interested me the most because that&#8217;s. I think highly relevant, bizarrely, for any inventory-based business, including small FBA businesses, even though it sounds so different to Tesla, doesn&#8217;t it, on the surface of it?<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Understanding the Business model<\/h2>\n\n\n\n<p>But he said, okay, the working model was predicated on great growth, very high fixed costs, and thus creating a negative, working capital. What that means is you get paid to sell stuff. And I don&#8217;t know all the details of Tesla. I probably should as an investor, shouldn&#8217;t I? But I didn&#8217;t do my homework.<\/p>\n\n\n\n<p>It&#8217;s one of the things I&#8217;m learning to do over time.<\/p>\n\n\n\n<p>And you said the thing is that works amazingly when you have 50 per cent year-on-year growth, which they&#8217;ve had for the last decade. But. He said, if that goes into reverse as it is starting to now, what happens is that Tesla first of all, it&#8217;s a very high fixed cost, which it has to spread over fewer units.<\/p>\n\n\n\n<p>So that is a real problem.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Positive Working Capital is a Bad thing!<\/h2>\n\n\n\n<p>And it has gone from negative working capital to positive. In other words, it sounds like a good thing, but it&#8217;s not positive and negative in maths and finance doesn&#8217;t necessarily mean good or bad. But in this case, it&#8217;s bad. Positive working capital means you have to put money in upfront in order to sustain production.<\/p>\n\n\n\n<p>Now, if you&#8217;re not a finance-oriented person, those sound like so what statements, don&#8217;t they? But if you&#8217;re a bit more financially savvy, and you don&#8217;t need to be a rocket scientist to get this stuff, in my experience Then, first of all, Positive working capital. You have to get more and more money in upfront.<\/p>\n\n\n\n<p>That means the more you sell, the more capital you need to tie up, which means of course that your stock price needs to be high. If you are getting money from investors in the public markets as Tesla does, or that you have to go and ask for loans. And in the case of publicly traded companies, those are called bonds and if small privately traded businesses, those are just straight-up loans really of different kinds.<\/p>\n\n\n\n<p>I guess you could get a bond. I don&#8217;t know the ins and outs of that. And of course, if your stock price is falling, it&#8217;s harder to raise money from investors. And the whole thing starts to unwind quite quickly.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Lessons from Tesla&#8217;s Chaallenges<\/h2>\n\n\n\n<p>So I think there is so, so many lessons from this. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Don&#8217;t just listen to pundits; Look at the financials<\/h3>\n\n\n\n<p>first and foremost, want to get this across. It was always a passion of mine these days to educate people like this. If you hear a pronouncement, you can oftentimes check the truth of that pronouncement or opinion about a company or indeed an industry, but particularly about a company, you just go and look at its financials.<\/p>\n\n\n\n<p>Now, the publicly listed companies, you can go and look at Tesla&#8217;s listed financials on Yahoo Finance or whatever your favourite website is for free. And they are obliged by the SEC. That is the regulatory authorities in the USA to have really stringently controlled and publicly available accounts. So it&#8217;s true for Amazon for that matter.<\/p>\n\n\n\n<p>If somebody starts pronouncing stuff about Amazon or TikTok, or anything else.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Focus on a thorough process not trying to be right each time<\/h3>\n\n\n\n<p>Anyway, so coming back to Tesla again, my point is not that I think I know where Tesla stocks going. Not that I necessarily think this guy is going to be right, but I think he&#8217;s more likely to be right than wrong.<\/p>\n\n\n\n<p>If he&#8217;s basing his statements on sound analysis of the financials and of the markets. that Tesla is in. And this stuff often isn&#8217;t rocket science.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Explosive market growth means market share is harder to keep<\/h3>\n\n\n\n<p>So for example it&#8217;s more of a speculative thing to speculate what market share Tesla is going to retain of the electric vehicle market. So on the one hand, the market&#8217;s going to explode, well is exploding in growth year on year.<\/p>\n\n\n\n<p>It may slow down but it&#8217;s going to be a big growth story, just like e-commerce has been over the last couple of decades and probably will continue to some degree to be over the next decade or so. Also, but market share, how much of that wonderful growth you get is a critical, critical metric. And if the market&#8217;s growing, but you&#8217;re losing market share, then actually can be worse than it sounds because of the market&#8217;s growing.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Gaining market share in a fast growth market is very expensive<\/h3>\n\n\n\n<p>Each bit of market share, it&#8217;s going to cost you more money, particularly if you&#8217;ve got negative working capital. So what I mean is to sell, say 30 per cent of the electric vehicles in the world, When that is a hundred million a dollar a year market, you need to make thirty million dollars a year in revenue.<\/p>\n\n\n\n<p>And if you&#8217;ve got to invest money upfront for that, I don&#8217;t know what you&#8217;re gonna have to invest to drive that. But maybe it&#8217;s a few million dollars. Maybe it&#8217;s ten, twenty million. I don&#8217;t know what the numbers are, but it&#8217;s a certain number. But if your market goes to a billion, ten billion, and your market share slips to 20 per cent of that market.<\/p>\n\n\n\n<p>Then if you want to recap that market share, we grab that market share. Now you&#8217;ve got to get very, very, very big amounts of money indeed in play and very, very big revenue growth in absolute terms. I hope what I&#8217;ve said makes some kind of sense.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Amazon businesses work in similar markets<\/h2>\n\n\n\n<p>The reason I mentioned this is because that is very, very analogous to an extraordinary number of Amazon-based businesses that I&#8217;ve worked with over the years and seen and considered investing in and turned down. After all, Market share is so underappreciated.<\/p>\n\n\n\n<p>Looking at the financials is also massively underappreciated. Now if you&#8217;re advanced, look at the profit and loss statement for the last three years rather than just the trading 12 months. But guess what? I don&#8217;t think that was deep enough personally.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Profit and loss analysis is NOT enough for inventory-based businesses<\/h2>\n\n\n\n<p>I always insist on seeing the balance sheets of any business that I&#8217;m serious about considering for acquisition or helping clients to analyze.<\/p>\n\n\n\n<p>And that&#8217;s because an awful lot of the difficulty of an inventory-based business does not reside on, does not show up on the profit and loss. When you exchange cash for inventory, That doesn&#8217;t really show up on the profit and loss. That&#8217;s a cash flow or balance sheet question. In other words, you&#8217;ve changed one form of current asset cash for another inventory.<\/p>\n\n\n\n<p>Turns out that you can&#8217;t pay your bills with inventory. Even your suppliers who sold you some plastic widgets in the first place will not want them back to pay their bills. They want money. And so It can be, if you&#8217;re not careful, a one-way street. You turn cash into stock, and then the stock sits there because you&#8217;ve over-egged, like maybe Tesla has.<\/p>\n\n\n\n<p>And then, you&#8217;re in real trouble. Because, if you run out of cash, it&#8217;s game over in business. So, lots and lots of lessons that strike me. From this Tesla analysis very interesting to see what happens next. I guess I better go home and do my sums and do the financial analysis that I should have done when I invested in it and decide whether to stay invested or divest.<\/p>\n\n\n\n<p>But that&#8217;s not really the point here. Again, I am not a stock market analyst. I&#8217;m not telling you what to do with your publicly traded stocks.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Should you buy Amazon-based ecommerce businesses?<\/h2>\n\n\n\n<p>But the reason I suppose I&#8217;m thinking in these terms is because I&#8217;ve been working on analyzing not one, but two Amazon FBA businesses for on behalf of clients.<\/p>\n\n\n\n<p>One was an analysis of the financials which was completed yesterday. And today I&#8217;m finishing an analysis of the market and, that includes the stuff that&#8217;s more familiar to Amazon sellers, which is why I&#8217;m focusing on using my skills there to help this client decide whether or not they should go ahead with an acquisition.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Competition analysis<\/h2>\n\n\n\n<p>So demand and supply broadly speaking, how much competition is there? And then, of course, Is the product, is this product suite or as a hero product in this case, quite a small business differentiated from the competition. Those are critical questions, but I do think that, while analyzing a market is important, that is not a skill that is under-discussed in the Amazon seller space or the e-commerce space.<\/p>\n\n\n\n<p>But what I think is under-discussed and is nice, therefore an easy win, if you want to work that way, is the proper analysis of the financial documents. And making full sense of what is going on with the finances and how the business model works and how it can break as well. So That for me is the big lesson from today&#8217;s very interesting analysis.<\/p>\n\n\n\n<p>And I will post it into the podcast as ever over at the blog, 10kcollective. com. I will include that link there to the analysis by our Scandinavian friend. Thanks for listening. Hope that was thought-provoking. I&#8217;m off to go and work out whether I should sell my Tesla stock! Speak to you soon.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Acquisition Audit<\/h2>\n\n\n\n<p>If you are considering acquiring an e-commerce business and you are not so familiar with the e-commerce markets, you could get some help from me as I&#8217;ve done for a couple of my clients recently. It&#8217;s quite a growing part of my consulting business,<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">2 Perspectives on the business<\/h3>\n\n\n\n<p>which is that I can have a look at an e-commerce business from you from really two perspectives. And see if it would make sense for you to buy the thing before you get to the point of even putting in a, an LOI or letter of intent, or, a Heads of Terms, depending which side of The Pond you&#8217;re on.<\/p>\n\n\n\n<p>And really that would be the commercial due diligence and some basic financial areas.<\/p>\n\n\n\n<p>Now that the legal side, I don&#8217;t cover myself and I&#8217;m not an accountant nor do I play one on the internet, but the basic financials of it nevertheless, still tell you a bit of a tale, as I hope today illustrates.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Market Evaluation<\/h3>\n\n\n\n<p>And then what I can also do is look at the market you&#8217;re considering going into look at the demand, look at the competition and evaluate really, is this a growing market? Is this competition manageable? Does the business have a solid grasp on the market, even a dominance of the market that would make it a more attractive proposition?<\/p>\n\n\n\n<p>So if you want some help with that, just go to myamazonaudit.com and I will be happy to give you half an hour of my time for free to look at that.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><\/h3>\n\n\n\n<p>And if you send me some documents, I&#8217;ll even. put in bit of time having a quick look at the financials. And a quick look at the market on Amazon as well, to give you a good early steer of whether you should consider buying the business or not.<\/p>\n\n\n\n<p>If you own a business of your own already on Amazon, I can give you similar feedback as well. It may be to sell it potentially. I tend to act on behalf of people buying, rather than selling, but the same insights apply in best cases. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\">How to book an audit<\/h3>\n\n\n\n<p>Just go to <a href=\"http:\/\/www.myamazonaudit.com\">www.myamazonaudit.com<\/a> to book in a Zoom call. <\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FIs_Tesla_going_bankrupt_More_importantly-is_your_ecommerce_business_.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fwhy-tesla-might-go-bust-lessons-for-amazon-sellers%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Is_Tesla_going_bankrupt_More_importantly-is_your_ecommerce_business_.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14716-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Is_Tesla_going_bankrupt_More_importantly-is_your_ecommerce_business_.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Is_Tesla_going_bankrupt_More_importantly-is_your_ecommerce_business_.mp3\">Download<\/a> (Duration: 13:05 &#8212; 12.0MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 13:05 &#8212; 12.0MB) Subscribe: Spotify | Email | RSS Is Tesla going bankrupt? More importantly &#8211; is your ecommerce business? Tesla isn&#8217;t the Point Sorry for the enigmatic start. I&#8217;ve just got to get your attention somehow. I&#8217;m trying to educate you, but I sneakily got to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":14760,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1853],"class_list":["post-14716","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-amazing-fba-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Why Tesla might go bust - Lessons for Amazon Sellers - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Why Tesla might go bust - Lessons for Amazon Sellers - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 13:05 &#8212; 12.0MB) Subscribe: Spotify | Email | RSS Is Tesla going bankrupt? More importantly &#8211; is your ecommerce business? Tesla isn&#8217;t the Point Sorry for the enigmatic start. I&#8217;ve just got to get your attention somehow. I&#8217;m trying to educate you, but I sneakily got to [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2024-04-29T11:41:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-04-29T11:41:52+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/amazingfba.com\/wp-content\/uploads\/2024\/04\/IMG_5633.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"1500\" \/>\n\t<meta property=\"og:image:height\" content=\"1000\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Why Tesla might go bust &#8211; Lessons for Amazon Sellers\",\"datePublished\":\"2024-04-29T11:41:48+00:00\",\"dateModified\":\"2024-04-29T11:41:52+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/\"},\"wordCount\":2674,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/IMG_5633.jpeg?fit=1500%2C1000&ssl=1\",\"keywords\":[\"Amazing FBA Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/\",\"url\":\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/\",\"name\":\"Why Tesla might go bust - Lessons for Amazon Sellers - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/IMG_5633.jpeg?fit=1500%2C1000&ssl=1\",\"datePublished\":\"2024-04-29T11:41:48+00:00\",\"dateModified\":\"2024-04-29T11:41:52+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/IMG_5633.jpeg?fit=1500%2C1000&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/IMG_5633.jpeg?fit=1500%2C1000&ssl=1\",\"width\":1500,\"height\":1000},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Why Tesla might go bust &#8211; Lessons for Amazon Sellers\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Why Tesla might go bust - Lessons for Amazon Sellers - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/","og_locale":"en_GB","og_type":"article","og_title":"Why Tesla might go bust - Lessons for Amazon Sellers - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 13:05 &#8212; 12.0MB) Subscribe: Spotify | Email | RSS Is Tesla going bankrupt? More importantly &#8211; is your ecommerce business? Tesla isn&#8217;t the Point Sorry for the enigmatic start. I&#8217;ve just got to get your attention somehow. I&#8217;m trying to educate you, but I sneakily got to [&hellip;]","og_url":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2024-04-29T11:41:48+00:00","article_modified_time":"2024-04-29T11:41:52+00:00","og_image":[{"width":1500,"height":1000,"url":"https:\/\/amazingfba.com\/wp-content\/uploads\/2024\/04\/IMG_5633.jpeg","type":"image\/jpeg"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Why Tesla might go bust &#8211; Lessons for Amazon Sellers","datePublished":"2024-04-29T11:41:48+00:00","dateModified":"2024-04-29T11:41:52+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/"},"wordCount":2674,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/IMG_5633.jpeg?fit=1500%2C1000&ssl=1","keywords":["Amazing FBA Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/","url":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/","name":"Why Tesla might go bust - Lessons for Amazon Sellers - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/IMG_5633.jpeg?fit=1500%2C1000&ssl=1","datePublished":"2024-04-29T11:41:48+00:00","dateModified":"2024-04-29T11:41:52+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/IMG_5633.jpeg?fit=1500%2C1000&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/IMG_5633.jpeg?fit=1500%2C1000&ssl=1","width":1500,"height":1000},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/why-tesla-might-go-bust-lessons-for-amazon-sellers\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Why Tesla might go bust &#8211; Lessons for Amazon Sellers"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/04\/IMG_5633.jpeg?fit=1500%2C1000&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-3Pm","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14716","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=14716"}],"version-history":[{"count":2,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14716\/revisions"}],"predecessor-version":[{"id":14741,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14716\/revisions\/14741"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/14760"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=14716"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=14716"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=14716"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}