{"id":14814,"date":"2024-05-28T07:00:00","date_gmt":"2024-05-28T06:00:00","guid":{"rendered":"https:\/\/amazingfba.com\/?p=14814"},"modified":"2024-05-27T23:13:31","modified_gmt":"2024-05-27T22:13:31","slug":"online-marketing-gurus-who-should-you-believe","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/","title":{"rendered":"Online marketing gurus &#8211; who should you believe?"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FOnline_marketing_gurus-who_should_you_believe_.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fonline-marketing-gurus-who-should-you-believe%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Online_marketing_gurus-who_should_you_believe_.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14814-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Online_marketing_gurus-who_should_you_believe_.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Online_marketing_gurus-who_should_you_believe_.mp3\">Download<\/a> (Duration: 12:19 &#8212; 11.3MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p>\n<p>Online marketing gurus &#8211; who should you believe? Hey folks, time for some real talk today. I want to talk about internet marketing gurus. What does that mean? And should you believe what you hear on the internet or from a course or from any internet marketing or business coach? Stay tuned.<\/p>\n\n\n\n<p>Hey folks, Michael Veazey from Amazing FBA here.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Are online marketing gurus the same as business consultants?<\/h2>\n\n\n\n<p>Guess what? I&#8217;m Michael from Amazing FBA. That means I&#8217;m here to give you advice or thoughts or information about internet marketing, particularly selling on Amazon. And that is an interesting one because it brings up this concept of a guru. I get accused of being a guru occasionally by people and I feel if it&#8217;s an accusation rather than something helpful.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">A guru passes on &#8220;Divine wisdom&#8221;<\/h3>\n\n\n\n<p>My understanding of the word guru is it comes from the Hindu tradition and like other religious traditions there&#8217;s a tradition of received wisdom that a person who becomes holy enough through meditation, prayer and other such things gets received wisdom directly from God or the spirit world or whatever.<\/p>\n\n\n\n<p>I&#8217;m not qualified to say whether that happens in religion, for all I know it does, but that is not what I&#8217;m saying I&#8217;m offering. I&#8217;m not that person. And anyone who does say they are that person, I think is going to be treated with some skepticism. But that is a mentality in itself that worries me. And let me explain.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Who you follow as an online marketing guru is only one part of the equation<\/h2>\n\n\n\n<p>The online marketing guru who you choose to follow as an authority of some kind, let&#8217;s use that word as a more grown-up word, is an important choice.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">It&#8217;s your responsibility to decide if the online marketing guru is worth following<\/h3>\n\n\n\n<p>The first thing I would say is: it&#8217;s your responsibility if you&#8217;re going to follow somebody to do a bit of homework and feel whether they sound like they know what they&#8217;re talking about and have they given consistently decent advice.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Michael&#8217;s background in online marketing and Amazon advising<\/h3>\n\n\n\n<p>And there are ways to do that just to lay my cards on the table. I&#8217;ve been selling on Amazon since 2014. I&#8217;ve been coaching people one to one since 2016. Since 2015, I&#8217;ve been running a podcast. I&#8217;ve interviewed well north of 200 experts. And we&#8217;ve done probably close to a thousand episodes now, most of which have been expert interviews. We&#8217;ve had over a million Downloads. So there&#8217;s some social proof there. <\/p>\n\n\n\n<p>Since 2016, I&#8217;ve coached over a hundred people who enter one of whom handful have gone on to create over a million dollars worth of sales between them.<\/p>\n\n\n\n<p>And then the mastermind since 2017 without people get to seven figure exit and what else triple their business and the COVID admittedly in three or four cases. And then one person got to eight figures in revenue.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">The online marketing gurus you follow are your decision<\/h3>\n\n\n\n<p>Now that&#8217;s about me. Is that enough for you? It&#8217;s up to you to decide. All I can tell you is who I am, and then you decide if it&#8217;s right for you.<\/p>\n\n\n\n<p>And I want to talk about not the gurus today, but you as the consumer of coaching or consulting, or me as a consumer of coaching and consulting, because I also follow other people.<\/p>\n\n\n\n<p>If you are watching the video, I&#8217;m going to give you a little visual here, because I think it can really help.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">The spectrum of belief (4 boxes)<\/h2>\n\n\n\n<p>&nbsp;I want you to visualize, if you&#8217;re not seeing the video four squares across from left to right, because that&#8217;s how we&#8217;re thinking of it and looking at it.<\/p>\n\n\n\n<p>So on the right-hand side, we&#8217;ve got a very happy-looking person with a halo above them as befits the guru idea. And on the left-hand side, we&#8217;ve got a person with a red face and they got devil&#8217;s horns just to go the opposite extreme. Let&#8217;s talk about this because this is a crucial mindset that I think you need to think about.<\/p>\n\n\n\n<p>And I think about when we&#8217;re absorbing information or following somebody as some form of authority, whether in a specialist field or generally business guru if you wish to use that word, which I hate.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">The credulous person believes every online marketing guru they hear (don&#8217;t be this person!)<\/h3>\n\n\n\n<p>Okay. On the right-hand side, we&#8217;ve got the person who believes everything that they hear.<\/p>\n\n\n\n<p>And that is what I would call a credulous person. So a credulous person will believe everything that they hear; maybe they want to get a bit of proof that the person they&#8217;re talking to or listening to has some ability, and then they believe everything that they hear.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Even honest online marketing gurus can say things that aren&#8217;t true for you<\/h3>\n\n\n\n<p>Now, that doesn&#8217;t work very well normally because even people who are sincere and have made a lot of money will tell you what they did. That doesn&#8217;t necessarily mean it&#8217;s working anymore because if they did it five, 10 years ago and made serious money, they probably started a few years ago.<\/p>\n\n\n\n<p>What worked for them then doesn&#8217;t necessarily mean it will work now or for you. That&#8217;s not necessarily because they&#8217;re liars. They might be perfectly honest, they might not be perfectly honest, but that, either way, doesn&#8217;t work.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Cynicism is when you believe nobody (don&#8217;t be this person either!)<\/h3>\n\n\n\n<p>What often happens then is we move to the other extreme on the left-hand side, which is when you think all internet marketers or internet gurus, or for that matter, accountants or consultants, whatever you&#8217;ve been burned by, They&#8217;re all liars. They&#8217;re all rubbish. You can&#8217;t believe anything you hear.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Neither believing everything nor believing nothing from online marketing gurus will help you<\/h2>\n\n\n\n<p>So if you notice, we&#8217;ve gone from one extreme, believing everything you hear or see or read or experience to believing nothing. And I&#8217;m here to say that as we all know, and I&#8217;ve been there, been there multiple times. I&#8217;m sure you haven&#8217;t been around for a while, at least once, if you&#8217;re honest. Probably more than once.<\/p>\n\n\n\n<p>Neither is productive. They are both dysfunctional responses to the world. I&#8217;m not accusing you or for that matter of being a dysfunctional person as a whole, but those particular mental brain works, believing everything, believing nothing are actually not functional. They&#8217;re not going to help move you forward in the world, right?<\/p>\n\n\n\n<p>And so I would suggest the middle two. Mindset are with regards to authorities, if you like are where we want to live.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Be sceptical of online marketing gurus<\/h2>\n\n\n\n<p>The one across from cynical is, I believe, where I mostly live, and that is sceptical. That is to say, I don&#8217;t say that you&#8217;re wrong, but I&#8217;m not going to go and believe that you&#8217;re right unless I see some proof.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">&#8220;Show me the money&#8221;<\/h3>\n\n\n\n<p>So showing me the money, as it said in Jerry Maguire. if you remember Jerry Maguire as a sports agent and his one star who was left on the field, you hadn&#8217;t abandoned him, wanted the proof, never mind all the talk. I want to show you the money.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Cash in your pocket is the best proof of all<\/h3>\n\n\n\n<p>And I think in the end, any good business advice should result in money as in cash in your personal pocket.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Financial metrics beat marketing metrics<\/h3>\n\n\n\n<p>The second best of that is profits. The third best by a long way is revenue. And then those are all financial metrics. So those numbers I think should be the ones that really. Get you excited as to the potential of an idea. You&#8217;ve still got to have proof, but at least you should be excited about it. We&#8217;ll talk about more excitable people in a second.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Marketing numbers are second best proof<\/h3>\n\n\n\n<p>But not as good, but some kind of evidence is marketing numbers. So clicks or cost per click, people visiting your listing on Amazon or your product detail pages on Shopify. Even strong, but not as good your storefront on Amazon or your your home page or collection pages on Shopify or any other DTC site.<\/p>\n\n\n\n<p>Less powerful impressions and and you got other various metrics as well. So I would say that showing me the money and cash in your pocket is the most powerful possible metric to have to prove that something is worth exploring further.<\/p>\n\n\n\n<h1 class=\"wp-block-heading\">Other people&#8217;s evidence isn&#8217;t enough.<\/h1>\n\n\n\n<p>But guess what? If you&#8217;re just relying on a statement plus evidence, that&#8217;s a good start, but I don&#8217;t think that&#8217;s enough. I think the true skeptic does not dismiss things but does not just believe them as truth either, until they have run what I would call an experiment.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Treat any online marketing guru statements as a hypothesis<\/h3>\n\n\n\n<p>Which is you start with a hypothesis, probably already got some evidence in its favour, so you want to have a quality hypothesis, then you design an experiment, that might, for example, consist of one product line in one territory, say Germany or the UK or America, for one period, one month, six months with a limited budget, 10, 000 worth of stock or a budget of 5, 000 to go into a certain form of advertising. If you think TikTok advertising, for example, is the latest thing and then you test it<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Experiments give you your <em>own<\/em> proof <\/h3>\n\n\n\n<p> And then, what&#8217;s wonderful is this: you don&#8217;t have to be a sceptic or a cynic or a credulous or anything because you now have proof, your own experience, your own numbers, and you no longer have to depend on an external authority figure at all.<\/p>\n\n\n\n<p>And that&#8217;s wonderful. I have been teaching one way or another for most of my career. I used to teach music. I still do sometimes just keep my hand in and, and marketing stuff more recently.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">A Good teacher makes themselves unnecessary<\/h3>\n\n\n\n<p>And I and all the good teachers I&#8217;ve ever worked with try to make ourselves redundant. That&#8217;s to say, I don&#8217;t want anyone to depend on me. I want them to become independent of me as quickly as possible because they get their own experience and their own proof and their own numbers and they don&#8217;t need me.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">No internet marketing guru knows the future<\/h2>\n\n\n\n<p>And so my job, I believe, is not to show somebody the revealed truth. I&#8217;m not a guru. I don&#8217;t know what the revealed truth is. I don&#8217;t have a hotline to God.<\/p>\n\n\n\n<p>I don&#8217;t even know what Andy Jassy is going to do next month. He may not know. I don&#8217;t know whether the United States will actually ban ByteDance, the Chinese company, from owning TikTok. I don&#8217;t know whether TikTok will shut down or still be the best place to sell your Amazon goods in a year, in two years.<\/p>\n\n\n\n<p>I don&#8217;t know that. I don&#8217;t think anyone else actually knows that. Some people have more of a hint than others.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">What an online guru can give you&#8230;their investigation and their judgement<\/h3>\n\n\n\n<p>But what I can do is give you my investigations and the evidence that I can see and my judgment on it and hand it to you.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Don&#8217;t just believe any marketing guru &#8211; go and investigate for yourself<\/h2>\n\n\n\n<p>And I don&#8217;t expect you to just believe me. I think that would be poor-quality thinking.<\/p>\n\n\n\n<p>I don&#8217;t encourage that. I would say go and whatever I say or anyone else says, and there are many more authoritative people than me in the Amazon space. Let&#8217;s face it. Go and see what the numbers say, what numbers they give you. That&#8217;s a good starting point. What does your own independent investigation tell you?<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">If the upside looks strong, run an experiment<\/h3>\n\n\n\n<p>And then if you think that&#8217;s strong enough and you think that the upside is enough, Then run an experiment and if you think about the upside quite a lot of people will be sceptical And I&#8217;ve no problem with that at all.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Lenders &amp; investors tend to be sceptical<\/h3>\n\n\n\n<p>That&#8217;s more or less where I tend to live and investors tend to be skeptical as do lenders. So if you want to go to a bank, they aren&#8217;t going to be just enough It&#8217;s not going to be enough to be optimistic because they will want to see some proof and again, they want to show me the money.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Optimism is a standard mindset for entrepreneurs<\/h2>\n\n\n\n<p>But there is a space for optimism in any form of entrepreneurship.<\/p>\n\n\n\n<p>And in the end, somebody who&#8217;s driving a business probably is more on the optimistic side. That&#8217;s great. I would just encourage you to still need evidence and still need proof before you plunge everything in.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Fire Bullets; then fire cannonballs<\/h3>\n\n\n\n<p>And I would say for you, the absolute rule of thumb is simple but powerful: fire bullets, then fire cannonballs. (as Jim Collins said in &#8220;Great by Choice&#8221;).  In other words, do small-scale tests before you then put large amounts of money, time, effort, or team behind a particular thing.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Optimists (who tend to believe gurus) need sceptics<\/h3>\n\n\n\n<p>So, if you are an optimist, the final thing to say is you probably need on your team. That is to say, somebody who&#8217;s more needing proof.<\/p>\n\n\n\n<p>So, if you are an optimist. talking to your accountant or a lawyer, they tend to be on the sceptical side and need proof and worry about things and quite rightly too because it will make your business stronger if there&#8217;s an optimist and a bit more of a sceptic in the middle.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Stay away from cynicism and credulity<\/h3>\n\n\n\n<p>But just stay away from cynicism, believing nothing and credulity, believing everything. Sceptics tend to fall into cynicism (I&#8217;m in that sort of set of people.). And optimists can fall into believing everything. So if that&#8217;s you, just guard against that and stay in those middle two categories.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">This will give you so much more chance of making sense of online marketing gurus<\/h3>\n\n\n\n<p>And I swear that that is going to give you so much more chance of success and dealing with inputs from authority figures and making sense of what they have to say. Be yourself.<\/p>\n\n\n\n<p>And if you get this right, this mental game, it&#8217;s so powerful that will move you forward in the end,<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Seek proof from online marketing gurus<\/h3>\n\n\n\n<p>Don&#8217;t dismiss stuff, but ask for proof and then experiment for yourself to get your own proof that you don&#8217;t depend on anyone else.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">I am not an online marketing guru!<\/h3>\n\n\n\n<p>All I, or any other quotes or authority, end quotes, can do, really, is give you a starting point for your own work.<\/p>\n\n\n\n<p>That&#8217;s the way I see my work. And I just absolutely denounce the title of guru for myself. I am not. I&#8217;m a teacher, which means I&#8217;m here to get you to think for yourself. And that&#8217;s it. If you find that useful, you can always come and investigate further about the services that I offer. Up to you entirely.<\/p>\n\n\n\n<p>You make your own judgment about that as well. Thanks so much for listening. Hope that was helpful. Speak soon.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">A Free Amazon Audit (if you believe I can help you!)<\/h3>\n\n\n\n<p>Do you want to grow your business bigger and faster? A free audit of your Amazon business can help you see and avoid threats and find missed golden opportunities. I generally charge 150 or more per hour, but this would be free. You can be a reseller or a brand owner. All I ask is that you&#8217;re doing a few thousand dollars a month in sales already.<\/p>\n\n\n\n<p>Just visit <a href=\"http:\/\/myamazonaudit.com\">myamazonaudit.com,<\/a> scroll down, click on Amazon Audit and book in a time. Look forward to speaking to you on your audit.<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FOnline_marketing_gurus-who_should_you_believe_.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fonline-marketing-gurus-who-should-you-believe%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Online_marketing_gurus-who_should_you_believe_.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=14814-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Online_marketing_gurus-who_should_you_believe_.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Online_marketing_gurus-who_should_you_believe_.mp3\">Download<\/a> (Duration: 12:19 &#8212; 11.3MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 12:19 &#8212; 11.3MB) Subscribe: Spotify | Email | RSS Online marketing gurus &#8211; who should you believe? Hey folks, time for some real talk today. I want to talk about internet marketing gurus. What does that mean? And should you believe what you hear on the internet [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":14818,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1857],"tags":[1550,1853],"class_list":["post-14814","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-general-business","tag-10k-collective-podcast","tag-amazing-fba-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Online marketing gurus - who should you believe? - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"description\" content=\"Online marketing gurus - who should you believe? If you&#039;re asking this, you may need to think about your own mindset around &quot;gurus&quot;.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Online marketing gurus - who should you believe? - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Online marketing gurus - who should you believe? If you&#039;re asking this, you may need to think about your own mindset around &quot;gurus&quot;.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2024-05-28T06:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-05-27T22:13:31+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/05\/pexels-dibakar-roy-2432543-55986161.jpg?fit=640%2C960&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"640\" \/>\n\t<meta property=\"og:image:height\" content=\"960\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"14 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Online marketing gurus &#8211; who should you believe?\",\"datePublished\":\"2024-05-28T06:00:00+00:00\",\"dateModified\":\"2024-05-27T22:13:31+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/\"},\"wordCount\":2765,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/05\/pexels-dibakar-roy-2432543-55986161.jpg?fit=640%2C960&ssl=1\",\"keywords\":[\"10K Collective Podcast\",\"Amazing FBA Podcast\"],\"articleSection\":[\"General Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/\",\"url\":\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/\",\"name\":\"Online marketing gurus - who should you believe? - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/05\/pexels-dibakar-roy-2432543-55986161.jpg?fit=640%2C960&ssl=1\",\"datePublished\":\"2024-05-28T06:00:00+00:00\",\"dateModified\":\"2024-05-27T22:13:31+00:00\",\"description\":\"Online marketing gurus - who should you believe? If you're asking this, you may need to think about your own mindset around \\\"gurus\\\".\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/05\/pexels-dibakar-roy-2432543-55986161.jpg?fit=640%2C960&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/05\/pexels-dibakar-roy-2432543-55986161.jpg?fit=640%2C960&ssl=1\",\"width\":640,\"height\":960,\"caption\":\"Guru\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Online marketing gurus &#8211; who should you believe?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Online marketing gurus - who should you believe? - Amazing FBA - Grow your 7-Figure Amazon Business","description":"Online marketing gurus - who should you believe? If you're asking this, you may need to think about your own mindset around \"gurus\".","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/","og_locale":"en_GB","og_type":"article","og_title":"Online marketing gurus - who should you believe? - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Online marketing gurus - who should you believe? If you're asking this, you may need to think about your own mindset around \"gurus\".","og_url":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2024-05-28T06:00:00+00:00","article_modified_time":"2024-05-27T22:13:31+00:00","og_image":[{"width":640,"height":960,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/05\/pexels-dibakar-roy-2432543-55986161.jpg?fit=640%2C960&ssl=1","type":"image\/jpeg"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Online marketing gurus &#8211; who should you believe?","datePublished":"2024-05-28T06:00:00+00:00","dateModified":"2024-05-27T22:13:31+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/"},"wordCount":2765,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/05\/pexels-dibakar-roy-2432543-55986161.jpg?fit=640%2C960&ssl=1","keywords":["10K Collective Podcast","Amazing FBA Podcast"],"articleSection":["General Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/","url":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/","name":"Online marketing gurus - who should you believe? - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/05\/pexels-dibakar-roy-2432543-55986161.jpg?fit=640%2C960&ssl=1","datePublished":"2024-05-28T06:00:00+00:00","dateModified":"2024-05-27T22:13:31+00:00","description":"Online marketing gurus - who should you believe? If you're asking this, you may need to think about your own mindset around \"gurus\".","breadcrumb":{"@id":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/05\/pexels-dibakar-roy-2432543-55986161.jpg?fit=640%2C960&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/05\/pexels-dibakar-roy-2432543-55986161.jpg?fit=640%2C960&ssl=1","width":640,"height":960,"caption":"Guru"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/online-marketing-gurus-who-should-you-believe\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Online marketing gurus &#8211; who should you believe?"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2024\/05\/pexels-dibakar-roy-2432543-55986161.jpg?fit=640%2C960&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-3QW","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14814","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=14814"}],"version-history":[{"count":4,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14814\/revisions"}],"predecessor-version":[{"id":14819,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/14814\/revisions\/14819"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/14818"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=14814"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=14814"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=14814"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}