{"id":4715,"date":"2018-07-27T06:00:55","date_gmt":"2018-07-27T05:00:55","guid":{"rendered":"https:\/\/amazingfba.com\/?p=4715"},"modified":"2020-05-15T11:21:17","modified_gmt":"2020-05-15T10:21:17","slug":"272-amazon-advertising-strategy","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/","title":{"rendered":"272 Amazon Advertising Strategy for Advanced Sellers with Danny McMillan Part 2 of 2"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F272.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F272-amazon-advertising-strategy%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/272.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=4715-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/272.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"272.mp3\">Download<\/a> (Duration: 46:01 &#8212; 37.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><h2><strong>What is the difference in Amazon Advertising Strategy between a seller with 100+SKUs and a seller with 1-2 SKUs?<\/strong><\/h2>\n<p><!--more--><\/p>\n<p><a href=\"\/DannyM\">Danny<\/a> started Data Brill with Ellis, one of the guys behind the very successful Jungle Scout algorithm<\/p>\n<p>It’s very hard to manage Amazon advertising strategy with 100s SKUs (product lines).<\/p>\n<p>There is software out there for Amazon ads management, but it’s rules-based.  They are very inflexible &#8211; because it’s a one size fits all solution. Danny doesn’t work that way. He has in-depth conversations with the clients they work with.<\/p>\n<p>Another problem is that the more you expand, the higher the costs.<\/p>\n<p>Data Brill solves that issue by having a fixed-price service which does <em>not <\/em>go up with an increasing number of ad spend.<\/p>\n<h2><strong>So what kind of clients does DataBrill work for?<\/strong><\/h2>\n<p>They serve sellers with 100s of SKUS &#8211;<\/p>\n<p>1 client does $30m a year; another, $10million a month.<\/p>\n<p>Most clients have 200+SKUs &#8211; all in different categories: some are commodities; some are in home and kitchen; some are in competitive categories etc.  So one size definitely doesn’t fit all with their Amazon advertising strategy.<\/p>\n<h2><strong>Do you just purely work on Amazon advertising? <\/strong><\/h2>\n<p>No, because PPC has your amazon Advertising strategy needs to fit in with your strategy for your whole business.<\/p>\n<p>Danny sits down with the client and goes over everything and anything: storage fees and Long Term Storage Fees on Amazon; new product development; launches; packaging; inserts; etc. etc.<\/p>\n<h3><strong>Do you just have Amazon advertising cost data?<\/strong><\/h3>\n<p>Again, this is another key difference between Danny’s approach and most amazon ad management systems.<\/p>\n<p>If you just rely on the Ad API, all you can see is the Amazon ad data.<\/p>\n<p>Data Brill use the AMS system, so you get a lot more data including crucial metrics like the turn of stock and sales velocity.<\/p>\n<h2><strong>Liquidating underperforming stock using Amazon ads<\/strong><\/h2>\n<p>Danny had a client who wanted to get rid of a lot of stock in Amazon FBA. They calculated the cost of getting stock out from Amazon FBA warehouses, vs. building sales velocity and selling through stock.<\/p>\n<p>The main tactics for selling through are simple:  drop the price greatly, run PPC, then try to rank higher and gain sales velocity, so you  can sell through the stock on Amazon.<\/p>\n<h3><strong>How do you choose what stock to cut?<\/strong><\/h3>\n<p>It’s important to review all of your data across all your SKUs.<\/p>\n<p>You need to compare Return on Investment and profitability across your different product lines.<\/p>\n<p>You also need to consider <em>how long<\/em> it will take to sell through a product.<\/p>\n<p>Say you have 100 products &#8211; maybe the top 20 are best performers. The other 80% are tying up cashflow<\/p>\n<p>So if you consider your ROI over time, you may cut some of the underperforming products and reinvest that money in the more profitable\/higher ROI products.<\/p>\n<p>Ellis runs a seller’s whole account through their system and gets those metrics so that Danny can talk these things through with sellers.<\/p>\n<h3><strong>How do you deal with stock that basically isn’t going to sell profitably?<\/strong><\/h3>\n<p>There are 3 main alternatives: get it destroyed; remove it from FBA and sell in bulk; sell through using PPC and low price.<\/p>\n<h2><strong>Removal and liquidation via external sources<\/strong><\/h2>\n<p>Remember that if you use a removal order from Amazon FBA warehouses, It comes out in dribs and drabs.<\/p>\n<p>What does it look like to remove it from FBA to put in Craigslist as a bulk listing? Especially in the USA?<\/p>\n<h2><strong>Selling via PPC with low price<\/strong><\/h2>\n<p>Just drop the price really low, run Amazon ads at a high bid. Ideally, you’d aim to come out at breakeven but in reality, you may accept a loss that is smaller than it would be via other methods.<\/p>\n<p>If it does come out at breakeven, you may even consider going back into that stock as a viable product.<\/p>\n<p>There is no guarantee! You could spend $500 more and make no difference.<\/p>\n<h2><strong>Destruction of inventory<\/strong><\/h2>\n<p>Do find out how much it costs to get it destroyed! It may sound hard but you have to consider:  What are the opportunity costs of continuing with this SKU?  What are time costs?<\/p>\n<h3><strong>If you’re good at Facebook ads can that work?<\/strong><\/h3>\n<p>Not generally. You’re trying to sell to people with disruptive advertising &#8211; if see 90% discount, paying £1 etc. it’s a no brainer. However, if it’s £20, that’s not compelling enough.<\/p>\n<h3><strong>Could Google Adwords work?<\/strong><\/h3>\n<p>If the cost per click high, it’s probably harder to get this work at an affordable level.<\/p>\n<p>You can sometimes move things back up to working profitably. You can put things down in price and move things up gradually<\/p>\n<p>That will only work with lots of units of course. If you have a small number, you’ll still be selling at a loss or breakeven by the time you run out of stock.<\/p>\n<h3><strong>“Destroying stock” doesn’t mean “destroying”<\/strong><\/h3>\n<p>Amazon doesn’t really destroy stock. It gets relisted as warehouse deals. Bear in mind the implications if that makes a difference to you.<\/p>\n<h2><strong>Amazon Ads &#8211; does it have a big place in ongoing sales?<\/strong><\/h2>\n<p>Yes, as long as you know your keywords.<\/p>\n<p>If you’re selling a product at £13.99, it takes 10 clicks to make a sale, and the cost per click is £5, you clearly <em>won’t <\/em>make a profit using Amazon ads. So the numbers have to work.<\/p>\n<p>The main aim is always to rank organically.<\/p>\n<p>If it’s me-too products out of Shenzhen (the electronics capital of China), you’re probably not going to make a product work anyway. The Chinese go deep at a low price, and are willing to lose money for months.<\/p>\n<p>They have $50 billion coming into the economy.<\/p>\n<p>Danny interviewed a Chinese guy doing $10m\/month<\/p>\n<p>They can lose money over a few shipments before breaking even. It’s going to be very hard to compete with that.<\/p>\n<p>If you can buy something for $1 and sell at $9, it looks attractive. But if you have to spend $8 on advertising to make the sale, it’s not viable.<\/p>\n<p>Message to market match is the most important part of Amazon advertising strategy and indeed for the business as a whole.<\/p>\n<h3><strong>How do we achieve Message to market match in Amazon ads?<\/strong><\/h3>\n<p>It comes down to niches &#8211; find something that sells 10-20 units\/day<\/p>\n<p>Consider EU markets, where there are few competitors; Take a view on Australia, which may turn out to be big; Look at Japan (which is the 3rd biggest Amazon marketplace, after Germany, bigger than the UK now)<\/p>\n<h3><strong>How can we find out potential amazon ad costs?<\/strong><\/h3>\n<p>Set up a basic listing:<\/p>\n<p>Take a barcode, put up a listing, make sure it is set to FBM (Fulfilled by Merchant), have a few units, and set up an Amazon ads campaign.<\/p>\n<p>Look at the estimated bids &#8211; this gives you a important guidance on price<\/p>\n<p>Eg in UK £0.75-1.75<\/p>\n<p>Any keywords that show no data for bidding probably have not got much search volume.<\/p>\n<p>Flick it in and out to avoid making sales and keep the price high so you don’t end up selling stock that you can’t fulfil on (this would be very bad for your seller account).<\/p>\n<h2><strong>Separate Amazon ad Launch costs from ongoing sponsored ads costs <\/strong><\/h2>\n<h3><strong>Danny’s own approach: <\/strong><\/h3>\n<p>If Danny can spend £1500 to get on page 1, he treats it as a product cost.<\/p>\n<p>Another way to put it is to see launch costs as startup investment, or upfront costs.<\/p>\n<p>Forget about ACoS at this stage! He works out PPC cost later.<\/p>\n<p>For clients, it depends, they’ll talk it through.<\/p>\n<h3><strong>Is basic strategy, once you’ve launched, to pull back on main keywords in Amazon ads?<br \/>\nHow does long tail work?<\/strong><\/h3>\n<p>The main keywords  may become unprofitable to advertise on.  If so, go after the long tail.<\/p>\n<p>This does depend on the niche.<\/p>\n<p>Beware of placing too much faith in micro-keywords. Sure it’s good to have a good conversion rate.<\/p>\n<p>But you need absolute sales numbers for it to make a difference.<\/p>\n<p>Look for keywords just one step down from unprofitable main keywords<\/p>\n<h3><strong>There are products where sponsored ads don’t work &#8211; why is this? What can we do if this is true?<\/strong><\/h3>\n<p>There are often over competitive markets.<\/p>\n<p>Why? People panic; they drop the product price and up the bid on Amazon adverts, so the cost per click gets very high.<\/p>\n<p>Then guys sell all their stock and attempt to sell it on FaceBook groups to other would-be sellers etc..<\/p>\n<p>Then PPC prices go up and up in that niche.<\/p>\n<p>So in these cases, it can be cheaper to do a 90% giveaway code.<\/p>\n<p>If you pay for clicks and get no sales, that is a bad use of money; with giveaway codes, at least you get a return for your money.<\/p>\n<h3><strong>So this is a more guaranteed result?<\/strong><\/h3>\n<p>Not necessarily. If everyone else is doing it, it won’t work.<\/p>\n<p>In some markets, many other sellers are doing the same thing. Keyword ranking is relative, so if they all do it, you could end up where you started at the bottom of page one.<\/p>\n<h3><strong>What happens if your ranking DOESN’T stick after spending on PPC?<\/strong><\/h3>\n<p>If you don’t stick it’s probably because of one of these factors:<\/p>\n<ul>\n<li>You have no reviews in a competitive market<\/li>\n<li>Review average (star rating) is too low for the market<\/li>\n<li>You have no consistency in giveaways\n<ul>\n<li>Jumping around 50% off, 70% off<\/li>\n<li>Coupon codes going out in random amounts &#8211; 20 one day, 5 next<\/li>\n<\/ul>\n<\/li>\n<li>Price &#8211; if you jack this up on back of giveaways, sometimes you’ll find that the product hits a price above which it won’t sell frequently.<\/li>\n<\/ul>\n<h2><strong>Relationship between PPC and listing<\/strong><\/h2>\n<h3><strong>Do you need to have keywords in the listing that you run amazon ads on?<\/strong><\/h3>\n<p>Basically, yes you do.<\/p>\n<p>Danny puts keywords in the  backend &#8211; 250 bytes to use; in the title; in bullets<\/p>\n<p>Title is the most important place via which to rank for keywords.<\/p>\n<h3><strong>How important is it to tweak your listing based on PPC data?<\/strong><\/h3>\n<p>Be careful not to mess up a listing that is working.<\/p>\n<p>A lot of people blow up their listings. They change a lot but don’t monitor\/record changes<\/p>\n<p>Take a picture of the start point first.<\/p>\n<p>Danny is loathe to touch a listing unless keywords  not appearing on PPC<\/p>\n<p>Basically, his approach is:<\/p>\n<ol>\n<li>Get best keywords<\/li>\n<li>Change little unless split testing<\/li>\n<\/ol>\n<p>If you want to test elements without a split testing tool, his rule of thumb is: make ONE change, leave it at least one week, then change it back.<\/p>\n<p>One day is not enough data. You also need to account for particular dates eg 4 July in the USA and for the season etc.<\/p>\n<h3><strong>Trying to guess conversion rate optimisation? Guess again. 90% of the time, you’re wrong!<\/strong><\/h3>\n<p>Danny and Ellis always follow the data at DataBrill.<\/p>\n<p>Rather than assuming they know best, they always run clients’ existing Amazon ads campaigns against their new “challenger” and test the differences.<\/p>\n<p>One of the  issues with data and conversion rates is that it goes against traditional company hierarchy and decision making. You go into a company and the boss makes decisions based on the boss’s opinions,  not the data.<\/p>\n<p>At this level, you’re on Amazon to make serious money. It makes sense to really use the tools available to follow the data. At the very least, you should document your changes.<\/p>\n<p>Otherwise yo,u’re in the world of opinions and speculation &#8211; like the classic FaceBook comment<\/p>\n<p>“My sales are quiet today”!<\/p>\n<h2><strong>If people want to discuss working with Danny <\/strong><\/h2>\n<p><a href=\"mailto:Danny@databrill.com\">Danny@databrill.com<\/a><\/p>\n<p><a href=\"http:\/\/www.sellersessions.com\/agency\">www.sellersessions.com\/agency<\/a><\/p>\n<p>Usually, they work with bigger sellers who have at least 100 SKU.<\/p>\n<p>However, Danny and Ellis have recently been able to put together a package for those with 30+ SKUs.<\/p>\n<p>If you have just 1-2 SKUs, Do It Yourself and learn the system.<\/p>\n<p>Sponsored ads are not complicated.<\/p>\n<p>People often try to outsource them when they are not working.<\/p>\n<p>Sadly, there is no substitute for good products<\/p>\n<h3><strong>Don’t panic!<\/strong><\/h3>\n<p>The sky is not falling in. The categories are not disappearing either.<\/p>\n<p>You just need to differentiate your product.<\/p>\n<p>If possible, don’t always buy stuff made in a Chinese factory.<\/p>\n<p>Go closer to home. Maybe find something that won’t travel well on the ocean.<\/p>\n<p>You could do what Danny does: source locally (in his case in the UK) and build a brand story around that fact.<\/p>\n<p>Work hard to differentiate your product and you can still make great money on Amazon.<\/p>\n<h3><strong>Watch my full interview with Danny McMillan<\/strong><\/h3>\n<p>[video_page_section type=&#8221;youtube&#8221; position=&#8221;bottom&#8221; image=&#8221;&#8221; btn=&#8221;light&#8221; heading=&#8221;&#8221; subheading=&#8221;&#8221; cta=&#8221;&#8221; video_width=&#8221;1080&#8243; hide_related=&#8221;false&#8221; hide_logo=&#8221;false&#8221; hide_controls=&#8221;false&#8221; hide_title=&#8221;false&#8221; hide_fullscreen=&#8221;false&#8221;]https:\/\/www.youtube.com\/watch?v=ptTsOxF_xmU&#038;feature=youtu.be[\/video_page_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F272.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F272-amazon-advertising-strategy%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/272.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=4715-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/272.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"272.mp3\">Download<\/a> (Duration: 46:01 &#8212; 37.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 46:01 &#8212; 37.2MB)Subscribe: Spotify | Email | RSSWhat is the difference in Amazon Advertising Strategy between a seller with 100+SKUs and a seller with 1-2 SKUs?<\/p>\n","protected":false},"author":1,"featured_media":4716,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[4],"tags":[1853,92,1152,1153,1151,1154,1155,1150],"class_list":["post-4715","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-amazon-fba","tag-amazing-fba-podcast","tag-amazon-ads","tag-amazon-advert","tag-amazon-advertising","tag-amazon-advertising-agency","tag-amazon-advertising-cost","tag-amazon-advertising-platform","tag-amazon-advertising-strategy","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Amazon Advertising Strategy for Advanced Sellers with Danny McMillan<\/title>\n<meta name=\"description\" content=\"Other software for Amazon ads management is rules-based and are very inflexible - it’s a one size fits all solution for Amazon advertising strategy.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Amazon Advertising Strategy for Advanced Sellers with Danny McMillan\" \/>\n<meta property=\"og:description\" content=\"Other software for Amazon ads management is rules-based and are very inflexible - it’s a one size fits all solution for Amazon advertising strategy.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2018-07-27T05:00:55+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-15T10:21:17+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/07\/272.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"272 Amazon Advertising Strategy for Advanced Sellers with Danny McMillan Part 2 of 2\",\"datePublished\":\"2018-07-27T05:00:55+00:00\",\"dateModified\":\"2020-05-15T10:21:17+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/\"},\"wordCount\":2176,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/07\/272.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"Amazing FBA Podcast\",\"amazon ads\",\"amazon advert\",\"amazon advertising\",\"amazon advertising agency\",\"amazon advertising cost\",\"amazon advertising platform\",\"amazon advertising strategy\"],\"articleSection\":[\"Amazon FBA Private Label\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/\",\"url\":\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/\",\"name\":\"Amazon Advertising Strategy for Advanced Sellers with Danny McMillan\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/07\/272.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2018-07-27T05:00:55+00:00\",\"dateModified\":\"2020-05-15T10:21:17+00:00\",\"description\":\"Other software for Amazon ads management is rules-based and are very inflexible - it’s a one size fits all solution for Amazon advertising strategy.\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/07\/272.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/07\/272.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"Amazon Advertising Strategy\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"272 Amazon Advertising Strategy for Advanced Sellers with Danny McMillan Part 2 of 2\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Amazon Advertising Strategy for Advanced Sellers with Danny McMillan","description":"Other software for Amazon ads management is rules-based and are very inflexible - it’s a one size fits all solution for Amazon advertising strategy.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/","og_locale":"en_GB","og_type":"article","og_title":"Amazon Advertising Strategy for Advanced Sellers with Danny McMillan","og_description":"Other software for Amazon ads management is rules-based and are very inflexible - it’s a one size fits all solution for Amazon advertising strategy.","og_url":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2018-07-27T05:00:55+00:00","article_modified_time":"2020-05-15T10:21:17+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/07\/272.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"272 Amazon Advertising Strategy for Advanced Sellers with Danny McMillan Part 2 of 2","datePublished":"2018-07-27T05:00:55+00:00","dateModified":"2020-05-15T10:21:17+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/"},"wordCount":2176,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/07\/272.png?fit=1280%2C720&ssl=1","keywords":["Amazing FBA Podcast","amazon ads","amazon advert","amazon advertising","amazon advertising agency","amazon advertising cost","amazon advertising platform","amazon advertising strategy"],"articleSection":["Amazon FBA Private Label"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/","url":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/","name":"Amazon Advertising Strategy for Advanced Sellers with Danny McMillan","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/07\/272.png?fit=1280%2C720&ssl=1","datePublished":"2018-07-27T05:00:55+00:00","dateModified":"2020-05-15T10:21:17+00:00","description":"Other software for Amazon ads management is rules-based and are very inflexible - it’s a one size fits all solution for Amazon advertising strategy.","breadcrumb":{"@id":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/07\/272.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/07\/272.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"Amazon Advertising Strategy"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/272-amazon-advertising-strategy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"272 Amazon Advertising Strategy for Advanced Sellers with Danny McMillan Part 2 of 2"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/07\/272.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-1e3","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/4715","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=4715"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/4715\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/4716"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=4715"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=4715"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=4715"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}