{"id":6424,"date":"2019-05-02T06:00:15","date_gmt":"2019-05-02T05:00:15","guid":{"rendered":"https:\/\/amazingfba.com\/?p=6424"},"modified":"2020-05-13T05:58:20","modified_gmt":"2020-05-13T04:58:20","slug":"322-starting-a-private-label-business-5-mindset-blocks-5-solutions","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/","title":{"rendered":"322 Starting a Private Label Business: 5 Mindset Blocks &#038; 5 Solutions"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F322.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F322-starting-a-private-label-business-5-mindset-blocks-5-solutions%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/322.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6424-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/322.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"322.mp3\">Download<\/a> (Duration: 37:41 &#8212; 25.9MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>The topic in this episode was inspired by a conversation I had with a mentoring client who reached out to me for help with motivation. Mindset is one of those areas that is a key part of success. So today I’m going to talk about five mindset blocks for those who are just starting out with a private label business, and their solutions.<\/p>\n<p><!--more--><\/p>\n<h2>Block 1 Lack of vision or leadership<\/h2>\n<p>Leadership means deciding in a direction you want to go, and why you want to go there.<\/p>\n<p>Poor reasons (somebody else’s vision)<\/p>\n<p>A lot of time people have poor reasons, or they see someone else’s vision for where they want to go.<\/p>\n<h3>Examples<\/h3>\n<ul>\n<li>Seems like a “good idea”<\/li>\n<li>FOMO &#8211; “everyone else is doing it”<\/li>\n<li>Greed &#8211; “everyone else is getting rich except me”<\/li>\n<li>Dreams of cars, houses etc.<\/li>\n<\/ul>\n<p>Money is not the only motivator. If the end goal is the only thing motivating you, I don’t think that’s enough.<\/p>\n<p>If you don’t have the right reasons, will you enjoy the process? The vision has to include the process, as well as the end goals.<\/p>\n<h3>Reactive reasons for starting your business<\/h3>\n<ul>\n<li>These motivations will not sustain you. These “away from” motivations have the issue that as soon as you remove yourself from the problem, your motivation will diminish.<\/li>\n<li>Sacking your boss\n<ul>\n<li>One one hand it’s very exciting to be independent,<\/li>\n<li>However, s\/he provides a valuable function!<\/li>\n<\/ul>\n<\/li>\n<li>Getting rid of structure &#8211; You need it\n<ul>\n<li>Getting rid of structure can be difficult<\/li>\n<li>It can be helpful to have to be at a job from 9-5 and to have that structure already<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h2>Solution 1: Define where YOU want to go<\/h2>\n<p>Personal leadership is not easy. It requires a lot of time, medication, and realism.<\/p>\n<h3>Left brain solutions<\/h3>\n<ul>\n<li>Are you looking to replace the day job?\n<ul>\n<li>If so, how much do you really need?<\/li>\n<li>And how soon are you aiming to do that?<\/li>\n<\/ul>\n<\/li>\n<li>Are you wanting to create a sellable asset?\n<ul>\n<li>How much do you want to sell for?<\/li>\n<li>In what timeframe?<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h3>Right brain<\/h3>\n<ul>\n<li>Do you really care about business?<\/li>\n<li>Is money really what you want?<\/li>\n<li>What price are you willing to pay for independence?\n<ul>\n<li>Being own boss<\/li>\n<li>Uncertainty?<\/li>\n<li>Lumpy income?<\/li>\n<\/ul>\n<\/li>\n<li>Is entrepreneurship really for you?<\/li>\n<li>What business model is right for you? It’s very important to be realistic about who you are and what you’re not as well.\n<ul>\n<li>Internet<\/li>\n<li>Ecommerce<\/li>\n<li>Amazon<\/li>\n<li>Private Label<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h2>Block 2: Delusion<\/h2>\n<p>One of the things Stephen Covey talks about in “7 Habits of Highly Effective People” is the right and left brain, or in more simple terms, thinking about things more intuitively and emotionally, versus the numbers and logic-led items. I think it’s important to think with both.<\/p>\n<h3>Right brain<\/h3>\n<p>Have you been sold into a fantasy?<\/p>\n<p>If people are telling you that selling on Amazon is “low risk”, “quick” or “easy”, walk the other way.<\/p>\n<h3>Left Brain<\/h3>\n<p>Are you looking at the numbers correctly?<\/p>\n<p>For example, when looking at the market, the size of the market itself doesn’t matter. You should look at what percentage of the market you or your business can own.<br \/>\nFinancial numbers<\/p>\n<ul>\n<li>Revenue is not profit<\/li>\n<li>Profit is not personal income<\/li>\n<li>You can’t take income out of a fledgling business<\/li>\n<li>You can’t take all the profit out as income without killing a business<\/li>\n<\/ul>\n<h2>Solution 2: Honest information and realistic goals<\/h2>\n<p>Follow the right people<\/p>\n<p>Follow case studies of actual successes<\/p>\n<p>Follow more than one study<\/p>\n<h2>Block 3: Confusion<\/h2>\n<p>The problem here is too many opinions and not enough clarity.<\/p>\n<h3>Specifically<\/h3>\n<ul>\n<li>Too many podcasts<\/li>\n<li>Too many FaceBook groups<\/li>\n<li>Too many Youtube videos<\/li>\n<\/ul>\n<h2>Solution 3: Clarity &amp;  structure<\/h2>\n<p>Courses can help, just be careful who you choose.<\/p>\n<p>Selective communities also. Instead of joining a free Facebook group, join one that is linked with a course.<\/p>\n<p>The right expertise for where YOU are at NOW, as long as you are following the right people in the right communities.<\/p>\n<h2>Block 4: Motivation<\/h2>\n<p>Can’t get started or stay started.<\/p>\n<p>“Isolation is a dream killer” -Barbara Sher<\/p>\n<p>This is also linked with the first mindset block, of not knowing where you want to go, which can lead to a lack of motivation.<\/p>\n<h2>Solution 4: Connect &amp; get accountable<\/h2>\n<ul>\n<li>Community (online or off-line)<\/li>\n<li>Facebook<\/li>\n<li>Conferences<\/li>\n<li>Masterminds<\/li>\n<li>Mentor<\/li>\n<\/ul>\n<h2>Block 5: Time Management<\/h2>\n<p>“Lack of time is lack of priorities” -Tim Ferriss<\/p>\n<h2>Solution 5: Get accountable and get real about time<\/h2>\n<p>In order to better manage your time, you need to be granular and detailed in looking at your week.<\/p>\n<p>You’ll be surprised by how much you can accomplish if you are really consistent and do the right things.<\/p>\n<p>The easiest way to do this is to get accountable and get a coach.<\/p>\n<p>This is NOT really a job for a mastermind, although it can help.<\/p>\n<p>In theory, co-coaching is a lovely idea; but it generally fizzles out.<\/p>\n<h2>Transcript<\/h2>\n<p>Ladies and gentlemen, boys and girls, welcome to amazing FBA the place to be for British Amazon sellers. Although in fact, if you&#8217;re American, or from India, Canada, Germany, they&#8217;re our main sort of listeners, stick around, I think this is relevant for everybody. Today&#8217;s episode is inspired by a conversation I had with a new would be client who was actually coming on board and mentoring client. And the reason he got in touch with me really was about motivation, time management, actually, although mindset is one of those areas where in a sense, I prefer to leave it alone, because I&#8217;m a bit suspicious of things that aren&#8217;t concrete and measurable. But actually, the truth is, you can&#8217;t avoid I find I can&#8217;t avoid mindset being a key part of success and failure in business. If I look at what actually have done, what I&#8217;ve achieved, and the things I&#8217;ve left on the table, the money I could have made, I missed out on all the other failures or non non successes shall we say. And also, that&#8217;s true for my clients as well, then I can&#8217;t avoid mindset being at the center of it. So today, I&#8217;m going to talk about five blocks, five mindset blocks and five solutions. For those who are just starting out with a private label business. When you&#8217;re just starting out, and you have no actual turnover, it&#8217;s a really difficult phase and sort of in the wilderness, as I call it, that you can get very, very lost very easily because it doesn&#8217;t feel real, it doesn&#8217;t feel justifiable use of your time, there&#8217;s disappointments, but you don&#8217;t have the upside of the revenue yet. And it&#8217;s very, very easy to quit, most people quit somewhere along the lines of trying to find the right or the perfect product as opposed to a MIDI quite good one. Some people quit when they&#8217;re trying to source products, and most people quit if they get a product that they over go the other way, they over sell themselves into something that they shouldn&#8217;t probably bought. And they buy several thousand dollars worth of something, it doesn&#8217;t work out, they lose a bit of money or they don&#8217;t make many sales, and they quit. Now actually, I think all of that is a mindset issue rather than anything else. Because the truth is that it&#8217;s going to be real business. And it takes effort. And you&#8217;re going to have some bumps along the road, whether you&#8217;re investing in stocks and shares or you&#8217;re investing in running property investments or developing property, or you&#8217;re developing a brick and mortar business or an online business, which is information marketing, like a podcast, for example, which obviously I know all about, or an Amazon business, which I also know from my own experience and that of many other people now, guess what all of them are going to have their tough times as well as the upsides and you&#8217;ve got to get through the tough times to get through to the winds. If you&#8217;re not still in the game, you can&#8217;t get the wins, you got to be in it to win it as they say. So that sounds really obvious. And a lot of people say that, and they nod their head what he say it but they don&#8217;t really really deal with it properly. So I&#8217;ve got five blocks and five mindset solutions here that I think could help you if you&#8217;re in that situation. first block, I think is lack of vision or lack of leadership. So what the hell is leadership? Well, it means just basically deciding and a direction you&#8217;re going to go. And just as importantly, why you want to go there. So a lot of people I think have poor reasons for doing things. They seem externally good reasons. But there&#8217;s somebody else&#8217;s vision seems a good idea, fear of missing out fo mo everyone else is doing it greed, everyone else is getting rich, except for me. Dreams are cars, houses, etc. That&#8217;s fine. Nothing wrong with having a nice house or a nice car and I aspire to both I&#8217;m working towards that we&#8217;re hopefully going to get ourselves a new property this year. And it&#8217;s all very exciting. But guess what, that&#8217;s not going to be enough? If the end goal is the only thing motivating you? I don&#8217;t think that&#8217;s enough. I mean, first of all, is that personalized to you. The second thing is, are you really get it enjoy the process, as well. So I think if vision has to include the process is more than just the angles as well. So you got to enjoy the process of creating a business going to be creative reasons, rather than just end goal type reasons. So that&#8217;s another way of putting it is if you&#8217;re just interested, the end goal and you don&#8217;t care about the price, you&#8217;re not interested, you&#8217;re not going to survive to get to the end goal, I can pretty much guarantee that with you know, 99% accuracy. The other problem that people have with leadership, if you like, is reactive reasons away from motivation. And this is so big in the marketing of pretty much every business internet opportunity or whatever you want to call it. And I try and stay away from that kind of marketing now because it just produces the wrong results for everybody. I get clients who aren&#8217;t realistic, and don&#8217;t have any staying power and and the clients don&#8217;t win. So suck your boss. Well, yeah, that&#8217;s great. A friend of mine even produced a book called sack your boss recently. And yes, on one hand, it&#8217;s very exciting to become independent. But on the other hand, your boss provides a valuable function. A lot of us, myself included, find it very hard to work in the absence of a boss. And I&#8217;m saying is he considering hiring a part time project manager at the moment, not just to manage a team, although I do want that, but to help manage me, because I need managing right? If you got a boss, they take care of that. So there is a great deal of value in a boss and sooner or later you or your business needs one, right being the boss is also tricky because guess what, if you are are not at the top of your tree at work, and you have a boss, then guess where all the the as I don&#8217;t want to be crude, but I remember talking to a head teacher of a school once he said yeah, I used to run away on the ground running stuff he used to go Forgive me guys is what he actually said, when I was a teacher and now become the head teacher. Now I know where why it goes to In other words, you got to deal with the problems nobody else can solve. So it&#8217;s not all it&#8217;s cracked up to be not, you know, getting rid of the boss or being the boss. The other thing is getting rid of structure feels desirable, you don&#8217;t have to worry, you can work in your underpants, as everyone goes on about internet marketing. Well, guess what, that&#8217;s actually difficult having a structure where you have to be at a particular place by a particular time. So a nine to five, routine or whatever it is, if you work in a building, you know, 6am to 6pm, whatever the routine is, is very, very helpful. And trying to replace that is actually a difficult challenge. So those away from motivations, I don&#8217;t think you&#8217;re going to sustain you apart from anything else away from as opposed to towards motivation. So going away from a problem rather than towards a goal has the issue that as soon as you remove yourself from the problem, your motivation is diminished. So if you get rid of your boss and have a horrible person you don&#8217;t want to work with great, you get rid of your boss, then what you&#8217;re going to be away from the person that was motivating you to be your own boss. Now what&#8217;s going to keep you moving. So I think the solutions are pretty straightforward, in some ways in very subtle in other ways. So the personal leadership is never easy. I think it requires a lot of time and meditation and realism. The first thing is there&#8217;s a lot of left brain or very analytical answers to this. And I think they&#8217;re very businesslike, but they don&#8217;t go far enough. So the left brain left brain solutions are very simple things to define as a business coach, are you looking to replace your day job? Okay, if so, how much do you really need? Do you need 2000 pounds a month in personal income? Is it five? Is it 10? What&#8217;s that figure? And in that case, going to be very clear that personal income, not the profit, let alone the revenue of your business, which is something else will come to right? And how soon do you need to do that? Six months, a year, 18 months, two years, three years, a lot of people get sold the idea that you can replace the data within a year. I think that&#8217;s mostly Bs, it can be done. But that requires a degree of luck and a vast amount of aggression, which most people don&#8217;t have nothing wrong with that if you do but you will probably have to take big risks as well. And you&#8217;re probably more risk averse than you think. Second thing then is are you wanted to create a sellable asset. If So how much do you want that to sell for and what timeframe, most people don&#8217;t come in with that mentality. Some people do tend to be the more advanced people who actually build a business that think in terms of creating sellable assets. But still, you got to think that through. So that&#8217;s the left brain stuff that&#8217;s all very well. And it&#8217;s easy to come up with a smart answer for that. But the right brain stuff is really you know, where your heart is, where your vision is, what really, really, you know, what you really feel actually matters. First of all dreams of cars house is great, but it takes time to get the results of a big house or a nice car or holidays, whatever it is. And you need to enjoy the process. So the first question I would say is do you really care about business? Is it something that interests you intellectually? emotionally? Do you like the game? Do you like a bit of competition? Is money really what you want? I mean, sometimes it&#8217;s not really what people want. They want time with their families, in which case, okay, long term that makes sense, are you prepared to sacrifice some time with your family, in the short and medium term, in other words, the next few months or couple of years, is independence is going to have its price as well, if you want to be independent from your boss, we&#8217;ve already talked about the fact that your boss provides valuable function, and, you know, keeping things in order, you&#8217;re going to have to deal with being your own boss, which is difficult. I certainly felt that I&#8217;m, you know, become unemployed, and self employed rather, and I started working for an idiot, sometimes, I have great strengths, one of which is not probably being very disciplined. So that&#8217;s why I have a business coach More on that later. uncertainty, you not sure whether things are going to be one way or the other from one month to the next sometimes. And I personally quite like uncertainty, it sounds like a funny thing to say. But I think you need to be able to deal with it. Preferably embrace it. And if that&#8217;s not you be real about that. The lumpy income, you can get some you know, Christmas is famously massive in retail, and then feast and famine when you get to January as well. There&#8217;s a very basic question that I think a lot of people overlook too quickly, when they get excited by a business opportunity pitch online. And that is, is entrepreneurship really for you a lot of the things that I&#8217;ve just talked about as independence as the upside of freedom, which is very clearly and commonly the big motivating factor, I think, particularly for men, but also for some of the women that I work with, but being your own boss being and having the uncertainty having lumpy income, these are quite big costs. And some people don&#8217;t really have the right mentality to deal with that. And there&#8217;s nothing wrong with that either. I think one of the things that happens these days is that everyone worships entrepreneurship so much, they put it on such a pedestal, that actually, it&#8217;s not the right thing for some people, and that&#8217;s perfectly okay. So you don&#8217;t need to feel bad about it. But just recognize it may not be the solution. If you need an extra couple of grand a month, maybe get a part time job, maybe look for promotion, maybe try to change which company you work for in your day job these are perfectly acceptable, in fact, in many cases, very better alternatives. So just be realistic about it. If entrepreneurship is right for you, is the business model you&#8217;re considering right for you is internet marketing right for you. If you&#8217;ve got a very physical hands on approach to things and you&#8217;re averse to technology. Some people really struggle with spreadsheets for example, they can&#8217;t navigate around the computer, it may be that it&#8217;s not for you and internet based business requires a certain fluency within comfort with computers.<\/p>\n<p>So is e commerce for you some people are better suited to the lower risk but more legwork of a an information based business. Some people love them leveraged fact that ecommerce, particularly working with Amazon will allow you to really leverage your time in an amazing way. But there are costs that Amazon is a bucking bronco sometimes, and some people can cope with that and some can&#8217;t. So it&#8217;s very, very important to be realistic about who you are, and what you&#8217;re not as well. And it&#8217;s okay to run an e commerce business or not run an e commerce business just because it&#8217;s the latest thing and some people are making money with it doesn&#8217;t mean it&#8217;s right for you. block number two, is I would call it delusion or in other words, believing what is not true. Okay? So have you ever been sold into a fantasy no risk or low risk is quick, it&#8217;s easy. If people are saying things like that about Amazon, as a business model private labeling on Amazon just walk the other way is my advice, because I don&#8217;t think it&#8217;s quick, low risk or easy you can I was saying to my client earlier new client, and when I was interviewing him for the mentoring position, because I don&#8217;t just take on anybody if I don&#8217;t think I can help somebody, or they&#8217;re not well placed to make success, I don&#8217;t want to take their money in return for just selling them a delusion. I&#8217;m not into that. But I would say there is a path between speed, time and time and you put into things the speed you get going the money and the risk you take, if you&#8217;re willing to take very high risks, and you put a lot of time into things, you can go very fast. If you however, want to take moderate sensible judge risks, and you only work at something so 15 hours a week, which is going to be the case with this latest client I&#8217;m working with, guess what is going to take you longer to get your first product to market and there is a danger that you get stuck in that wilderness and you never move forward. So momentum is really important. But you don&#8217;t always have to take high risk in order to get momentum. Sometimes you just need to get more accountability, more about that later. The other thing is just a more of a left brain thing. So it says right brain and left brain I&#8217;m thinking about because I&#8217;ve been reading rereading Stephen Covey&#8217;s amazing Seven Habits of Highly Effective People I&#8217;ll be doing some more we did three podcasts about that a while ago can be creating some more of a sin. But one of the things he talks about as a right and left brain and I think<\/p>\n<p>it&#8217;s important to think about it both ways. Or to put it in simple terms. The sort of emotional and intuitive response to things is important as well as the the intellectual numbers, lead logic lead stuff, but the left brain stuff or the logic read stuff is very, very important as well, are you looking at the financial numbers correctly, people can sometimes get very excited about a market size. Look, there&#8217;s somebody making $500,000 a month selling, I don&#8217;t know some plastic widget on Amazon in the USA, maybe it&#8217;s come candleholders or something doesn&#8217;t really matter how big the market size is, what matters is what percentage of the market you or your business can own, or indeed dominate. So that&#8217;s one of the things that people get to get very wrong with market size, but then their financial numbers can be off as well. So the marketing numbers, that&#8217;s one thing, but the financial numbers can be an even bigger problem. revenue, for example, is not profit. It sounds obvious. Everyone intellectually knows this would have thought but it&#8217;s amazing to me, after three years of interviewing people for to come on board for mentoring. How many people get confused about this? If you got a day job that makes you say that say what&#8217;s the medium income in in Britain, that&#8217;s probably about 35,000 pounds a year, let&#8217;s say 36? Right? Because that gives us 3000 pounds a month income, right? Translates dollars if it makes it easier for you and your currency. So let&#8217;s say 3000 pounds a month in income, okay, well, you know, that&#8217;s pre tax, but you&#8217;re going to take a bit of expenses and better tax off, but you&#8217;ll get to keep most of that as personal income, right? That is absolutely not the case with a business where most of your capital is tied up in physical products. So if you have a physical products business that is doing 3000 pounds a month revenue, if you&#8217;ve got a gross profit margin of say 30%, which is quite typical, and you&#8217;ve got some overheads, at some kind of reasonable scale. But probably before you&#8217;ve had a lot of staff, you can maybe make 20% profit. So meaning that all of your costs taken away from all of your income equals about 20% of the three thousand pounds, or in that case of about 600 pounds a month. Now most of us can&#8217;t live on that. And certainly, if you&#8217;re trying to replace a 3000 pounds a month personal income, albeit pre tax, let&#8217;s say I don&#8217;t know what you&#8217;re going to make post tax in the UK various in different jurisdictions that say it&#8217;s 2400, 2500,<\/p>\n<p>whatever. That&#8217;s the number you&#8217;ve got to replace. So the revenue is not the same as your income nor is profit. And this is the big difference team business owner thinking and being a freelancer or an entrepreneur, if you&#8217;re an entrepreneur, you&#8217;re trying to build a business that is goes runs without you, which is where the passive income idea comes in, or leveraged income passive is a bit of a poor word to use, but it&#8217;s somewhat passive. But guess what, there&#8217;s a price for that. If you sell your time, and you have some expenses that the profit is yours to keep, because you are your business, whereas once you&#8217;ve got a business depends on selling physical products, the upside is short, you don&#8217;t have to be physically present to sell them. And that&#8217;s absolutely true. And it is a fantastic episode. But the downside of that is you&#8217;ve got to make sure you don&#8217;t kill your business by taking all the money out for yourself as personal income. So if you make a revenue of 10,000 pounds per month, for example, your Amazon business makes that revenue other events are running at a 20% profit margin you will make your business will make rather 2000 pounds profit. But if you take all of that money out, you&#8217;re going to kill the business. So you won&#8217;t allow it to grow. And you&#8217;ll probably just kill it completely. So maybe you take half even that is a lot. So let&#8217;s just 1000 pounds a month. So if you&#8217;re aiming, for example, to replace a 36 pounds a year, 36,000 pounds a year income, or 3000 pounds a month, that obviously doesn&#8217;t work out. So you can figure out quite quickly that if you&#8217;re going to say, need 3000 pounds and personal income and you don&#8217;t want to kill your business, your business is probably going to need to make six to $10,000 or sorry, pounds a month in profit. That&#8217;s exactly the $7 no difference. In which case, you&#8217;re probably looking at turning over 30 to 50,000 pounds a year before you can quit the day job. And that&#8217;s about the level. Actually, in reality between 50 and 100,000. That seems to be the freedom figure for most people in the 10 k collective, it&#8217;s actually quite a bit bigger than you think that sounds quite alarming. But the good news is that you can get bigger revenue, you might imagine possible Amazon, that the trick on Amazon is if you get the right market, not so much getting revenue and sales because Amazon&#8217;s an incredible machine for that if you get it right, it&#8217;s getting the profits. And that comes when you source from China. And that&#8217;s there&#8217;s a whole bunch of other stuff that goes behind achieving that. But it&#8217;s very, very good to be clear about what you&#8217;re aiming at. And it doesn&#8217;t take long to calculate that it&#8217;s pretty easy, right? But you just need to make sure you&#8217;ve looked at that blockchains delusions, and the solution is honest information and realistic goals. We talked about realistic goals just a matter now with financial numbers, the the right brain stuff old, you know, believing the sort of, if you like beliefs of what is possible, and what isn&#8217;t, you know, this sort of general big picture stuff is solved by the following. I think you need to follow the right people follow case studies of actual successes, and follow more than one case studies. So the classic thing is somebody makes, you know, hundred thousand pounds or dollars a month in revenue, they become a kind of Guru, they teach everyone else how they did it. Great. Well, that&#8217;s fine. But if they did it several years ago, Does it still work now? And the answer is it&#8217;s hard to know they&#8217;re just basing on one star story for sure. It&#8217;s good to follow successful people. But I would prefer to see a situation where they&#8217;re generalizing based on generalizing principles and formulas based on multiple different case studies. And that is what I try and do with the 10 k collects the million pound mastermind I help those people to grow their businesses on they help each other really, let&#8217;s be honest, I&#8217;m the convener, the facilitator, but we help each other to grow each other&#8217;s businesses. But what I can bring from that is come back to the people at this stage that this episode is geared to the beginners, and bring back the right principles, the right habits of mind and of action, and the right business models that are actually working now, for serious sellers, rather than once for me several years ago, lock three confusion or not knowing what to do. Then basically one problem here, which I would say is too many opinions, not enough clarity, rights, specifically as well, too many podcasts, including this one, if you listen to every single episode, too many Facebook groups, too many YouTube videos. I mean, I get people come to me occasionally and say, I really liked your podcast, I started at episode one. And I&#8217;m listening to all of them. And I just can&#8217;t quite believe when people say that. I mean, it&#8217;s kind of flattering. But it&#8217;s also scary. I&#8217;m like that&#8217;s over 300 episodes, some of which will have, you know, timeless value and evergreen content. And I try and produce more of that these days, like this episode, I believe is going to be evergreen, because these principles aren&#8217;t ever going to change. But a lot of the tactical type stuff will no longer apply. I started this podcast in September 2015, a lot of the landscape has shifted around reviews, particularly launch strategy, how competitive Amazon is now how good your listing needs to be just to kind of be at the basic entry level. So be aware of that don&#8217;t absorb too much from forecast absorb what&#8217;s you but be a bit selective. So I think the solution is really simple clarity, and structure. I think courses can really, really help. Just be careful who you choose selected communities as well. So instead of joining a free Facebook group join one that is linked with the course. The other thing is get the right expertise for you where you&#8217;re at now. And and one caveat is see, solution number two makes you fall in the right people in the right communities. The majority of Amazon based podcast can be a bit unrealistic in their expectations, they said I think a few of them are more realistic, I tried to be one of those as well, there are a few out there, you&#8217;re gonna have to decide for yourself. But just make sure two things. Number one, you choose the right courses, if you&#8217;re going to follow that choose the right communities to join and make sure it&#8217;s relevant to where you&#8217;re at. Now, if it&#8217;s something that requires a lot of money, and you have a little bit of capital, it&#8217;s not going to be relevant to you. If it&#8217;s something that is very advanced, and you know, looking at courses for advanced Facebook marketing for Amazon sellers, and you haven&#8217;t sold a penny dime yet, it&#8217;s premature to be worrying about that. And it amazes me that people will go on sourcing trips to China, that cost several thousand dollars or something. And there&#8217;s they&#8217;re selling nothing yet. And which is kind of blows my mind. I mean, the first thing is get something selling, learn your craft and then go to China if you want to go you know, or India or wherever else it may be. So I&#8217;ve had members of the 10 k collective or million pound last one who&#8217;ve shared that with me that they&#8217;ve been on trips that cost them several thousand, were very valuable for them. The half the people there weren&#8217;t selling anything yet, that&#8217;s just kind of crazy. Another person in the 10 k collective went to a course it costs them $10,000 over in Las Vegas where else and he said yet maybe it was valuable, maybe not. But again, it was a ranking based It was about how to rank and launch products. And half the people that didn&#8217;t have any revenue didn&#8217;t have any products to sell. Again, that&#8217;s a crazy thing to do don&#8217;t take courses or information on board that is not relevant to your situation, I can&#8217;t stress that enough is just wasted money.<\/p>\n<p>block number four is most can&#8217;t get started, can&#8217;t stay started. This is really huge. And this is what brings quite a few people to my doors as a coach and mentor. Isolation is a dream killer, as Barbara share says. And it really really is true. It&#8217;s also linked, I think to this first block, which a lot of people don&#8217;t see because it&#8217;s so big. It&#8217;s kind of like the ground you walk on that you don&#8217;t realize that your personal in a vision, if you like or leadership is it or lack of it is the problem. But I think it&#8217;s very, very linked to that. If you&#8217;re following somebody else&#8217;s fear of missing out or greed, or dreams of houses, whatever, but you actually not the right kind of person to be running a business. That may well be why you&#8217;re not motivated, but sometimes is simply isolation. And in which case the solution is connect and get accountable. A community can be great online or offline even better if you can meet in person, I used to run a community for beginners, people just the stage that we&#8217;re talking about now, where you&#8217;re pre revenue if you like, I&#8217;ve shut that down. Because basically I couldn&#8217;t get people to be committed enough to turn up month after month. Now if I run that, again, I may run an online version of that. And if that&#8217;s an interest you email me and explain your thinking. And if enough people do that, then I&#8217;ll run it Michael at amazing fb a.com f4 Friday before Bertie, eighth alpha.com Michael and my ch AE l at amazing fba.com. So do some of your thoughts. Even if people want to do it great. But it&#8217;s not easy to get a good quality community a bit of beginners, because most of them stay beginning beginner I they don&#8217;t do anything. Facebook communities can be useful. So don&#8217;t be selective where you go. conferences are very good for meeting people, masterminds even better. But as I said, it&#8217;s, it&#8217;s a bit hard to get a must one that is true mastermind, if everyone&#8217;s a beginner. So as a beginner, I think you can&#8217;t help come up with the idea of a mentor. And that&#8217;s why people approach me and I&#8217;m not saying you should or shouldn&#8217;t work with me or anybody else. It&#8217;s not a cheap solution. But I think it&#8217;s like anything else I&#8217;m about to fill in for my wife in a few minutes to go and teach a piano lesson to a little boy, he&#8217;s learning piano. Is it impossible to learn piano without a parent teacher? Of course not. There are tons of YouTube videos. There&#8217;s tons of internet resources, like just like Amazon selling or anything else. But the truth is, you need that accountability, that personalization, that motivation to keep going. So that&#8217;s why most people who play the piano well that I know, started with a teacher and had one to one lessons. And there&#8217;s nothing wrong with just admitting that it&#8217;s an investment now, and you get the payoff later. But it generally is a hell of a lot more realistic than think you&#8217;re going to learn on your own. block number five is related to this. And again, this is one of these blocks, which people think the problem is time management, which is block number five, it&#8217;s actually often a question of motivation, combined with a lack of leadership. But nevertheless, lack of time is like a priority says Tim Ferriss. Okay, but nevertheless, it is linked and and it&#8217;s the first thing that people show up with and say, I&#8217;ve got a problem with time management, you dig a bit deeper. Often that&#8217;s not the case. It&#8217;s about motivation and stuff as well. So, again, the solution is to get accountable, just like for lack of motivation, but also get real about time. I think a lot of people don&#8217;t get granular enough about the issues in time management. And for that reason, they don&#8217;t look at their week in detail. So yeah, I can spend 20 hours a week and then when you dig deep just like I did today with the new client I&#8217;m going to work with Okay, Mondays Yeah, great. can do two hours in the evening. What about choosing this will own actually choose? We have a meeting at work that goes late. So I get home and I&#8217;m just going to eat and go to bed. Okay, so Tuesdays, Wednesdays yet Thursday? Oh, yeah. I&#8217;m normally away from home that day. So I can actually do more Fridays? Yeah, and only two days. Okay, Saturday, I can do anything I like, okay, really, for your daughter or son doesn&#8217;t have any sports events? Or Yeah, well, my, my son goes to football and my daughter goes to ballet dancing or whatever. You know, what about Sundays? Do you go to church? Well, yeah, we generally do. We don&#8217;t have to. But you know, once you take account of personal life, social life, you&#8217;ve got kids taking them to various things, you know, cleaning the house cooking, having time with your spouse, very important, then you got to be real about the fact that there&#8217;s probably less time available than you think, which is not a problem. As long as you&#8217;re very real about that. very consistent and how you use it. It&#8217;s amazing how much progress you can make in a relatively modest amount of time. If you&#8217;re really consistent, and you do the right things. So consistency, and you know, focus on doing the right things is just as important as anything else. The easiest way to get this to happen is to get a coach get accountable. Again, it&#8217;s like having a piano teacher or personal trainer, or anything else I&#8217;m you can do stuff without, you&#8217;re more likely to make good progress with so I don&#8217;t think this is really a job for mastermind, the mastermind can help you stay accountable in the big picture. But if you&#8217;re struggling with this, particularly again, as a new person, having tried to run masterminds for pretty much two years for newbies, it&#8217;s very difficult to make that work is much better to meet together than it is to not meet so I think I provided a great service for people. But in the end, it was just a bit too much pushing a boulder uphill, because the turnover is so quick with newbies. So I think you&#8217;re better off with a mentor them with a mastermind at the early stages and then transition into masterminds, when you&#8217;ve actually got some traction and the people around you and you have value to share. So coaching isn&#8217;t another idea where you go, you keep each other accountable. Again, in theory, this is lovely. I&#8217;ve tried this with friends and business partners before out now and not really business partners, but friends or people in the similar, you know, situation to me is a freelancers trying to create their own business. But it generally fizzles out in my experience, because neither person has a strong enough motivation. And the truth is coming back to the idea of you know, what&#8217;s pushing you to do this in the first place, firing your boss is one thing, but you&#8217;ve got to replace him or her being a boss is a valuable job. It turns out telling people what to do managing people, keeping them accountable goals, making sure they keep moving, get stuff gets done, projects move forwards, guess what, that&#8217;s really critical. And it&#8217;s actually it turns out, it&#8217;s actually hard work because you got to push people forward, you&#8217;ve got to keep an eye on reality and goals and match the to what you&#8217;re going to measure things, there&#8217;s a lot to do. And therefore most people want to get paid for that. And that&#8217;s why you pay a coach for it. You&#8217;re You&#8217;re outsourcing if you like the management piece, and as I say, not not only do I have a business coach, myself who I pay good money for, to work with, I worked for quite a long time on a weekly basis, we now meet twice a month, just because it&#8217;s a bit more affordable and sustainable. And again, I offer the same things to my clients. But the truth is a weekly meeting is very, very good and really helpful, particularly for getting stuck. And the other thing is that I&#8217;m considering hiring a project manager to manage me as well as other people. So I recognize the reality of this. So don&#8217;t be ashamed or afraid or think it&#8217;s somehow weakness, or you should be able to do this on your own. Most good big achievements in life and certainly in business are not the solo lone entrepreneur, like the Lone Ranger riding on his horse like a cowboy. The truth is, it&#8217;s a team win. And you need to get yourself a team from the beginning, I think so you need to get yourself and the coach and your suppliers and then you&#8217;re actually going to be in business. Thanks for listening. Hopefully, this is helpful. And thank you very much for your attention. Speak to you in the next year.<\/p>\n<h3><strong>Watch my discussion of Starting a Private Label Business: 5 Mindset Blocks &#038; 5 Solutions<\/strong><\/h3>\n<p>[video_page_section type=&#8221;youtube&#8221; position=&#8221;bottom&#8221; image=&#8221;&#8221; btn=&#8221;light&#8221; heading=&#8221;&#8221; subheading=&#8221;&#8221; cta=&#8221;&#8221; video_width=&#8221;1080&#8243; hide_related=&#8221;false&#8221; hide_logo=&#8221;false&#8221; hide_controls=&#8221;false&#8221; hide_title=&#8221;false&#8221; hide_fullscreen=&#8221;false&#8221;]https:\/\/www.youtube.com\/watch?v=TDyGwAOPAlk&#038;feature=youtu.be[\/video_page_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F322.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F322-starting-a-private-label-business-5-mindset-blocks-5-solutions%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/322.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6424-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/322.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"322.mp3\">Download<\/a> (Duration: 37:41 &#8212; 25.9MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 37:41 &#8212; 25.9MB)Subscribe: Spotify | Email | RSSThe topic in this episode was inspired by a conversation I had with a mentoring client who reached out to me for help with motivation. Mindset is one of those areas that is a key part of success. So today [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":6425,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[4],"tags":[966,1853,78,88],"class_list":["post-6424","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-amazon-fba","tag-accountability","tag-amazing-fba-podcast","tag-mindset","tag-time-management","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>322 Starting a Private Label Business: 5 Mindset Blocks &amp; 5 Solutions - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"322 Starting a Private Label Business: 5 Mindset Blocks &amp; 5 Solutions - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 37:41 &#8212; 25.9MB)Subscribe: Spotify | Email | RSSThe topic in this episode was inspired by a conversation I had with a mentoring client who reached out to me for help with motivation. Mindset is one of those areas that is a key part of success. So today [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-05-02T05:00:15+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-13T04:58:20+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/322.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"36 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"322 Starting a Private Label Business: 5 Mindset Blocks &#038; 5 Solutions\",\"datePublished\":\"2019-05-02T05:00:15+00:00\",\"dateModified\":\"2020-05-13T04:58:20+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/\"},\"wordCount\":7421,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/322.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"accountability\",\"Amazing FBA Podcast\",\"mindset\",\"Time management\"],\"articleSection\":[\"Amazon FBA Private Label\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/\",\"url\":\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/\",\"name\":\"322 Starting a Private Label Business: 5 Mindset Blocks & 5 Solutions - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/322.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-05-02T05:00:15+00:00\",\"dateModified\":\"2020-05-13T04:58:20+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/322.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/322.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"322 Starting a Private Label Business: 5 Mindset Blocks &#038; 5 Solutions\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"322 Starting a Private Label Business: 5 Mindset Blocks & 5 Solutions - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/","og_locale":"en_GB","og_type":"article","og_title":"322 Starting a Private Label Business: 5 Mindset Blocks & 5 Solutions - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 37:41 &#8212; 25.9MB)Subscribe: Spotify | Email | RSSThe topic in this episode was inspired by a conversation I had with a mentoring client who reached out to me for help with motivation. Mindset is one of those areas that is a key part of success. So today [&hellip;]","og_url":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-05-02T05:00:15+00:00","article_modified_time":"2020-05-13T04:58:20+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/322.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"36 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"322 Starting a Private Label Business: 5 Mindset Blocks &#038; 5 Solutions","datePublished":"2019-05-02T05:00:15+00:00","dateModified":"2020-05-13T04:58:20+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/"},"wordCount":7421,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/322.png?fit=1280%2C720&ssl=1","keywords":["accountability","Amazing FBA Podcast","mindset","Time management"],"articleSection":["Amazon FBA Private Label"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/","url":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/","name":"322 Starting a Private Label Business: 5 Mindset Blocks & 5 Solutions - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/322.png?fit=1280%2C720&ssl=1","datePublished":"2019-05-02T05:00:15+00:00","dateModified":"2020-05-13T04:58:20+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/322.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/322.png?fit=1280%2C720&ssl=1","width":1280,"height":720},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/322-starting-a-private-label-business-5-mindset-blocks-5-solutions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"322 Starting a Private Label Business: 5 Mindset Blocks &#038; 5 Solutions"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/322.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-1FC","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6424","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=6424"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6424\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6425"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=6424"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=6424"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=6424"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}