{"id":6442,"date":"2019-05-10T06:00:00","date_gmt":"2019-05-10T05:00:00","guid":{"rendered":"https:\/\/amazingfba.com\/?p=6442"},"modified":"2020-05-13T05:58:17","modified_gmt":"2020-05-13T04:58:17","slug":"324-time-management-for-e-commerce-habit-3-from-7-habits-series","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/","title":{"rendered":"#324 Time Management for e-commerce (Habit 3 from “7 Habits” series)"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F324.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F324-time-management-for-e-commerce-habit-3-from-7-habits-series%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/324.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6442-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/324.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"324.mp3\">Download<\/a> (Duration: 41:52 &#8212; 28.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><h1 class=\"p3\"><b>Time Management for e-commerce &#8211; wisdom from Steven Covey <\/b><\/h1>\n<h2><b>Habit 3:  First Things First <\/b><\/h2>\n<p>Time Management for e-commerce is an absolutely critical skill area. Time management can be the single biggest block to even starting an e-commerce business. And for an established, busy e-commerce business owner,  managing time is just as critical.<\/p>\n<p>In this episode, we focus on the learnings from  the wonderful book (and also audio book) &#8211;<\/p>\n<p>&#8220;7 Habits of Highly Effective People&#8221; by Steven Covey<\/p>\n<p><!--more--><\/p>\n<h2 class=\"p2\"><strong>Links to related podcast episodes\/show notes around self management for e-commerce entrepreneurs:<\/strong><\/h2>\n<p class=\"p2\">For the other episodes related to time management for e-commerce and based on this book and philosophy:<\/p>\n<p class=\"p5\"><a href=\"https:\/\/amazingfba.com\/283-mindset-part-2-inside-out-strategic-entrepreneurship\/\">Inside Out (episode 283)<\/a><\/p>\n<p class=\"p5\"><a href=\"https:\/\/amazingfba.com\/284-proactive-mindset\/\">Habit 1: Be Proactive (episode 284)<\/a><\/p>\n<p class=\"p5\"><a href=\"https:\/\/amazingfba.com\/298-goal-setting-for-amazon-sellers\/\">Habit 2: Begin with the End in Mind<\/a><span class=\"s2\"> (episode 298)<\/span><\/p>\n<h3 class=\"p1\"><b>Habit 3: Put First Things First<\/b><\/h3>\n<h3 class=\"p3\"><b>Productivity Question [for Time Management]<\/b><\/h3>\n<p class=\"p2\">“What one thing could you do (something you aren’t doing now) that, if you did it on a regular basis, would make a tremendous positive difference in… your work life?”<\/p>\n<p class=\"p2\">(Quotations from Covey, Stephen R.. The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change (p. 155). RosettaBooks. Kindle Edition)<\/p>\n<h3 class=\"p3\"><b>[What is habit 3?] [Time Management]<\/b><\/h3>\n<p class=\"p2\">&#8220;Habit 3 [time management] is the… practical fulfillment of Habits 1 and 2. Habit 1 says, “You’re the creator. You are in charge.” It’s based on the four unique human endowments of <b>imagination<\/b>, <b>conscience<\/b>, independent <b>will<\/b>, and, particularly, self-<b>awareness<\/b>.<\/p>\n<p class=\"p2\">“I don’t like that ineffective [internal] script. I can change.”<\/p>\n<p class=\"p2\">&#8220;Habit 2 is the<b> first or mental creation<\/b>.<\/p>\n<p class=\"p2\">It’s based on <b>imagination<\/b>—the ability&#8230;to create with our minds what we cannot at present see with our eyes;<\/p>\n<p class=\"p2\">and <b>conscience<\/b>—&#8230;our own&#8230; personal, moral, and ethical guidelines&#8230;”<\/p>\n<p class=\"p2\">Habit 3, then, is <b>the second creation, the physical creation.<\/b><\/p>\n<p class=\"p2\">It’s the fulfillment…the natural emergence of Habits 1 and 2.<\/p>\n<p class=\"p2\">It’s the exercise of independent <b>will<\/b>…<\/p>\n<p class=\"p2\">It’s the day-in, day-out… <b>doing<\/b> it.<\/p>\n<p>In traditional language &#8211; time management.<\/p>\n<p class=\"p2\">Habits 1 and 2 are absolutely essential and prerequisite to Habit 3.<\/p>\n<p class=\"p2\">[Habit 1]<\/p>\n<p class=\"p2\">You can’t become principle-centered without first being aware of and developing your own <b>proactive<\/b> nature.<\/p>\n<p class=\"p2\">You can’t become principle-centered without first being <b>aware of your paradigms<\/b> and understanding how to <b>shift them<\/b> and <b>align them with principles.<\/b><\/p>\n<p class=\"p2\">[Habit 2]<\/p>\n<p class=\"p2\">You can’t become principle-centered without a <b>vision<\/b> of…on the unique contribution that is yours to make.<\/p>\n<p class=\"p2\">[Habit 3]<\/p>\n<p class=\"p2\">But with that foundation, you can become principle-centered&#8230;by practicing effective <b>self-management.<\/b><\/p>\n<p class=\"p2\">[traditionally known as &#8220;time management&#8221;]<\/p>\n<p class=\"p2\">…[then] the ability to manage well determines the quality and even the existence of the second creation.<\/p>\n<p class=\"p2\"><b>“[Time] Management is&#8230;the analysis, the sequencing,&#8230; the time-bound left-brain aspect of effective self-government.“<\/b><\/p>\n<p class=\"p2\">“<b><i>Manage from the left; lead from the right.”<\/i><\/b><\/p>\n<h2 class=\"p3\"><b>The power of independent will<\/b><\/h2>\n<p class=\"p2\">It is&#8230;<b>independent will<\/b>—that really makes effective self-management possible.<\/p>\n<p class=\"p2\">“… it’s usually not the dramatic&#8230;the once-in-a-lifetime&#8230; effort that brings enduring success. <b>Empowerment comes from learning how to use this great endowment in the decisions we make every day.”<\/b><\/p>\n<p class=\"p2\">“<b>Effective [time] management is putting first things first. While leadership decides what “first things” are, it is management that puts them first, day-by-day, moment-by-moment. Management is discipline, carrying it out.”<\/b><\/p>\n<h2 class=\"p3\"><b>4 Generations of time management [for e-commerce]<\/b><\/h2>\n<p class=\"p2\">Gen 1: Checklists, notes<\/p>\n<p class=\"p2\">Gen 2: Calendars and appointments<\/p>\n<p class=\"p2\">Gen3: prioritisation, clarifying values.<\/p>\n<p class=\"p2\">Also <b>goals<\/b> &#8211; goals—specific long-, intermediate-, and short-term targets&#8230; in harmony with values.<\/p>\n<p class=\"p2\">“It also includes the concept of <b>daily<\/b> planning&#8230;those goals&#8230; of greatest worth.<\/p>\n<p class=\"p2\">“While the third generation of time management has made a significant contribution, people have begun to realize that “<b>efficient<\/b>” scheduling and control of time are often counterproductive.<\/p>\n<p class=\"p2\">“The<i> <\/i><b><i>efficiency focus<\/i><\/b> creates expectations that clash with&#8230;rich relationships,&#8230; human needs, and&#8230; spontaneous moments&#8230;As a result, many people have become turned off by time management programs and planners.”<\/p>\n<h2 class=\"p1\"><b>Time management [for e-commerce matrix &#8211; &#8220;Eisenhower Matrix&#8221;] <\/b><\/h2>\n<p class=\"p3\">The two factors that define an activity are “urgent” and “important”<\/p>\n<p class=\"p3\"><b>Urgent<\/b> means it requires immediate attention.<\/p>\n<p class=\"p3\">Urgent things act on us.<\/p>\n<p class=\"p2\"><b>Importance<\/b>, on the other hand, has to do with <b>results<\/b>..it contributes to your mission…priority goals.<\/p>\n<p class=\"p2\">“We <b>react<\/b> to urgent matters. Important matters that are not urgent require more <b>initiative<\/b>, more <b>proactivity<\/b>. “<\/p>\n<p class=\"p2\"><b>“If&#8230; we don’t have a clear idea of what is important, of the results we desire in our lives, we are easily diverted into responding to the urgent.”<\/b><\/p>\n<h3 class=\"p3\"><b>Quadrant I [urgent AND important] <\/b><\/h3>\n<p class=\"p2\">Quadrant I deals with significant results that require immediate attention.<\/p>\n<p class=\"p2\">We usually call the activities in Quadrant I “<b>crises<\/b>” or “problems.”<\/p>\n<p class=\"p2\">We all have some Quadrant I activities in our lives. But Quadrant I consumes many people. They are <b>crisis managers,<\/b> problem-minded people, <b>deadline-driven producer<\/b>s.<\/p>\n<p class=\"p2\">As long as you <b>focus<\/b> on Quadrant I, it keeps getting bigger and bigger until it dominates you.<\/p>\n<h3 class=\"p3\"><b>Quadrant III [urgent but NOT important]<\/b><\/h3>\n<p class=\"p2\">There are other people who spend a great deal of time in “urgent, but not important” Quadrant III, thinking they’re in Quadrant I.<\/p>\n<p class=\"p2\">They spend most of their time reacting to things that are urgent, assuming they are also important. But <b>the reality is that the urgency of these matters is often based on the priorities and expectations of others.<\/b><\/p>\n<h3 class=\"p3\"><b>Quadrant IV [non urgent AND not important] <\/b><\/h3>\n<p class=\"p2\"><b>People who spend time almost exclusively in Quadrants III and IV basically lead irresponsible lives.<\/b><\/p>\n<p class=\"p2\">Effective people stay out of Quadrants III and IV because, urgent or not, they <b>aren’t<\/b> <b>important<\/b>.<\/p>\n<p class=\"p2\">They also shrink Quadrant I down to size by spending more time in Quadrant II.<\/p>\n<h3 class=\"p3\"><b>Quadrant II [non urgent but Important] <\/b><\/h3>\n<p class=\"p2\">Quadrant II is the heart of effective personal management. It deals with things that are <b>not urgent, but are important.<\/b><\/p>\n<p class=\"p2\">It deals with things like <b>building relationships<\/b>, writing a personal mission statement, <b>long-range planning, exercising, preventive maintenance, preparation<\/b>—all those things we know we need t  o do, but somehow seldom get around to doing, because they aren’t urgent.<\/p>\n<p class=\"p2\">“To paraphrase Peter Drucker, effective people are not problem-minded; they’re <b>opportunity-minded<\/b>. They feed opportunities and starve problems. They think preventively.”<\/p>\n<h3 class=\"p2\">Quotations from:<\/h3>\n<p class=\"p2\">Covey, Stephen R.. <i>The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change<\/i> (pp. 188-189). RosettaBooks. Kindle Edition.<\/p>\n<h2>Transcript<\/h2>\n<p>0:02<br \/>\nHello ladles and jelly spoons Welcome to amazing FBA. This is your host Michael vz. Welcome back to the show. Today we are talking mindset as part of a not even as serious but a whole section of the podcast devoted to this topic because I just think it&#8217;s so critical particularly for people who were in the early phases of their journey in creating a an Amazon based business and e commerce business or for that matter, any business really, but particularly it was based online because there&#8217;s a lot of isolation that goes with that a group TELUS self awareness, self searching and self discipline is needed compared to the sort of usual activities and in a an office where you can probably get away with, you know, being very unproductive and get somewhere because you&#8217;re surrounded by people making you do stuff all day. That is not the case, when you&#8217;re self employed to start with an every small business person starts off as self employed before they employ others. So one of the things we are looking at today is time management of the main thing we&#8217;re looking at. These insights are from the book of Stephen Covey&#8217;s book, The Seven Habits of Highly Effective People been around for about a generation or two since about the early 80s. Roughly, I came across it in the 90s. I think so I&#8217;ve been reading it on and off for about 20 years. And I have to say, has it made me rich, no book makes you rich if you don&#8217;t implement it. But so so far as I have had any successes, I look back on this book, and realize I have followed what it says and insofar as things don&#8217;t go well is because I&#8217;m drifting away from the principles in this book, I think his excellent book, very, very strong set of principles for living if you lie that sounds a bit over the top. I don&#8217;t think it matters I excellent certainly for business. And he&#8217;s he did a lot of work with businesses, coaching businesses and improving businesses in his lifetime. So very much worth checking out for the other episode is based around this book, go to Episode 283. For inside out, which is one basic paradigm, which is covers favorite word for patterns of looking at things really a lens through which you look at the world and life really and inside out very, very important. Really the idea that we the way we see the problem is the problem. That&#8217;s the the summary of it. That&#8217;s Episode 283 have it one be proactive. In other words, you take responsibility for deciding what your life is, and what it&#8217;s about. And if you don&#8217;t like how it is change it if you don&#8217;t like your habits of thought, change those as well. And that&#8217;s a very powerful and very important, basic precursor to everything else. And that&#8217;s Episode 284. Have it to begin with the end in mind. It&#8217;s Episode 298, which is basically about having a vision having a clear goal, bigger than a goal, I think like what do you want your life to be about what you want your work to be about? And equally, what do you want your business to be about? And that&#8217;s, I think, a very important question that a lot of people kind of skipped over when it comes to creating their own business. So having done all of that, then we come to habits three. And by the way, if you want to get show notes from this episode, go to amazing fba.com forward slash three to four, Episode 324. This is the episode we&#8217;re in. And that&#8217;s where you&#8217;ll find the detailed notes quite a lot of quotes from the covey book, habit three put First things first, which is basically after the habit of productivity. In other words, you know, creating your own life and your own ways of doing things and seeing things and then having a vision. It&#8217;s okay, how do I implement that vision? So daily and weekly time management, task management, those kinds of words really kind of sum it up. So to start with them one question covey puts us at the beginning of this part of the book is a really critical and excellent question, which is this? What one thing could you do something you aren&#8217;t doing now that if you did it on a regular basis would make a tremendous positive difference in your life in your work life, shall we say for the purposes of this? What one thing? Could you do something you&#8217;re not doing now that if you did it on a regular basis, would make a tremendous positive difference in your work life? really excellent question. By the way, very similar to the one thing book and the question that is asked in that&#8217;s not quite the same thing. What I like about covey is that there&#8217;s an overall philosophy of life based on rate deliver reviews of success literature, if you like. So to be taken with a pinch of salt, like anything else. Like I say, the reason that I&#8217;m coming back to this and doing an episode about this for business, is because I find it isn&#8217;t just theory, I think it&#8217;s an excellent framework that we&#8217;re relates very strongly to those people who do well in business. And equally, the absence of it relates to my failures or things that haven&#8217;t gone as well as they can, and also the clients I&#8217;ve worked with who have struggled. So I think it&#8217;s quite an accurate representation of good habits of entrepreneurs, for that reason that I dare to bring it up in an otherwise businesslike podcast. So very, very good question. There&#8217;s one thing to know what you should be doing. The other thing that of course, is to actually do it right. So what is habit three, habit three is the personal fruit, the practical fulfillment of habits one and two. So habit, one which is be productive, is says, You&#8217;re the Creator, you are in charge. And there was no more important thought, I think, than that for an entrepreneur habits. One is based on the four unique human endowments, as covey puts it, of imagination, conscience will and self awareness. So if you lack imagination, if you lack confidence, you&#8217;re going to be a monster, you might make money, but you will cause a lot of harm. If you like, well, you&#8217;re never going to do anything. If you&#8217;re not self aware, which is another thing that is less prevalent, perhaps amongst entrepreneurs, you&#8217;re going to become a monster as well, I think eventually. So those are all important things have it to then comes after that, which is the first or the mental creation based on imagination, the ability to create with our minds what we cannot see yet with our eyes, which is really, really important for people in the early stages of business building, where you don&#8217;t yet have any kind of concrete proof that you&#8217;ve got anything real going. It just exists in your imagination. There&#8217;s also conscience your own personal moral kind of guidelines as well.<\/p>\n<p>7:37<br \/>\nHabits three, that is the second creation, the physical creation, and that&#8217;s the fulfillment, the natural emergence of habits one and two, the exercise of independent will is the day to day moment by moment doing. However, having said that, habit one and two are absolutely essential and a prerequisite to habit three, habit one, the be proactive, you can&#8217;t be principal center without being aware of and developing your own proactive nature. In other words, if you think you&#8217;re just at the mercy of your life, you&#8217;re never going to start a business. I can&#8217;t, I haven&#8217;t got enough time. I don&#8217;t have enough money. My family&#8217;s too busy. My wife won&#8217;t let me whatever other excuses people make for themselves, understandable individually, but Taken together, they lead to a life of being reactive to other people and circumstances, rather than deciding what&#8217;s important. And this getting on with it. To put it very simply. This is more Michael easier than Stephen Covey, by the way, Stephen Covey says you can&#8217;t become principal center without being aware of your paradigms, understanding how to shift them, how to align them with principles. So that&#8217;s all habit one stuff to go back and listen to that episode. But just to summarize it paradigms is his fancy word for the way you look at things are patterns of behavior, patterns of thinking, the unit, become aware of those understand how to shift them and align them with principles, for example, honesty, integrity, you know, acting as you speak, and speaking as you x, for example, that kind of thing, right? And it sounds, it sounds like I&#8217;m one hand if you&#8217;re feeling cynical, and reaction to this, I hear you, it sounds like one of those things that people say that&#8217;s easy to say, but hard to do, or just blindingly obvious. And both of those may be true, but that doesn&#8217;t mean it&#8217;s not accurate. I think a lot of people, for example, have limiting beliefs around money, and that definitely includes me. And that&#8217;s something we have to just work hard to deconstruct because you&#8217;re never going to get rich. For example, if you believe that rich people are sons of BS or you know, nasty swear words, horrible people. Why on earth would you be comfortable with getting rich? And the answer is you&#8217;re not going to be you&#8217;re going to unconsciously sabotage yourself. So I&#8217;m not going to get into that in great depth here. But just suffice it to say, that really is critical and limiting beliefs come even amongst very aware people very high achievers in the 10 k collective mastermind, people who are doing things like building it from scratch, in two years, a business that does 500,000 pounds a year and it is on track to do a million, that kind of person still has the limiting beliefs about for example, the worth of their business, they built their ability to build a 10 minute impound business, or 100 million pound business. at any level, you can find limiting beliefs, and you need to find ways to shift them. So I can&#8217;t stress enough how true I&#8217;ve found that to be. So that&#8217;s habit one, as a precursor to habit three, habit two is you can&#8217;t become principal center without a vision, and a focus on the unique contribution that is yours to make. And again, that really is so important on that other company or business wide level, you can&#8217;t become a really serious business, I think without a vision of what your business can contribute. Jim Collins, in one of his books, I think it&#8217;s good to great says, Well, if you&#8217;ve got a really great company, you&#8217;ll know it. Because if your business disappeared from the landscape, there would be a whole people would miss it, there would be something missing that was there before. So that&#8217;s an incredibly important thing to think about for you personally for your life. And your business fits into your life, I believe not the other way around. I don&#8217;t believe in trashing your entire relationships and your health on the altar of business success. Many people have done that, and mostly live to regret, even famously, people like Steve Jobs at the end of his life. But for your business, as well, you&#8217;ve got to have an idea of what is the vision, what is the unique contribution that your business is going to make to the world. And don&#8217;t, you know, don&#8217;t get me wrong, I&#8217;m not saying you should spend hours of your life spending thinking too much about this without taking action if you have no business yet. But as you&#8217;re developing become, if you develop a real business, and it gets into action and starts to run day to day without so much of your input, I think it&#8217;s absolutely critical at that stage to think about what your business really represents the planet, if it&#8217;s just somebody else to selling widgets from China, because they&#8217;re cheap, guess what, there&#8217;s no much future to that business, in my humble opinion. So then we&#8217;ve got habits one and two, proceed, how it&#8217;s free, I spending quite a bit of time recapping those because I just think is absolutely critical that you are a person that self aware and try to shift limiting beliefs and see the world in a helpful way and be proactive, not reactive, that&#8217;s critical. You&#8217;ve also got to have a vision and you got to refine both of those things. I think every you&#8217;ve got to realign yourself with your vision, you&#8217;ve got to remind yourself, if you don&#8217;t like how things are in your business, in your industry in your life, that&#8217;s up to you to do what you can to change it. I mean, there&#8217;s some things out of your control, just let go those focus on the things that are in your control. And covey talks about a circle of concern, circle of influence, very important to revisit that as well. And habit one. So then habits three, first things first, daily action, how does that work with the foundation of habits one and two, you can become principle centered by practicing effective self management, then the ability to manage well determines the quality and even the existence of the second creation, as cubby calls it. In other words, making your vision real make it physical, making money apart from anything else. Management, he says is the analysis the sequencing, the time bound left brain aspects of effective self government and copy simple summary is this manage from the left lead from the right and otherwise, you&#8217;re talking about the traditional division or the division that was very popular 70s and 80s, between the left and right hemispheres of the brain. In fact, recent neuroscience I understand has said this is a little bit simplistic, but it&#8217;s not a bad metaphor, it doesn&#8217;t matter if it&#8217;s physically true or not. It&#8217;s a way of looking at things that is helpful. So left brain is about sequencing, the logical, analytical thinking right brain is holistic, perhaps more emotional. And that&#8217;s where he says you lead from and I think just makes a lot of sense to me. And you&#8217;ll find within your businesses as well, if you have business partners, or a team, that some people are more visionary and not so good with details. And some people are great with details, but need that that sense of direction and leadership from somebody else very common. And good business partnerships often work by combining people who tend to focus on one or the other. For example, Steve Jobs, when he got back to Apple after the the he was kicked out of those, the apple grew very well and then went backwards for years. And then Steve Jobs came back on board, one of the first things he did was hire Tim Cook, the current CEO, because Jobs was a new, he was a visionary and a creative person. But he knew that he didn&#8217;t have the strength in supply chain management and the nuts and bolts to make the mechanics and the economics of Apple work. So he hired Tim Cook, who is an expert in supply chain management. And it&#8217;s also interesting, just as a side note to reflect, okay, now that Steve Jobs is gone, and Tim Cook is an expert in that area and is running Apple, How much longer will it keep going? How successful will it be as a creative company quite invested in that question, because I have a MacBook, and I&#8217;ve had one for 10 years, and I&#8217;ve got an iPhone as well. So I was a personal user of Mac products. We will see in so far that they they&#8217;re good at making money right now. Are they good at creativity and vision and long term thinking? Let&#8217;s see how that goes out. So back to Covey&#8217;s book, then the power of independent will it is, as he says independent will that really makes effective self management possible. And is not usually the dramatic once in a lifetime effort that brings in during success. Empowerment says covey comes from learning how to use this great endowment in the decisions we make every day. effective management is putting First things first was leadership decides what first things are. Its management that person first day by day, moment by moment management is discipline, carrying it out. And that&#8217;s absolutely true. And one of the great problems that we will fall into as digital based entrepreneurs is that we have several things against us. First of all, if you don&#8217;t have any business yet, and you&#8217;re just starting out doing research, working on your own, you&#8217;re isolated, and you don&#8217;t have any physical proof whatsoever that anything works yet because you don&#8217;t have any turnover. You don&#8217;t even have products, you don&#8217;t have customers. And you don&#8217;t have a social interaction with a colleague or a boss or even your business partner if you&#8217;re working virtually or if you don&#8217;t have a business partner. And that&#8217;s a terrible problem. So I do think at that stage of the game is absolutely critical. I think in all states the game you benefit but that says it&#8217;s critical. Defined somebody can work with isolation is a dream killer. And I think is Barbara share who said that I cannot say how strongly I think that&#8217;s true. Even really experienced as an entrepreneur, you spend too much time on their computers get miserable. I know a few of them. And they&#8217;re doing very well. They&#8217;re making millions a year sometimes, but they&#8217;re still not happy. They&#8217;re not interacting with other people. So never forget that even connect. Isolation is a dream killer. So the solution is connection, connection to the right people being the only caveat if you listen to too many podcasts, join too many random Facebook groups. I mean, obviously you&#8217;re welcome to listen to this. And I hope I&#8217;m trying to help you and and the Facebook group, by the way, is also a place that you can go and get some questions answered if you have them amazing fba.com forward slash FB, Fs and Facebook is in book. Having said that, though, if you are really struggling, I would suggest you need to get yourself a good coach. If you think I could be that person, I&#8217;d be delighted to discuss that with you. I&#8217;m not going to do a heavy sales pitch, I&#8217;ve got limited time. But most importantly, I refuse to work with somebody, if I don&#8217;t think I can get them ready to turn on investment. I can&#8217;t promise that you&#8217;re going to get it if you don&#8217;t do the work. But I do my best to pick people who are going to benefit. So if I turn you away, don&#8217;t take it personally, it&#8217;s because I want to make sure I don&#8217;t waste your time and money. So if you want to explore that amazing sba.com forward slash mentoring me n tr i n g. So back to the independent will it&#8217;s absolutely critical that you carry stuff out every day, it&#8217;s very hard to be accountable to yourself only. That&#8217;s the only caveat I would make.<\/p>\n<p>17:28<br \/>\nSo since we&#8217;re talking about time management in some ways, or at least what&#8217;s traditionally called time management, covey talks about four generations of time management, generation. One is checklist notes, everybody has those, I guess we all use those. And it&#8217;s very traditional to sit there with a less we&#8217;ve all done it. I&#8217;ve done it recently, some times where you make an undifferentiated list of 15 things and try and get through as many of those as you can for the day, somewhat depressing anomaly fine, because you can often find either you nearly always I make a list for the day. It&#8217;s ludicrous. I&#8217;m so ambitious about how I can achieve for the day, maybe it&#8217;s just me that I&#8217;m not the only person, I think from experience that does something like that. The one alternative is that instead of not doing most of it, you get it done. And you still don&#8217;t feel like your businesses move forward. When you look back over the week, the month the year. That&#8217;s really depressing. So that&#8217;s not enough in itself. Generation two says covey is calendars and appointments, obviously putting things in their calendar makes it much more likely that&#8217;s going to happen. Again, caveat much more likely, if somebody else is involved. If you&#8217;ve got to have a call with a business partner, or a coach, or an online coaching community, I just think you&#8217;re more likely to turn up and if it&#8217;s just an appointment with yourself, those are harder points to keep in my experience, right. And then generation three, whole bunch more advanced than eyes prioritization is included in that in other words, some things are more important than others clarify values as well, what&#8217;s really important, what is less important. And then goal setting as well, long, the intermediate and short term targets which we have values. And it also includes the concept of daily planning around those goals are the greatest worth. That sounds great. So how come that isn&#8217;t enough? A lot of us will be pleased to get to that point where we schedule everything rigidly. But guess what, as Kevin says, while the third generation has made a significant contribution, people began to realize that efficient schedule scheduling or scheduling and control of time are often counterproductive. The efficiency focus creates expectations that class with rich relationships, human needs and spontaneous moments. As a result, many people have become turned off by the time management programs and planets. And that&#8217;s really very true. And I&#8217;ve gone through phases like I think most people have themselves are trying just about everything. There&#8217;s Dave Allen&#8217;s getting things done books as managing free creative people a book that it&#8217;s actually quite an interesting book that I may do a review on at some point, which is not very famous, the non bs series from Dan Kennedy who I quite like because he is an OBS person and an entrepreneur himself, and a great marketer. But in the end, all these approaches are just a bit too rigid for me and I tend to shy away from them. So we need a different way of doing things which will come to later. First of all, let&#8217;s look at another very basic concept, which is still very, very helpful. This is the time management matrix, I believe originally created by or popularized by Eisenhower, who was of course a hyper successful man in the sense that he was a general, the United States in the Second World War. And then of course, the president as well, as was called so very great personal to learn from the two factors in this tip time management matrix, which is a two by two matrix. So four quadrants four little squares within a bigger square or rectangle. The two factors that define an activity are urgent and important. So if you imagine a two by two grid, and you&#8217;ve got important across the top and urgent at the left hand column of the two columns, and then important is a top of two rows. And if you were to write on a piece of paper, urgent means it requires immediate action and urgent things, by the way, acts upon us so we we react to them. Whereas important things, on the other hand, have to do with results. It contributes to your mission, your values are high priority goals. And those are things that we have to be much more productive to achieve. In other words, we need to make a conscious decision and stick to it in the face of other pressures of we react to urgent matters. But important matters do not require urgent don&#8217;t have sorry, that urgency, they require more initiative. If we don&#8217;t have a clear idea of what is important of the results, we design our lives, we are easily diverted into responding to the urgent, I think that&#8217;s absolutely critical. I find that so so, so true. If I don&#8217;t have a clear mission that I&#8217;m on, and reconnect to that mission, I mean, emotionally connect, and in sort of general feelings, even physically energize myself, then it no good, it&#8217;s just not going to happen, you&#8217;re going to find that other things push you around. And that&#8217;s again, so so much the pattern that I see with clients who or people who reach out to me that they make intentions, the road to hell is this is paved with good intentions I could have been written for the would be entrepreneur I, myself included many times. So I&#8217;m not being Holly and now about this, I&#8217;m know many people are more productive than me. But I managed to keep myself in action by having a business coach by having communities by being accountable to my clients by being accountable to the customers who buy Amazon products, etc, etc. In other words, getting into motion is hard. Staying emotion is easier, but I just think the most important thing in the world is to make a decision about what is important to you. And to stick to that, like glue, you may actually change your mind later on about what&#8217;s important. But if you don&#8217;t stick to it for a certain amount of time enough to get some progress, or at least test the idea, then you&#8217;re not going to get anywhere and that there&#8217;s another phrase that springs to mind is strong convictions lightly held, is perfect for business. So in other words, for six months, a year, two years, whatever time period you give it, you need to be very one track about getting your business off the ground, with the understanding as well that if something doesn&#8217;t work, you give it a certain pit time period, or a certain amount of money. And Seth Godin talks about this as low, it doesn&#8217;t matter whether you give it a year or 10 years or six months, whether it&#8217;s $1,000, or a million or $10 million, give it that amount of time and or money. And once you&#8217;ve done that, stop and reevaluate. And if it&#8217;s not working, just kill it as another famous person.<\/p>\n<p>23:34<br \/>\nKevin, the guy from Dragon&#8217;s Den and Shark Tank whose name escapes me, Mr. Wonderful says if your business isn&#8217;t making a profit by year three, take it behind the shed and shoot it in his usual abrupt manner. I wish I could remember second name. Sorry, Kevin. But you got the idea. So I think there is something in that. So it&#8217;s very, very difficult that because on the one hand, you have to commit very, very strongly, and on the other hand, qubit needs to be willing to let go, I think what kills people is that halfway house, if you have doubts, during your six month period, or your one year period, if you&#8217;re not committed, do you&#8217;re never going to get anywhere guaranteed. On the other hand, if you commit something for four years, and it&#8217;s not making any profits, you probably just denying reality as well. So very tricky, in a way that thing. But I would say you can square that circle, very simply just be very, very committed to a medium term, go give yourself six months or a year, go like crazy at it and then review. And if it looks like it&#8217;s not producing any results, you&#8217;ll know, you&#8217;ll probably want to give up anyway. So you will. But what I would say is don&#8217;t give up, you know, after three months, or something when things aren&#8217;t working, because it takes about a year to get most private label businesses off the ground in between day jobs and doing your back and forth to China, Chinese New Year, things that work perfectly, etc, etc, right. But you certainly can do it quicker than that for sure. But if you go in with the expectation that you need to tough it out for a year, then and put things in place, community of people like preferably a physical community, get some trees training, have a coach, you&#8217;re going to be much more likely to succeed, then if you just drift along for a bit and then give up when nothing&#8217;s happening on the course nothing&#8217;s happening to start with him done anything yet, you know, coming back to the time management quite major. So went off on on one day. So what I&#8217;m trying to do really is pull across Stephen Covey&#8217;s ideas and link them as intimately as I can to the business we&#8217;re in. And they&#8217;re trying to get started with an e commerce business in many cases, or, in some cases, trying to expand an existing e commerce business. So the time management matrix consists of four quadrants of four little squares within a big one. quadrant one is urgent and important. It deals with significant results that require immediate attention. And we usually call the things they&#8217;re crises or problems or crisis is probably good word for it. We all have some crises in our lives, but quadrant one consumes that many people, they are the crisis managers, problem minded people and deadline driven producers. And as long as you focus on project one, it keeps getting bigger and bigger and till it dominates you. And I am often guilty of this kind of thing. I mean, if it&#8217;s going to be tax, for example, I often get near the deadline, I&#8217;m not the only one, I know that whether it&#8217;s corporate tax, my own personal tax returns, if I have to produce a podcast, then I do it when the deadlines coming up sometimes, which is very poor. But that&#8217;s at least I&#8217;m getting it done because I put a framework. But nevertheless, I mean, one of the things I suppose like, in my defense, I get the podcast done, because I believe it&#8217;s part of my mission to help educate people and to spread the ability to have independent, wealthy lives. And that is something I believe in and trying to live that life and to help other people to live it, that that was a productive thing to start the podcast. But then I in a way, I have the luxury of being reactive because now I have an audience I&#8217;m accountable to So once again, a win for accountability, right? quadrant three, urgent but not important. There are other people who spend a lot of time in urgent not important ones in quadrant three, thinking they&#8217;re in quadrant one. In other words, they think things are urgent, therefore they&#8217;re important. They&#8217;re not the same. Reality is the urgency of matters is often based on the priorities and expectations of others. So somebody might think it&#8217;s very important that you answer that email, asking how to, you know, make some money with something or to solve a problem or customer service problem, or to complain about something and that you respond or to invoice you for some services they provided you. And I&#8217;m not saying you shouldn&#8217;t respond to those things. But if all you do is respond to those things, or you do them first in the day, you&#8217;re in trouble and checking email first thing in the morning is the classic, classic bad habit with that. I mean, that&#8217;s something that Tim Ferriss was very big on in the four hour workweek. Another excellent book, but just a different take on a lot of the same topics really, but but quite a lot of similar conclusions. The classic thing would be do not start your day with email. That&#8217;s easier to do for all of us. But one of the other things is do not start your day by checking Facebook, which I actually did today. I very rarely do that. To be fair to myself, it put me in a terrible mood because I could see people that I thought were mediocre, succeeding, because going on about politics I disagreed with. And the rest of it was just kind of largely a waste of time or people showing how rich they were. And you know, why am I feeling like I&#8217;m not succeeding like that. It&#8217;s just a terrible idea. So that&#8217;s even worse. project for is non urgent and not important. People who spend a lot of time exclusively in quadrant three, that&#8217;s the urgent but not important. And quadrant four neither important or urgent, lead irresponsible lives. Effective people stay out of quadrant three and four, because urgent or not, they are not important. They also shrink quadrant one downsize by spending more time in quadrant two. In other words, being proactive. We&#8217;ll talk about that in a second. But one of the things I want to talk about is why we end up in quadrant four, why was I checking Facebook? Why do I end up watching YouTube videos when I could be working? Why do I end up goofing off or going for a snooze when I should be working well as because we feel overwhelmed. And I think a lot of the time we feel overwhelmed. It&#8217;s because we are allowing the size of a task to seem to begin our minds. And instead of that, we need to think about this habit one which is being proactive. If we have a way of thinking that&#8217;s not serving us, we need to change that. And one of the ways we need to change is when we&#8217;re not feeling so good, or we&#8217;re feeling a bit overwhelmed to believe that. Number one that bad mood dictates reality. How we feel is just how we feel it doesn&#8217;t mean that there&#8217;s an external reality to it. It just feels like today it&#8217;s been rainy, then it was sunny, though it was rainy. Again, now it&#8217;s sunny again, which is the weather today? Well, the truth is all of them. So don&#8217;t go outside when it rains. And when you&#8217;re feeling down, don&#8217;t start making decisions about your life. And this is just my personal take on it. Again, this isn&#8217;t Stephen Covey. The second thing I would say is, if you are trying to run some kind of time management or task management system, or you have to get 15 million things done or filled your day is a waste of time, then you need to really, really rethink because I would argue, one or two mission critical actions taken per day or even per week, we&#8217;ll drive things forward. I have some weeks long, grossly unproductive, frankly, but I still managed to move business forward, because the things that I do get done are effective. And I&#8217;m not suggesting that you have entire days that are ineffective, but that is if you feeling overwhelmed, it&#8217;s because you&#8217;re trying to be perfectionist and do everything perfectly, and you&#8217;re trying to do everything, instead of which do the right things and do the right things well enough, good or excellent is excellent, but you might as well start with good enough, right? Another quote springs to mind from an old business coach, my damn Bradbury, who got it from somewhere else, the imperfect action beats perfect in action, every time. So if you&#8217;re suffering from paralysis from just sort of perfectionism, then I would urge you to park that and just do one thing today that is going to move you forward, whether it be with your Amazon business or whatever other areas of your life. So coming back to quadrant two, this is the non urgent but important stuff. quadrant is the heart of effective personal management. It deals with things that aren&#8217;t urgent but are important to us with things like building relationships, writing a personal mission statement, long range plan, exercise, preventative maintenance, and preparation. All the things we knew we know we need to do but somehow so I didn&#8217;t get around to doing because they aren&#8217;t urgent. To paraphrase Peter Drucker, effective people are not problem minded, that opportunity minded, they feed opportunities are still problems, they think preventively. Before we go too much further, let me just reflect on this building relationships absolutely critical. My experience of success in business has been that relationships are right at the heart of it then on extra. Even in a product based business, you might think it&#8217;s all about the product. But it isn&#8217;t really I mean, the relationship between your product and the audience and relationship you have with a supplier, for example, are absolutely critical. Now the relationship with the supplier is based on volume. So there is a sort of chicken and egg thing here. You want to get a great relationship with a Chinese supplier. According to ash manga, who was talking about recently of iMac sourcing Hello, I&#8217;m interviewing for the 10 k collector podcast, the new podcast for advanced sellers will say to me like basically, it&#8217;s quite simple. If you want a great relationship with a Chinese seller, you need to buy a lot of stuff from them. Right But it&#8217;s chicken and egg isn&#8217;t it because if you have a reasonably decent working relationship to start with, you can get quality products out there because you understand how to communicate about problems, how to solve them. If you get good products out there, you got a good relationship with your customers. And then of course it starts a positive cycle. So relationships are right up there for me, preventative maintenance and preparation also very important preparation for a great launch for example, even if you&#8217;re just starting out with your first ever product, a lot of people just put something on their Amazon did wait for a week or two it does badly and then sometimes I&#8217;m lucky enough that they get in touch with me to help them relaunch their products. And at that point we can say Well okay, let&#8217;s that&#8217;s decent damage limitation, but much better to approach somebody before you launch your product. Or even before you source it and make sure a the product you&#8217;re sourcing is going to sell or there&#8217;s a decent probability of it. And be you have a plan in place for launch to do way better. A better planning will massively increase performance are those that Famous Five P&#8217;s are the six P&#8217;s of the British Army pee pee pee pee pee pee pee, which is prior preparation prevents poor performance, you can imagine the extra p for yourself what it stands for.<\/p>\n<p>33:13<br \/>\nSo the other thing to say is effective. People are not problem minded, that opportunity minded. That sounds like sort of somebody you love to hate, doesn&#8217;t it all these opportunity minded people guess what that doesn&#8217;t, that&#8217;s not a different species, it&#8217;s a decision. Some people are naturally more opportunity minded. For the rest of us, myself included. I&#8217;ve trained as a classical musician, they&#8217;re very perfectionist, they&#8217;re very into solving problems. So you have to retrain your brain to some extent to try and see opportunities rather than just problems. And that&#8217;s just a habit that you can work on, I promise you, it gets better with practice. Again, being around the right people having the right peer group is critical for that if you are surrounded by employees, who are trained just to solve problems, but not really look for opportunities, and are free to pursue them. If they see them indeed, then you need to get a new peer group. I&#8217;m not saying john, call your old friends. But I mean, you need to least hang around with people with the right mentality enough that some of it rubs off on you.<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n<h3><strong>Watch my discussion of Time Management for Ecommerce Entrepreneurs<\/strong><\/h3>\n<p>[video_page_section type=&#8221;youtube&#8221; position=&#8221;bottom&#8221; image=&#8221;&#8221; btn=&#8221;light&#8221; heading=&#8221;&#8221; subheading=&#8221;&#8221; cta=&#8221;&#8221; video_width=&#8221;1080&#8243; hide_related=&#8221;false&#8221; hide_logo=&#8221;false&#8221; hide_controls=&#8221;false&#8221; hide_title=&#8221;false&#8221; hide_fullscreen=&#8221;false&#8221;]https:\/\/www.youtube.com\/watch?v=m-Rpn8iyxdg&#038;feature=youtu.be[\/video_page_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F324.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F324-time-management-for-e-commerce-habit-3-from-7-habits-series%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/324.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6442-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/324.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"324.mp3\">Download<\/a> (Duration: 41:52 &#8212; 28.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 41:52 &#8212; 28.7MB)Subscribe: Spotify | Email | RSSTime Management for e-commerce &#8211; wisdom from Steven Covey  Habit 3:  First Things First Time Management for e-commerce is an absolutely critical skill area. Time management can be the single biggest block to even starting an e-commerce business. And for [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":6454,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1837],"tags":[1271,1853,1274,1275,1270,1272,1273,88],"class_list":["post-6442","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-starting-an-ecommerce-business","tag-7-habits","tag-amazing-fba-podcast","tag-covey","tag-first-things-first","tag-habit-3","tag-seven-habits","tag-steven-covey","tag-time-management","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>#324 Time Management for e-commerce (Habit 3 from “7 Habits” series)<\/title>\n<meta name=\"description\" content=\"Time management for e-commerce is even more vital than for offline business. Isolated behind a laptop, e-commerce entrepreneurs must master it. Here&#039;s how.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"#324 Time Management for e-commerce (Habit 3 from “7 Habits” series)\" \/>\n<meta property=\"og:description\" content=\"Time management for e-commerce is even more vital than for offline business. Isolated behind a laptop, e-commerce entrepreneurs must master it. Here&#039;s how.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-05-10T05:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-13T04:58:17+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/324-1.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"39 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"#324 Time Management for e-commerce (Habit 3 from “7 Habits” series)\",\"datePublished\":\"2019-05-10T05:00:00+00:00\",\"dateModified\":\"2020-05-13T04:58:17+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/\"},\"wordCount\":8092,\"commentCount\":1,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/324-1.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"7 habits\",\"Amazing FBA Podcast\",\"Covey\",\"First Things First\",\"Habit 3\",\"Seven Habits\",\"Steven Covey\",\"Time management\"],\"articleSection\":[\"Starting An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/\",\"url\":\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/\",\"name\":\"#324 Time Management for e-commerce (Habit 3 from “7 Habits” series)\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/324-1.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-05-10T05:00:00+00:00\",\"dateModified\":\"2020-05-13T04:58:17+00:00\",\"description\":\"Time management for e-commerce is even more vital than for offline business. Isolated behind a laptop, e-commerce entrepreneurs must master it. Here's how.\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/324-1.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/324-1.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"time management for e-commerce\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"#324 Time Management for e-commerce (Habit 3 from “7 Habits” series)\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"#324 Time Management for e-commerce (Habit 3 from “7 Habits” series)","description":"Time management for e-commerce is even more vital than for offline business. Isolated behind a laptop, e-commerce entrepreneurs must master it. Here's how.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/","og_locale":"en_GB","og_type":"article","og_title":"#324 Time Management for e-commerce (Habit 3 from “7 Habits” series)","og_description":"Time management for e-commerce is even more vital than for offline business. Isolated behind a laptop, e-commerce entrepreneurs must master it. Here's how.","og_url":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-05-10T05:00:00+00:00","article_modified_time":"2020-05-13T04:58:17+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/324-1.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"39 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"#324 Time Management for e-commerce (Habit 3 from “7 Habits” series)","datePublished":"2019-05-10T05:00:00+00:00","dateModified":"2020-05-13T04:58:17+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/"},"wordCount":8092,"commentCount":1,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/324-1.png?fit=1280%2C720&ssl=1","keywords":["7 habits","Amazing FBA Podcast","Covey","First Things First","Habit 3","Seven Habits","Steven Covey","Time management"],"articleSection":["Starting An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/","url":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/","name":"#324 Time Management for e-commerce (Habit 3 from “7 Habits” series)","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/324-1.png?fit=1280%2C720&ssl=1","datePublished":"2019-05-10T05:00:00+00:00","dateModified":"2020-05-13T04:58:17+00:00","description":"Time management for e-commerce is even more vital than for offline business. Isolated behind a laptop, e-commerce entrepreneurs must master it. Here's how.","breadcrumb":{"@id":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/324-1.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/324-1.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"time management for e-commerce"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"#324 Time Management for e-commerce (Habit 3 from “7 Habits” series)"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/324-1.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-1FU","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6442","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=6442"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6442\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6454"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=6442"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=6442"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=6442"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}