{"id":6450,"date":"2019-05-16T06:00:46","date_gmt":"2019-05-16T05:00:46","guid":{"rendered":"https:\/\/amazingfba.com\/?p=6450"},"modified":"2021-01-06T15:28:00","modified_gmt":"2021-01-06T14:28:00","slug":"326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/","title":{"rendered":"326 Habit 3: First Things First &#8211; time management for ecommerce entrepreneurs (part 2)"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F326.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/326.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6450-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/326.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"326.mp3\">Download<\/a> (Duration: 31:26 &#8212; 21.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Time Management for e-commerce is an absolutely critical skill area. <a href=\"https:\/\/www.projectmanager.com\/software\/time-management?msID=f0656242-ce5b-4386-b2a0-db84723a9594\" target=\"_blank\" rel=\"noopener noreferrer\">Time management<\/a> can be the single biggest block to even starting an e-commerce business. And for an established, busy e-commerce business owner,  managing time is just as critical.<\/p>\n<p>In this episode, we focus on the learnings from the wonderful book (and also audiobook) &#8211;<\/p>\n<p>&#8220;7 Habits of Highly Effective People&#8221; by Steven Covey<\/p>\n<p><!--more--><\/p>\n<h2 class=\"p2\"><strong>Links to related podcast episodes\/show notes around self-management for e-commerce entrepreneurs:<\/strong><\/h2>\n<p class=\"p2\">For the other episodes related to time management for e-commerce and based on this book and philosophy:<\/p>\n<p class=\"p5\"><a href=\"https:\/\/amazingfba.com\/324-time-management-for-e-commerce-habit-3-from-7-habits-series\/\" target=\"_blank\" rel=\"noopener noreferrer\">Habit 3 Part 1 ( episode 324)<\/a><\/p>\n<p class=\"p5\"><a href=\"https:\/\/amazingfba.com\/283-mindset-part-2-inside-out-strategic-entrepreneurship\/\">Inside Out (episode 283)<\/a><\/p>\n<p class=\"p5\"><a href=\"https:\/\/amazingfba.com\/284-proactive-mindset\/\">Habit 1: Be Proactive (episode 284)<\/a><\/p>\n<p class=\"p5\"><a href=\"https:\/\/amazingfba.com\/298-goal-setting-for-amazon-sellers\/\">Habit 2: Begin with the End in Mind<\/a><span class=\"s2\"> (episode 298)<\/span><\/p>\n<h3 class=\"p3\"><b>What it takes to say “No”<\/b><\/h3>\n<p class=\"p2\"><b>The only place to get time for Quadrant II in the beginning is from Quadrants III and IV. <\/b><\/p>\n<p class=\"p2\">You can’t ignore the urgent and important activities of Quadrant I, although it will shrink in size as you spend more time with <b>prevention<\/b> and <b>preparation<\/b> in Quadrant II.<\/p>\n<p class=\"p2\">You have to be proactive to work on Quadrant II because Quadrants I and III work on you.<\/p>\n<p class=\"p2\">To say “yes” to important Quadrant II priorities, you have to learn to say “no” to other activities, sometimes apparently urgent things.<\/p>\n<p class=\"p2\">Keep in mind that you are always saying “no” to something. If it isn’t to the apparent, urgent things in your life, it is probably to the more fundamental, highly important things.<\/p>\n<h2 class=\"p3\"><b>Moving into Quadrant II in <\/b>Time Management for e-commerce<\/h2>\n<p class=\"p2\">If Quadrant II activities are clearly the heart of effective personal management—the “first things” we need to put first—then how do we organize and execute around those things?<\/p>\n<p class=\"p2\">[A: You need to use the right generation of time management tools]<\/p>\n<h3 class=\"p1\"><b>The Quadrant II Tool<\/b><\/h3>\n<p class=\"p3\"><b>6 criteria: <\/b><\/p>\n<ol class=\"ol1\">\n<li class=\"li2\">Coherence<\/li>\n<li class=\"li2\">Balance<\/li>\n<li class=\"li2\">Quadrant II focus<\/li>\n<li class=\"li2\">A People Dimension<\/li>\n<li class=\"li2\">Flexibility<\/li>\n<li class=\"li2\">Portability<\/li>\n<\/ol>\n<h2 class=\"p1\"><b>Becoming a Quadrant II Self-Manager of time<\/b><\/h2>\n<p class=\"p3\"><b>4 key activities:<\/b><\/p>\n<p class=\"p3\"><b>Identify Roles<\/b><\/p>\n<p class=\"p2\">Examples<\/p>\n<p class=\"p2\">1. Individual<\/p>\n<p class=\"p2\">2. Spouse\/Parent<\/p>\n<p class=\"p2\">3. Manager New Products<\/p>\n<p class=\"p2\">4. Manager Research<\/p>\n<p class=\"p2\">5. Manager Staff Dev.<\/p>\n<p class=\"p2\">6. Manager Administration<\/p>\n<ol class=\"ol1\">\n<li class=\"li2\">CEO manager<\/li>\n<\/ol>\n<h3 class=\"p3\"><b>Select Goals before managing time<\/b><\/h3>\n<p class=\"p2\">“At least some of these goals should reflect Quadrant II activities. “<\/p>\n<p class=\"p2\">“Ideally, these weekly goals would be tied to the longer-term goals&#8230;”<\/p>\n<h3 class=\"p3\"><b>Focus on Weekly Time management and scheduling <\/b><\/h3>\n<p class=\"p2\">Translate each goal to a specific day of the week, either as a <b>priority <\/b>item or, even better, as a specific <b>appointment<\/b>.<\/p>\n<h3 class=\"p3\"><b>Adapt time management Daily<\/b><\/h3>\n<p class=\"p2\">“With Quadrant II weekly organizing, daily planning becomes more a function of daily adapting, of prioritizing activities and responding to unanticipated events, relationships, and experiences. “<\/p>\n<h2 class=\"p3\"><b>Living Habit 3<\/b><\/h2>\n<p class=\"p2\">“Returning once more to the computer metaphor, if Habit 1 says ‘You’re the programmer’ and Habit 2 says ‘Write the program,’ then Habit 3 says&#8230; ‘Run\/Live the program.’“<\/p>\n<p class=\"p2\">“And living it is primarily a function of our independent will&#8230; and <b>commitment<\/b>—not to short-term goals and schedules or to the <b>impulse of the moment<\/b>, but to the <b>correct principles<\/b> and our own<b> deepest values<\/b>&#8230;”<\/p>\n<h3 class=\"p3\"><b>Advances of the 4th Generation of time management<\/b><\/h3>\n<p class=\"p2\">“The fourth generation of self-management [&#8220;time management&#8221;] is more advanced than the third in five important ways.”<\/p>\n<ol class=\"ol1\">\n<li class=\"li2\"><b>principle<\/b>-centered&#8230;it empowers you to see your time in the context of what is <b>really important<\/b>&#8230;<\/li>\n<li class=\"li2\"><b>conscience<\/b>-directed. It [helps] you&#8230;to organize your life&#8230; in harmony with your deepest values. But it also gives you the freedom to peacefully <b>subordinate your schedule to higher values.<\/b><\/li>\n<li class=\"li2\">defines your <b>unique<\/b> mission, including <b>values and long-term goals<\/b>. This gives direction and purpose to the way you spend each day.<\/li>\n<li class=\"li2\">helps you <b>balance<\/b> your life by identifying roles, and by setting goals and scheduling activities in each key role every week<\/li>\n<li class=\"li2\">gives greater <b>context<\/b> through <b>weekly organizing<\/b> (with daily adaptation as needed), rising above the limiting perspective of a single day&#8230;<\/li>\n<\/ol>\n<p class=\"p2\">The practical thread running through all five of these advances is a primary focus on <b>relationships<\/b> and <b>results<\/b> and a secondary focus on <b>time<\/b>.<\/p>\n<h3 class=\"p3\"><b>The Quadrant II Paradigm<\/b><\/h3>\n<p class=\"p2\">The key to effective management of self, or of others\/\/\/is not in any <b>technique<\/b> or <b>tool<\/b> or extrinsic factor.<\/p>\n<p class=\"p2\">It is intrinsic—in the <b>Quadrant II paradigm<\/b> that empowers you to see through the <b>lens of importance rather than urgency.<\/b><\/p>\n<p class=\"p2\">Interestingly, every one of the Seven Habits is in Quadrant II.<\/p>\n<p class=\"p2\">Every one deals with fundamentally important things that, if done on a regular basis, would make a tremendous positive difference in our lives.<\/p>\n<h2 class=\"p2\">APPLICATION SUGGESTIONS:<\/h2>\n<ol class=\"ol1\">\n<li class=\"li2\">Identify a <b>Quadrant II activity you know has been neglected<\/b> in your life—one that, if done well, would have a significant impact in your life, either personally or professionally. Write it down and commit to implement it.<\/li>\n<li class=\"li2\">Draw a <b>time management matrix<\/b> and try to estimate what <b>percentage of your time you spend in each quadrant<\/b>. Then log your time for three days in fifteen-minute intervals. How accurate was your estimate? Are you satisfied with the way you spend your time? What do you need to change?<\/li>\n<li class=\"li2\">Make a list of <b>responsibilities you could delegate<\/b> and the <b>people<\/b> you could delegate to or train to be responsible in these areas. Determine what is needed to start the process of delegation or training.<\/li>\n<li class=\"li2\"><b>Organize your next week. <\/b>Start by writing down your roles and <b>goals<\/b> for the week, then transfer the goals to a specific action <b>plan<\/b>. At the end of the week, <b>evaluate<\/b> how well your plan translated your deep values and purposes into your daily life and the degree of integrity you were able to maintain to those values and purposes.<\/li>\n<li class=\"li2\">Commit yourself to start <b>organizing<\/b> on a <b>weekly<\/b> basis and set up a regular time to do it.<\/li>\n<li class=\"li2\">Either convert your current planning tool into a <b>fourth generation<\/b> tool or secure such a tool.<\/li>\n<li class=\"li2\">Go through “A Quadrant II Day at the Office” (Appendix B) for a more in-depth understanding of the impact of a Quadrant II paradigm.<\/li>\n<\/ol>\n<h3 class=\"p2\">Quotations from:<\/h3>\n<p class=\"p2\">Covey, Stephen R.. <i>The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change<\/i> (pp. 188-189). RosettaBooks. Kindle Edition.<\/p>\n<h2>Transcript<\/h2>\n<p>0:00<br \/>\nSo all of this stuff around quadrants in other words going for more productive stuff, trying to work on things that are important but not urgent requires the word No, the only place to get time for quadrant two in the beginning says covey is from quadrant three and four in other words stuff that is important but not urgent needs to be the time needs to be taken from in urgent but not important or just simply unimportant and an urgent time wasting things. You can&#8217;t ignore the urgent and important crises of quadrant one although it will shrink in size as you spend more time on prevention and preparation. So those are really critical words again, you have to be proactive to work on what quadrant two because quadrants one and three the urgent work on you. So to say yes to important quadrant two priorities you have to let us say no to other activities.<\/p>\n<p>2:00<br \/>\nSometimes apparently urgent things, really difficult discipline this one. I mean, if you&#8217;re going to try and create a business for your futures independence with a family to spend more time with your kids and loved ones, for example, which is a classic motivation for a lot of people I work with, guess what, you&#8217;re probably gonna have to spend less time with your kids and partner up front for a year or two while you build your business. And that&#8217;s a sacrifice, you&#8217;re gonna have to be okay with making you got to talk it through with them as well make sure they&#8217;re on board of this. But you have to say no to something else. Sometimes things that aren&#8217;t very important to you. And equally, you don&#8217;t want to spend, you know, the next five years 10 years of your life completely ignore your family in favor of building a business, because you&#8217;ll probably end up divorced and you may not have a business and either because the business can be a hell of a rollercoaster ride. So you&#8217;ve got to balance things out. I&#8217;m not suggesting you completely junk things that are important to you, but you may have to sacrifice and compromise. That&#8217;s a very realistic thing that I know from experience. The other thing is this keep in mind says copy that you are always saying<\/p>\n<p>3:00<br \/>\nNotice something, if it isn&#8217;t the apparent urgent things in life is probably to the more fundamental, highly important things. For example, if this afternoon I just keep creating podcasts, which I do think are important. But getting another podcast done today is not actually urgent yet. And I ignore going for a run because I&#8217;m running for the half marathon next week, I may struggle to finish the marathon and it won&#8217;t really make that much difference if I run today or not. But it will make a difference if I run enough this week. So one day at a time, my fitness will be going down unless I&#8217;m carve out the time like I did yesterday, I went out for an hour and a half, even though I had a ton of things on my plate. Why again, I have to say the power of deadlines and the power of decision. accountability. I there&#8217;s no way that I would get myself fit if I hadn&#8217;t forced myself by putting myself in for a half marathon. Am I really prepared for this? Probably not. I think they asked me to say how long it would take me to complete it. I might like about four hours, which is about two hours long. about twice as long as any respectable runner he&#8217;s moderately fit. So I&#8217;m<\/p>\n<p>4:00<br \/>\ngoing to struggle to do it but sometimes doing, you know, good enough job is good enough. And I think setting comments and kind of goal that you have publicly committed to is no, there&#8217;s there&#8217;s no way that you can fail really, if you absolutely have to succeed. So that&#8217;s my kind of bit of jujitsu that I moved to my leg for myself. If you&#8217;re like me quite a reactive and problem oriented person that I just make sure I&#8217;ve got things in the diary that forced me to do the right things. I have mastermind meetings, I have a book in a session with my coach, where I say, right, we&#8217;ve committed for me to do this in two weeks time, give me a hard time. If I haven&#8217;t done this a book in whatever way I&#8217;m going to put myself into the half marathon, for example, to get fit. It&#8217;s a primitive but effective way of doing it. I did this a few years ago, when I want to get my pipeline to the next level. I booked myself in for a piano diploma exam, which is quite tricky for that as those who&#8217;ve done it about 50% failure rates. And then I went to get myself a piano teacher and get back into piano lessons.<\/p>\n<p>5:00<br \/>\nvalue and you haven&#8217;t got much, you haven&#8217;t got launched yet with a product on Amazon, then give yourself a nine month deadline to launch Get yourself a coach and get cracking. So moving back to covers book moving into quadrant two or becoming more productive if quadrant two activities are clearly the heart of effective personal management, the first things are the most important things we need to put first, then how do we organize and execute around these things? And I guess the answer is you need the right generation of time management tools. So we talked about the three generations of time management tools before the first generation being checklists and notes with no privatization. Second one being calendars and appointments, which I still think has a lot of power. The third was prioritization but being too rigid about it. So the fourth generation thing says covey needs to have six criteria, it needs to be coherent. In other words, it needs to go back to the values that we care about needs to be balanced so that we&#8217;re not sacrificing health for business success or sacrificing business success for family.<\/p>\n<p>6:00<br \/>\nLife for example, by the way, balance, I think you need to take a sort of five year vision of balance. If you one year or two years you work very, very hard and don&#8217;t see your family very much. But you you buy yourself future freedom to spend more time with your family, I think overall taken in the round over five years or six years timeframe that is balanced, by the way in my personal opinion, if you take each day and each week as as your focus for balance, I think that&#8217;s too narrow. Personally, if you try and build a business, I think you need to think this way, just my two cents quadrant to focus. So in other words, your tool your planning tool needs to focus on the important not urgent, it needs to have a people dimension to it. So you need to be able to deal with people and develop relationships not just efficiency, but effective relationship building flexibility because life happens and portability, which is obviously important as well as and good having a massive Desiree if you&#8217;re forever flying around the world or it&#8217;s not convenient, becoming a quadrant two self management says covey has four activity areas.<\/p>\n<p>7:00<br \/>\nOne is identifying roles to selecting goals within those three is scheduling weekly, rather than daily and four is adapting daily. So let&#8217;s look at those identifying roles is first for example, you might be a an individual, a spouse or parents, Manager for new products. You also might be a research manager, manager of Staff Development Administration manager and the CEO of a company and guess what if you&#8217;re a an Amazon business creator from scratch, you&#8217;re probably going to be all of those things, aren&#8217;t you? So you have various different roles. You might do all of them yourself individually to start with and then outsource them later. But if they&#8217;re on your plate right now, you need to think about having goals within each of those areas, not just the business as a whole. I think it is wise to split things up between for example, and procurement and research.<\/p>\n<p>7:51<br \/>\nthen within each role, for example, as a parent, you might say, I&#8217;m going to you know, make sure I go to my son&#8217;s football or hockey matches this year as a manager of nutrition.<\/p>\n<p>8:00<br \/>\nthat you might be trying to get three new products launched this year, that sort of thing. And then you need to put these goals into your weekly goals that should be tied to your longer term goals as well. Scheduling weekly means you translate each goal to a specific day of the week either as a priority item or even better as a specific appointment. And I think appointments in the diabetic I mean, for me, we&#8217;re going to put a podcast recording together either if I have an appointment with an interviewee, then that goes in the diary. Sometimes we have to shift it, but mostly it stays. And if we reschedule, we reschedule. We don&#8217;t just cancel, we&#8217;re just let it let it drift. And if I do one on my own, it&#8217;s much harder to hold myself accountable. I generally put it in the diary 50% of the time, I kind of drift past it. Again, it&#8217;s easier to be accountable to other people than to oneself right but putting things in the diary I think is really important if it is an important activity. And then the final thing is to adapt daily with quadrant two weekly organizing daily planning is more a function of adapting daily prioritizing activities and responding to unanticipated<\/p>\n<p>9:00<br \/>\nevents, relationships and experiences. So, you know if your son comes home from school crying because he&#8217;s been bullied or fallen over in a sports game, if your wife is having a bad hair day or your husband or you know somebody, some customer meltdown, and you have to deal with that, you get a one star review and and I was a business, whatever, you&#8217;ve just got to roll with that. And you need to have a system that is flexible enough to account for real life in that way. And I think that&#8217;s really critical scheduling every minute of the day. In my experience, depending on how rigid you are and how disciplined you are as a person, I guess. I&#8217;ve found it to be solid Australian and ineffective because I don&#8217;t stick to it. So I really advise against that. I mean, I think what a good simple rule of thumb is, if you&#8217;re working this stuff full time is just make sure you schedule your morning between 9am and one o&#8217;clock have lunch and then deal with whatever else including emails. I personally, try not to check emails until late afternoon because otherwise my day is reacting to that rather than being proactive.<\/p>\n<p>9:55<br \/>\nSo living it. This is covers summary, returning once more to compete.<\/p>\n<p>10:00<br \/>\nmetaphor of habit one says you&#8217;re the programmer. And habit two says or write the program that habit three says live the program or run the program and living it says covey is primarily a function of our independent will, and commitment. But he says very important distinction that commitment not to short term goals or schedules, we&#8217;re not committed to that. We&#8217;re also not committed to the impossible moments are getting distracted by YouTube or Facebook. And I&#8217;m guilty of all that stuff sometimes. But what we should be committed to instead is to the correct principles like ethical behavior and our own deepest values. I think that&#8217;s an excellent distinction. You don&#8217;t have to be rigid about being connected to you know, implementing your plan, but you have to be really strong about staying true to your values. For example in my wife comes home and wants to spend a bit of time cuddling because she&#8217;s got to be off for the rest of the day, including late evening I won&#8217;t see her till midnight. She&#8217;s a musician so I&#8217;m not working late. Sometimes I will pop my schedule and say you know what, this podcast can wait till late or even tomorrow morning. Now if I just don&#8217;t get it done.<\/p>\n<p>11:00<br \/>\nThat&#8217;s unacceptable but if it gets shuffled, shuffled around a bit in favor of relationship with my wife, which is obviously right up there in terms of importance and happiness in my life, guess what, that&#8217;s actually a good decision I&#8217;m gradually learn to be less rigid about these things. I mean, it&#8217;s very tempting to try and be rigidly adherence to daily schedules but I really think adherence a weekly goals but being quite flexible daily, works very, very well. Just make sure you don&#8217;t overpack the day. Now, if you are trying to fit your Amazon business building around a full time day job, you&#8217;re going to have less flexibility. That&#8217;s how it goes, you know, so just make sure you don&#8217;t rob Peter to pay Paul. And if you&#8217;re going to spend time dealing with the crisis on Monday evening with your son, daughter, wife, whatever, mother, whatever it may be family life, then make sure you gain that time back on the Saturday and negotiate it with people just explain OKR to spend that time I can spend the time now but I&#8217;m going to have to spend the time with something else later. Right.<\/p>\n<p>11:52<br \/>\nSo, the fourth generation of time management of self management, as cubby puts it is more<\/p>\n<p>12:00<br \/>\nadvancing the third in five important ways, I think this is important changes. Number one is principle centered. It allows you to see your time in the context of what is really important not just being rigid sake of it. Its conscience directed it helps you organize your life, in harmony with your deepest values, as covey says you can peacefully subordinate your schedule to higher values, as I just talked about the example of deepening relationship with your other half. It defines number three defines your unique mission, including values and long term goals is give direction and purpose the way you spend each day. I think it&#8217;s so important, particularly you&#8217;re leading a team in a business I mean, if you&#8217;re leading without direction and values, it&#8217;s going to be a very reactive way of of dealing with your team, which is a whole different ballgame, which we&#8217;ll talk about in another podcast. Number four, your fourth generation time management tool or self management tool, helps you balance your life by identifying roles and setting goals in each key role each week. So in other words, you don&#8217;t just do one hour of your<\/p>\n<p>13:00<br \/>\nLife to excess and ignore another one you don&#8217;t ignore your health or family relationships in relation to business, for example, but equally you don&#8217;t ignore your business in the context of your day job and family life, right. So there are two different areas of danger here. In my experience, one is when people are just starting out, they ignore their hours in business they say they&#8217;re going to start one they even sometimes spend lots of money on training courses or even more on physical products.<\/p>\n<p>13:26<br \/>\nBefore they really checked out the market, which always scares me, I get a few people coming to me that they&#8217;ve got, you know, spent a couple of you know, 10 $20,000<\/p>\n<p>13:35<br \/>\non products, and then they get caught up in daily life, family life and day job, and they neglect damage to business and that&#8217;s just as irresponsible to me is to completely neglect your health or neglect your family. So, different areas have different times different stages, I should say of business growth, bring different dangers, just be aware of the danger of being completely unbalanced. The fifth and final aspects<\/p>\n<p>14:00<br \/>\nFourth Generation self management tool is it gives context with weekly organization rather than just planning your day but not whining about this perspective single day. So the practical thread running through all of these advances is a primary focus on relationship and results and a secondary focus on time. Really, really critical. So Time management is really the wrong focus even the word time management I&#8217;m going to common phrase now. So I guess it&#8217;s the starting point. But actually what we&#8217;re really looking at is managing relationships and managing results rather than managing time. Time is just the space we knew that I guess what matters is the relationships and results we we have within that. So in conclusion, then there are some application suggestions that are suggested by covey and a bit of a summary of the quadrant to paradigm a new way of looking at the world the key to effective management of self or others is not an any technique as covey says or tool it is introduced.<\/p>\n<p>15:00<br \/>\nIn the quadrant to paradigm that empowers you to look through the lens of importance rather than urgency.<\/p>\n<p>15:06<br \/>\nSo to boil that down into English, if you look at everything, and consider what&#8217;s important, not at what is urgent, you do different things. And I think that&#8217;s really, really important. Every one of the seven habits so that the Habits of Highly Effective People that can be talked about is in quadrant two. Every one of them deals with fundamentally important things that you&#8217;ve done on a regular basis would make a tremendous positive impact or difference in our lives. So finally, some application suggestions from covey. Number one, he says, identify a quadrant two activity, you know has been neglected in your life and write it down and commit to it and implement it. So the answer the question that we asked at the beginning of the show number to draw a time management matrix and try to estimate what percentage of your time you spend in each quadrant. Then log your time for three days in 15 minute intervals. How accurate was your estimate?<\/p>\n<p>16:00<br \/>\nAre you satisfied with the way you spend your time? What do you need to change? This isn&#8217;t something I&#8217;ve actually done, I must do this at some point. But I do think that they say what gets measured gets done as Peter Drucker quote, like so many fantastic management quotes. And I really think that map that so one thing you should be doing is measuring your time I do that with a little tool called toggle to GG L, which is free. And I&#8217;m just measuring right now that I&#8217;m doing a podcast recording. Very helpful. But even better to have a couple of days we are very granular about it. Just to see how your day is actually pan out, and it&#8217;s going to be frightening, frightening and humbling to start with, in my experience, but useful. Application suggested number three, make a list of responsibilities you could delegate and the people you could delegate to. This is a bigger picture thing, but that&#8217;s certainly a very interesting exercise. I think that&#8217;s something for another podcast as well. Number four, organize your next week. Start by writing down your goals and goals for the week. transfer those to specific action plan at the end of the week. evaluate how<\/p>\n<p>17:00<br \/>\nWell, your plan translates to God values and purposes into your daily life, and the degree of integrity you will maintain to those values and purposes. That&#8217;s quite a mouthful, isn&#8217;t it? I mean, you know what, that&#8217;s an excellent idea. You know what else I think if you don&#8217;t do that with somebody else holding you accountable, very unlikely to happen, in my experience, these are councils of excellence, their councils of perfection, as my mother would have put it. In other words, I don&#8217;t think you can do it unless you have somebody holding you accountable to that, which is one reason why in the mastermind groups, we try and wrap up every mastermind group with a goal setting exercise and we try and hold people accountable to see how they&#8217;re measuring up against those goals. A daily or rather weekly, check in with a coach because the easiest way to do that, in my experience, application suggest number five we got two months ago, count number five, commit yourself to start organizing a weekly basis and set up a regular time to do it an excellent idea. I can&#8217;t say that I really organized things that well. These days in that way. I tried to set three goals for the week. For the<\/p>\n<p>18:00<br \/>\nmanagement tool thing, there&#8217;s that there&#8217;s a very good book that I will do another podcast about, but it&#8217;s a very good practice. And I think, again, if you&#8217;ve got a coach or a business partner that you can work with on this, it&#8217;s going to help make it real as well. Number six, either convert your current planning tool into fourth generation tool or secure such a tool. Well, you can be complicated about this, I think, you know, lists are okay, shed on things is good, but I for me, I keep it very simple. I have a list that I write on the whiteboard for the day, have a list that I write in the on a piece of paper for a week and stick on my desk in front of me. And then I try and schedule in the things that go with that. For example, if I&#8217;m going to try and, you know, get ahead with the podcast and record lots of episodes, I just schedule those into my diary. Sometimes they happen sometimes they don&#8217;t if it was me with me, with guests, I would say sort of 25% of them cancel them because they get busy. Maybe Maybe 20% actually, most people stick to it because they want the publicity and surprisingly, but you know if we do we reschedule, I reschedule it in things with my clients or<\/p>\n<p>19:00<br \/>\nGo and get in touch them. So a lot of what I do is about prodding people to schedule things with me actually. And so a lot of that is starting to be automated now. So to some extent, I do act on this, but I think some of the tools I use very sophisticated like schedule once or once hub, which is the way that I schedule calls with clients, with consulting clients, or with podcast guest, but a lot of it is a piece of paper, but I wouldn&#8217;t have a list of undifferentiated goals and a piece of paper, I just have a list of maybe three goals for the day and sometimes one and the the art is not in creating a long complicated list is having one thing that you keep in front of you, and you stay on it until you&#8217;ve done it for the day. That&#8217;s the Charles Schwab idea, right. Coming back to come is application suggestions. Last couple number six, either convert your planning tool. I know we talked about that, sorry, number seven, go through quadrant today. The Office panics be for more in depth understanding of the impact of a quadrant two paradigms. I&#8217;m not going to do that here because that would take a long time. But if you buy his book, The<\/p>\n<p>20:00<br \/>\nSeven Habits of Highly Effective People, powerful lessons in personal change. That&#8217;s the full grand title, then you will be able to read that for yourself. And I would urge you to do that it&#8217;s a very thought provoking way of looking at life in the office. But for now, I&#8217;ll just sum this up as quickly as I can. So I know this has been quite a long episode what between covers detailed thoughts on my last on it nearly an hour, but I think this stuff is critical. So sorry to get along. But on the other hand, I think this stuff is important. So the basics is this number one habit is inside out you need to be productive if you don&#8217;t like the way your life is, or you think it could be better than your responsibility to change it, not anybody else&#8217;s and also your possibility to change it. It is possible if you&#8217;re in a reasonably wealthy situation, a reasonably wealthy country there&#8217;s no excuse really and I&#8217;m and you know, there&#8217;s always a reason why you can&#8217;t succeed but there&#8217;s always reasons why you can so that&#8217;s absolutely critical habit to is. begin with the end in mind. have a vision and<\/p>\n<p>21:00<br \/>\nIn a lot of cases, I think people&#8217;s visions are kind of second hand they&#8217;ve been told they should have wealth and independence. But why was really, really important to you personally, it may be that your vision does not align with being an entrepreneur, maybe family life and your day job, are actually the way to go, which is perfectly fine. Don&#8217;t feel you should be or have to be an entrepreneur, there&#8217;s no reason why you have to be. But assuming you are, then you&#8217;re going to have to come up with a really powerful vision for why you&#8217;re going to put up with a bad times the insecurities when Amazon does things you don&#8217;t want, which always happens, at some point to all of us when your suppliers let you down, which happens to all of us at some point, when your customers complain, which happens to all of us at some point. When you&#8217;re stuck in the wilderness of product selection, and you don&#8217;t know what to do next. How are you going to get through it? I think the answer is you&#8217;ve got a bigger vision that is bigger than the problems that are in front of you. Right and then habit three as we&#8217;ve been talking about today, begin with the end in mind and then put those those things first that are going to lead you to your goal. So thank you for listening to me. I mean, for me, one of the things<\/p>\n<p>22:00<br \/>\nI&#8217;m really committed to is to keep putting this podcast out to get the best mindset and business strategy and business tactics that I can as well as bringing interviews with some great guests, which is coming up on the 10 k collective podcast, just to find a pitch for that the 10 k product to podcast one is a pitch, by the way is not paid no podcast normally cost any money. If you could subscribe to that, that doesn&#8217;t mean you pay anything. Just to understand the word subscription in the context of podcasts. All it means is that you get regular updates. So account for the 10 k collective podcast that should be coming to an app near you soon. Hopefully, by the end of may give some myself another deadline that I&#8217;m going to just about hits. So let&#8217;s say May the 30th I&#8217;m saying here right now even that&#8217;s a bit sooner than I want to do it. And look out for the 10 k collective podcast which is going to be for advanced sellers or at least it&#8217;s going to be for anyone who wants to build a business but particularly geared to advanced sellers. I will be dealing with Supply Chain Management with outsourcing and delegation.<\/p>\n<p>23:00<br \/>\nWe&#8217;ll also be interviewing some successful e commerce entrepreneurs to find out how they did it and what things they would advise you not to do. Don&#8217;t mistake, repeat the mistakes and to learn also the things that they&#8217;ve done that work well so you can duplicate that. So look out for the 10 k collective podcast. In the meantime, thank you so much for listening. Really appreciate it. Speak to you in the next show.<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n<h3><strong>Watch my discussion of Time Management for Ecommerce Entrepreneurs <\/strong><\/h3>\n<p>[video_page_section type=&#8221;youtube&#8221; position=&#8221;bottom&#8221; image=&#8221;&#8221; btn=&#8221;light&#8221; heading=&#8221;&#8221; subheading=&#8221;&#8221; cta=&#8221;&#8221; video_width=&#8221;1080&#8243; hide_related=&#8221;false&#8221; hide_logo=&#8221;false&#8221; hide_controls=&#8221;false&#8221; hide_title=&#8221;false&#8221; hide_fullscreen=&#8221;false&#8221;]https:\/\/www.youtube.com\/watch?v=mHAKrFl4YVU&amp;feature=youtu.be[\/video_page_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F326.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/326.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6450-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/326.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"326.mp3\">Download<\/a> (Duration: 31:26 &#8212; 21.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 31:26 &#8212; 21.6MB)Subscribe: Spotify | Email | RSSTime Management for e-commerce is an absolutely critical skill area. Time management can be the single biggest block to even starting an e-commerce business. And for an established, busy e-commerce business owner,  managing time is just as critical. In this [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":6472,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[4],"tags":[1278,1853,1277,1280,151,1276,1267,1279],"class_list":["post-6450","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-amazon-fba","tag-25-tariff","tag-amazing-fba-podcast","tag-china-us-trade-war","tag-chinese-import-tax","tag-tax","tag-trade-tariffs","tag-trade-war","tag-usa-import-tax","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>326 Habit 3: First Things First - time management for ecommerce entrepreneurs (part 2) - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"326 Habit 3: First Things First - time management for ecommerce entrepreneurs (part 2) - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 31:26 &#8212; 21.6MB)Subscribe: Spotify | Email | RSSTime Management for e-commerce is an absolutely critical skill area. Time management can be the single biggest block to even starting an e-commerce business. And for an established, busy e-commerce business owner,  managing time is just as critical. In this [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-05-16T05:00:46+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-06T14:28:00+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/326.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"29 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"326 Habit 3: First Things First &#8211; time management for ecommerce entrepreneurs (part 2)\",\"datePublished\":\"2019-05-16T05:00:46+00:00\",\"dateModified\":\"2021-01-06T14:28:00+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/\"},\"wordCount\":5863,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/326.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"25% tariff\",\"Amazing FBA Podcast\",\"china US trade war\",\"chinese import tax\",\"Tax\",\"Trade tariffs\",\"Trade war\",\"USA import tax\"],\"articleSection\":[\"Amazon FBA Private Label\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/\",\"url\":\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/\",\"name\":\"326 Habit 3: First Things First - time management for ecommerce entrepreneurs (part 2) - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/326.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-05-16T05:00:46+00:00\",\"dateModified\":\"2021-01-06T14:28:00+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/326.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/326.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"time management for ecommerce\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"326 Habit 3: First Things First &#8211; time management for ecommerce entrepreneurs (part 2)\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"326 Habit 3: First Things First - time management for ecommerce entrepreneurs (part 2) - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/","og_locale":"en_GB","og_type":"article","og_title":"326 Habit 3: First Things First - time management for ecommerce entrepreneurs (part 2) - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 31:26 &#8212; 21.6MB)Subscribe: Spotify | Email | RSSTime Management for e-commerce is an absolutely critical skill area. Time management can be the single biggest block to even starting an e-commerce business. And for an established, busy e-commerce business owner,  managing time is just as critical. In this [&hellip;]","og_url":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-05-16T05:00:46+00:00","article_modified_time":"2021-01-06T14:28:00+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/326.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"29 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"326 Habit 3: First Things First &#8211; time management for ecommerce entrepreneurs (part 2)","datePublished":"2019-05-16T05:00:46+00:00","dateModified":"2021-01-06T14:28:00+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/"},"wordCount":5863,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/326.png?fit=1280%2C720&ssl=1","keywords":["25% tariff","Amazing FBA Podcast","china US trade war","chinese import tax","Tax","Trade tariffs","Trade war","USA import tax"],"articleSection":["Amazon FBA Private Label"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/","url":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/","name":"326 Habit 3: First Things First - time management for ecommerce entrepreneurs (part 2) - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/326.png?fit=1280%2C720&ssl=1","datePublished":"2019-05-16T05:00:46+00:00","dateModified":"2021-01-06T14:28:00+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/326.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/326.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"time management for ecommerce"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/326-habit-3-first-things-first-time-management-for-ecommerce-entrepreneurs-part-2\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"326 Habit 3: First Things First &#8211; time management for ecommerce entrepreneurs (part 2)"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/326.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-1G2","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6450","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=6450"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6450\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6472"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=6450"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=6450"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=6450"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}