{"id":6516,"date":"2019-05-30T17:36:38","date_gmt":"2019-05-30T16:36:38","guid":{"rendered":"https:\/\/amazingfba.com\/?p=6516"},"modified":"2020-05-13T05:58:07","modified_gmt":"2020-05-13T04:58:07","slug":"329-building-relationships-in-e-commerce","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/","title":{"rendered":"#329 Building Relationships in e-Commerce (Based on “7 habits of Highly effective people”) Part TWO"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F329.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F329-building-relationships-in-e-commerce%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/329.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6516-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/329.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"329.mp3\">Download<\/a> (Duration: 39:38 &#8212; 27.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><h2><strong>THE EMOTIONAL BANK ACCOUNT<\/strong><\/h2>\n<p>“We all know what a financial bank account is. We make deposits into it and build up a reserve from which we can make withdrawals when we need to.<\/p>\n<p>An<strong> Emotional Bank Account<\/strong> is a metaphor that describes the amount of<strong> trust<\/strong> that’s been built up in a relationship. “<\/p>\n<p><!--more--><\/p>\n<h2><strong>Six Major Deposits [in the emotional bank account] <\/strong><\/h2>\n<h3><strong>Overview<\/strong><\/h3>\n<ol>\n<li>Understanding the individual<\/li>\n<li>Attending to the little things<\/li>\n<li>Keeping Commitments<\/li>\n<li>Clarifying Expectations<\/li>\n<li>Showing Personal Integrity<\/li>\n<li>Apologising Sincerely when you make a withdrawal<\/li>\n<\/ol>\n<h2><strong>6 Emotional Deposits in the emotional Bank Account in Detail<\/strong><\/h2>\n<h3><strong>Deposits 1 Understanding the individual <\/strong><\/h3>\n<h4>Customer Avatar research<\/h4>\n<ul>\n<li>Talk to real people!<\/li>\n<li>Understand alternatives ie your competitors<\/li>\n<li>Ask them to use rivals products and test your prototypes or own PL samples<\/li>\n<\/ul>\n<h4>Understand your product supplier:<\/h4>\n<ul>\n<li>Business model<\/li>\n<li>Daily life<\/li>\n<li>Drivers<\/li>\n<li>China etc. &#8211; Cultural differences\n<ul>\n<li>Direct no<\/li>\n<li>QC etc.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h4>Other Suppliers<\/h4>\n<ul>\n<li>What does a photographer need to do a good job?<\/li>\n<li>Ditto Graphic designer (logo, packaging etc.)<\/li>\n<li>Ditto industrial designer if you’re going custom product route<\/li>\n<\/ul>\n<h4>Business Partners\/Stakeholders of all kinds<\/h4>\n<ul>\n<li>What are their aims in life? In business?<\/li>\n<li>Do they align with yours?<\/li>\n<li>Joint aim of business?\n<ul>\n<li>Eg create business to sell in 3 years? 5 Years?<\/li>\n<li>Global brand? etc.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h3><strong>Deposit 2 Attending to the little things<\/strong><\/h3>\n<h4>Customer service<\/h4>\n<ul>\n<li>Followup in a brief respectful way<\/li>\n<li>Include nice extras in package<\/li>\n<li>Dealing with problems promptly<\/li>\n<li>Not being bureaucratic<\/li>\n<\/ul>\n<h4>Product Supplier relations<\/h4>\n<ul>\n<li>Cultural niceties<\/li>\n<li>Educated<\/li>\n<li>Presents\/birthdays etc.<\/li>\n<\/ul>\n<h4>Business Partners of all kinds<\/h4>\n<ul>\n<li>Presents etc<\/li>\n<li>Meetings\n<ul>\n<li>Be on time for meetings<\/li>\n<li>don&#8217;t cancel last minute<\/li>\n<\/ul>\n<\/li>\n<li>Language in emails<\/li>\n<\/ul>\n<h3><strong>Deposit 3 &#8211; Keeping Commitments<\/strong><\/h3>\n<h4>Customer<\/h4>\n<ul>\n<li>Make sure promises of your marketing are fulfilled in your product’s performance<\/li>\n<\/ul>\n<h4>Product Supplier<\/h4>\n<ul>\n<li>Pay them on time<\/li>\n<li>Don’t move goalposts eg adding in QC or features AFTER ordering.<\/li>\n<\/ul>\n<h4>Other Suppliers<\/h4>\n<ul>\n<li>Pay as agreed<\/li>\n<li>Give info as agreed<\/li>\n<\/ul>\n<h4>Business Partners of all kinds<\/h4>\n<ul>\n<li>Task\/project management\n<ul>\n<li>Honouring Agreements on who does what<\/li>\n<li>Doing things in agreed timescales<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h3><strong>Deposit 4 &#8211; Clarifying Expectations<\/strong><\/h3>\n<h4>Customer<\/h4>\n<ul>\n<li>Eg sizes for clothes;<\/li>\n<li>function for technological products<\/li>\n<\/ul>\n<h4>Product Supplier<\/h4>\n<ul>\n<li>HUGE &#8211; detailed specification<\/li>\n<li>QC expectations<\/li>\n<li>Timing expectations<\/li>\n<li>Financial arrangements<\/li>\n<\/ul>\n<h4>Other Suppliers<\/h4>\n<ul>\n<li>What they provide eg photos<\/li>\n<li>What they WON’T provide<\/li>\n<\/ul>\n<h4>Business Partners of all kinds<\/h4>\n<ul>\n<li>Long term goals<\/li>\n<li>defining roles:\n<ul>\n<li>Who will do what<\/li>\n<li>who WON’T do what<\/li>\n<\/ul>\n<\/li>\n<li>Amount of time each partner\/team member will contribute<\/li>\n<li>balance with rest of life\n<ul>\n<li>Weekend\/evening work<\/li>\n<li>Financial commitments rest of life<\/li>\n<\/ul>\n<\/li>\n<li>Financial commitments within business\n<ul>\n<li>Who contributes what<\/li>\n<li>Approx pool of money available\n<ul>\n<li>Now<\/li>\n<li>In future<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h3><strong>Deposit 5 &#8211; Showing Personal Integrity<\/strong><\/h3>\n<h4>Customers<\/h4>\n<ul>\n<li>Deliver on promises<\/li>\n<li>If you mess up, apologise, replace, refund ASAP<\/li>\n<\/ul>\n<h4>Product Suppliers<\/h4>\n<ul>\n<li>Be honest about future orders<\/li>\n<li>Negotiate with respect<\/li>\n<\/ul>\n<h4>Other Suppliers<\/h4>\n<ul>\n<li>Try not to promise the earth at the beginning<\/li>\n<\/ul>\n<h4>Business Partners of all kinds<\/h4>\n<ul>\n<li>Do what you’ve agreed!<\/li>\n<\/ul>\n<h3><strong>Deposit 6 &#8211; Apologising <em>Sincerely<\/em> when you make a withdrawal<\/strong><\/h3>\n<h4>Customers<\/h4>\n<ul>\n<li>If you mess up, apologise, replace, refund ASAP<\/li>\n<\/ul>\n<h4>Product Suppliers<\/h4>\n<ul>\n<li>If you’re late paying, pay up, apologise,  don’t make a habit of it<\/li>\n<\/ul>\n<h4>Other Suppliers<\/h4>\n<ul>\n<li>Try not to promise the earth at the beginning<\/li>\n<li>If you’re late paying, pay up, apologise,  don’t make a habit of it\n<ul>\n<li>Tell them up front!<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h4>Business Partners of all kinds<\/h4>\n<ul>\n<li>If you’ve messed up, do the work, apologise,  revisit the practicality of the workload<\/li>\n<li>If things change for you in regard to commitment to the business, have an HONEST conversation<\/li>\n<\/ul>\n<h3><strong>P Problems are PC Opportunities<\/strong><\/h3>\n<h4>Customers<\/h4>\n<ul>\n<li>If you mess up, apologise, replace, refund ASAP<\/li>\n<li>This can sometimes result in 1* becomes 5* review (rather than none)<\/li>\n<\/ul>\n<h4>Product Suppliers<\/h4>\n<ul>\n<li>If your supplier deals well with a problem, you’ll probably trust them more than a new one<\/li>\n<li>Equally, dealing with eg QC issues improves your skillset as a retailer\/product developer\n<ul>\n<li>Negotiation skills<\/li>\n<li>Inter-cultural understanding<\/li>\n<li>Understanding eg QC etc.<\/li>\n<li>Future-proofing business<\/li>\n<li>Improving SOPs<\/li>\n<li>(Improving Training)<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h4>Other Suppliers<\/h4>\n<ul>\n<li>Can improve your relationship cf other clients<\/li>\n<li>Improves skillset\n<ul>\n<li>Negotiation<\/li>\n<li>Writing a brief for designers or photographers<\/li>\n<li>Improving SOPs<\/li>\n<li>(Improving Training)<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h4>Business Partners of all kinds<\/h4>\n<ul>\n<li>Can improve your relationship <em>if <\/em>handled well<\/li>\n<li>Improves skillset\n<ul>\n<li>Negotiation<\/li>\n<li>Organising the relationship and roles\/tasks<\/li>\n<li>Improving SOPs<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h2><strong>The Habits of Interdependence (coming up)<\/strong><\/h2>\n<p>[Habits 4,5,6:<\/p>\n<p>Habit 4: Think Win\/Win (Interpersonal Leadership)<\/p>\n<p>Habit 5: Seek First to Understand, Then to be Understood (Empathy)<\/p>\n<p>Habit 6: Synergize (Creative Co-operation)<\/p>\n<h2>Quotes from<\/h2>\n<p>Covey, Stephen R.. The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change (p. 195). RosettaBooks. Kindle Edition.<\/p>\n<hr \/>\n<h2>Transcript<\/h2>\n<p>0:02<br \/>\nSo, the second type of deposit in the emotional bank account is attending to the little things as covey says. So customer service with is a classic one with customers for example, following up in a brief and respectful way with people checking things out, okay? Including nice extras in the package dealing with problems promptly being very you know, being easy not being bureaucratic. For example, if somebody wants to get a refund them and everybody has the expectation even now on Amazon, I might experience that. Not everybody&#8217;s a gross exaggeration, but a lot of customers get angry quickly, because I think they expect to be treated like a number like a faceless person. And the more you treat them like a person and a human being, and the way you would want to be treated, then the better they react in my experience, which is not surprising, right, but they, I think a lot of people have an automatic expectation they&#8217;re going to be treated badly. So if you don&#8217;t do that you already stand out even now, even though it&#8217;s kind of obvious amongst most educated Amazon sellers, that you need to be quick inventory.<\/p>\n<p>2:00<br \/>\nproblems to apologize to give a refund to not argue about returns and all that stuff unless you have a very expensive item. These sounds like common sense, but they&#8217;re still not common. So follow up in a respectful way, and just solve problems quickly. When it comes to product supplier relationships, because you&#8217;re paying them a lot of people feel that they can be a bit, ride roughshod over that a lot of people are meaning Amazon sellers or e commerce sellers and I&#8217;ve been guilty of that as well. But I think cultural niceties and ways of doing things are important. It&#8217;s important to respect different things. If you ever fly over to China to meet your supplier, then try and be flexible in your approach to food for example, and trying to observe the cultural things in different cultures. They can be things about touching or not touching, bowing, not bowing. Contacts can be seen as very friendly or very aggressive. Just try and attune yourself to if it&#8217;s a foreign culture. Even there&#8217;s some cultural things between British soldiers and British suppliers and there might be a sort of<\/p>\n<p>3:00<br \/>\nCulture of don&#8217;t come talk to me until you&#8217;ve educated yourself about the industry, which is always a good idea, right? If you don&#8217;t want to come across to a brand new supplier, as not knowing anything about the industry, because then you&#8217;ll get taken to the cleaners potentially in negotiations, because they&#8217;ll assume you&#8217;re ignorant because you&#8217;ve shown that you are, and also that if you don&#8217;t take the trouble, and this is a bit less bit different between China where you have literally thousands of factories available to you, sometimes for a certain product type versus if you&#8217;re sourcing supplements in the UK, you might only have four, and in the situation where you only have four suppliers. Guess what the relationship between suppliers and the number of people who want to use them is flipped on its head. So you need to probably be more respectful in the sense of educating yourself about a particular supplier and their business model on the do&#8217;s and don&#8217;ts on their pages before you approach them. For example, if they say on their pages good to trade,<\/p>\n<p>3:52<br \/>\ntrading with wholesaling to you that they don&#8217;t do private labeling, then it may not be very sensible to phone them up and say you don&#8217;t do<\/p>\n<p>4:00<br \/>\nDo private labeling because they&#8217;ve already given the answer in a place that you could get it without wasting their time you get what I&#8217;m saying. So it&#8217;s small things in a way. Again, it comes down to understanding the other person. Before you go in really, business partners, little things. My business partner is always very, very good at sending me birthday presents. And Christmas presents, for example, which my wife is always quick to point out that I was bad at doing which is true. I&#8217;m just generally barely getting presents out on time. I&#8217;m just saying that now as apparently scanning my memory for any upcoming<\/p>\n<p>4:31<br \/>\nbirthdays in my family, but I think I&#8217;m safe in May. So that&#8217;s one of those little things that really can help. It shows a lot of put it this way, receiving a present always feels great. So as a re good, positive there being on time for meetings and don&#8217;t cancel last minute. I mean, I think that&#8217;s one of those little things that if you&#8217;re constantly late for meetings, and I say this is something that I can be guilty of, I try not to run too late, but I&#8217;m often you know, 510 minutes late for for the odd things. If it&#8217;s impersonal. If it&#8217;s online, I tend to be two to three minutes late. That&#8217;s my average and men<\/p>\n<p>5:00<br \/>\nCorporate this is a bad thing, but it&#8217;s not respectful. So this is one of those things I could do better. Lots of little things like that&#8217;s the time keeping communication, showing that you value the relationship. These never go out of style and they&#8217;re small things, but they can become the big things over time as, as covey says, in relationships, the small things are the big things, especially if you are having a bit of a difficult time with the big things, it&#8217;s really good to make sure the small courtesies are retained. And the way you speak to people that the language you&#8217;re using an email being on time, the language you can use an emails, or any written communications is really, really important. Because that can really come across badly quite easily on an email. You can sound rather blunt in an email in a way that if you said something in person, you can soften it with the tone of voice. If you&#8217;re speaking on a video call or in person, you can soften it by your body language and you&#8217;re smiling while you say it. So be very aware that if you&#8217;re writing emails, particularly is people got a habit of rubbing each other up the wrong way. Equally don&#8217;t be offended if you&#8217;re trying to supply seems rather blunt. It could be a cold<\/p>\n<p>6:00<br \/>\ndifference, but bear in mind, they&#8217;re speaking in a second or possibly third language to you and English in Chinese are very, very different languages. Indeed, my experience of them. I don&#8217;t speak Chinese, but I did used to teach English as a foreign language. And I had a few Chinese students or Mandarin speakers. So I do know that there&#8217;s a big gap. So again, the flip side of being careful how you put things in words to people, is don&#8217;t take things too personally, if an email seems a bit off hand or something, it may just be that the person is not very good at English. And that can apply to English speakers. Some people are good at numbers and running businesses, but aren&#8217;t that gifted at expressing themselves in writing, and that&#8217;s okay. Just take it with a pinch of salt.<\/p>\n<p>6:39<br \/>\nDeposit number three in the emotional bank account is keeping commitments really basic, but really important to just ask yourself, all of this stuff sounds so obvious that you can just gloss over it. My challenge to use this take this list of stuff and go and check through every area of your business and ask yourself the question are we doing this because if you&#8217;re not<\/p>\n<p>7:00<br \/>\nIt&#8217;s a pretty easy, straightforward and in the sense of easy or simple, necessarily easy to do. But simple and straightforward way to improve your business out of sight by just doing low tech, very simple things like this. So number three, keeping commitments if you&#8217;ve got a customer, absolutely critical if you make promises in your marketing, that those promises are fulfilled in your products performance, and sometimes we&#8217;ll talk about this in in a second, but they have unconscious expectations, in which case you need to deal with that. But if there&#8217;s a commitment of some kind of made, for example, delivering in a certain timeframe, that&#8217;s more or less down to Amazon if you&#8217;re using fulfilled by Amazon.<\/p>\n<p>7:37<br \/>\nBut nevertheless, that needs to be dealt with. If you have a product supplier, make sure you pay them on time. And try not to move the goalposts regarding adding in features after you&#8217;ve set up an order because that&#8217;s going to make life very difficult for them and they&#8217;ll probably respond No, we can&#8217;t do it or Yes, we can but it&#8217;s going to cost you a lot of extra money. So try to be organized and give them decent notice for things<\/p>\n<p>8:00<br \/>\nThat&#8217;s, that&#8217;s a courtesy there with other suppliers. Just make sure you do things like for example, pay them on as agreed, give them the information, as agreed, for example, if you&#8217;ve agreed to send a brief to your photographer, including a list of links to similar products that you think are good examples that you want them to copy, in terms of the style of photography, then make sure you do that.<\/p>\n<p>8:23<br \/>\nAnd then you get more respect for relationship with them. And then you&#8217;ve got the rights to manage them and say, I&#8217;ve done what we agreed Could you please deliver those photos on time or whatever it is?<\/p>\n<p>8:32<br \/>\nbusiness partners. This is a huge one. If you have a business partner, then task and project management really, really critical. Make sure you honor agreements. If you&#8217;ve agreed to, for example, do the bookkeeping, make sure you keep on top of that. Make sure you follow through if you do things if you&#8217;ve agreed a timescale to do things, make sure you do that in a timely way. And this can be one of the places we are least disciplined in my experience of business. I certainly can speak for myself there. I was lucky enough to work with some very disciplined businessman.<\/p>\n<p>9:00<br \/>\nAs I tend to need more of a prod than other people to get things done in a timely way. And that&#8217;s okay up to a point, you&#8217;ve got to kind of manage each other one of the difficulties with a pure 5050 split business partnership type ownership of a business is that you&#8217;re both kind of in charge, which can be very, very difficult because neither of us really responsible for keeping everyone managed and chasing up on Have you done that task. And you know, that sort of simple task management, people management, but one of the things you can do is divide up into different areas and departments of your business, and keep each other accountable that way. So somebody takes on the task of managing a particular product line with suppliers, then you can be, you can delegate the management of that person to the other person. So partner, he says, Okay, I&#8217;m going to deal with supply management and partner pieces. Okay, I&#8217;m going to keep a timetable of what you should be doing. And I&#8217;m going to check in with you once a week to make sure that&#8217;s moving forward. You can in practice, just institute a regular meeting once a week. I&#8217;d be pretty bad at that sort of rhythm and stuff.<\/p>\n<p>10:00<br \/>\nSo this is one of the areas of greatest weakness for me personally, and I must apologize for that it worked me over the years. For this slightly, what&#8217;s the word? It&#8217;s not like I&#8217;m trying to slide out commitment. I simply, I&#8217;m not very disciplined about keeping tabs on it. So again, that comes down to personal management, putting First things first and being clear about things that&#8217;s a personal time management issue that can show up in a relationship quite quickly. So keeping commitments is is absolutely critical within a partnership. It&#8217;s also important to deal with absolutely critical for your business for your products and your performance as a business as a whole to keep commitments you meet your customers. If you get those two things right, then I think your businesses on a sound footing if you&#8217;re breaking a process your customers because your products aren&#8217;t working, then you&#8217;ve got a big problem and unique can be solved. But that is a fundamental relationship issue, I would say as well as a technical issue and a financial one. Ultimately it comes down to relationships as well. So the emotional bank account is what we&#8217;re talking about here. six major deposits and others building people&#8217;s trust in you deposit number four<\/p>\n<p>11:00<br \/>\nclarifying expectations. This is really, really critical. And often, this can be one of the places where things go wrong. And you wonder why, why it&#8217;s come out of the clear blue sky, bam, suddenly a problem lands in your lap with your customers is very, very important to certain things you need to clarify expectations of what your products will or won&#8217;t do, for example, clothing sizes. Very importantly, you can get into big problems very quickly with baby things. We say small, medium large. This is suitable for 18 months. You&#8217;re, for example, who specifies how big an 18 month old baby isn&#8217;t? And the answer is, there is no international degree specification that human beings so these can be problem areas and you really need to clarify not just with numbers again, but you need to recognize that people shop fast so if you just bury the information in say this is five inches long or 18 centimeters or whatever. That&#8217;s one thing but you need to help people realize that why spelling it out in the photographs of photography is a great place to make sure your community your message gets<\/p>\n<p>12:00<br \/>\ncommunicated on Amazon, because people often don&#8217;t read the text elements of a listing<\/p>\n<p>12:06<br \/>\nproduct suppliers. While there&#8217;s so many expectations that go wrong in this place, if you&#8217;re not careful, it&#8217;s a huge thing to have a detailed specification, what you think of as, as an acceptable version of something might be so different for your Chinese supplier, bear in mind that a lot of Chinese suppliers supply countries outside of the Europe and America or Japan or the traditional quotes of Western or developed country markets, right. China is a huge market just for Amazon, nevermind off Amazon, and tobacco and other such sites. and India is huge as well. And don&#8217;t forget, and Russia is also pretty big market. And those are very big markets with a very different expectation of price and quality than the so called Western or developed world markets. So bear in mind, it&#8217;s not surprising that they will have a very different view of what a specification needs to be for a particular product and what the<\/p>\n<p>13:00<br \/>\nQuality control what represents good, bad or indifferent quality? timing is also a culturally specific thing. I mean, in Europe that varies even between, say, Northern and Southern Europe, but Germans and Japanese, famously incredibly punctual, the Japanese, probably more than anyone in the world, but it&#8217;s pretty close match the Brits and us there&#8217;s probably a cultural expectation within business culture of being on time, more or less with things in China. The timing thing is quite different in the sense that if you rush and you sound like you&#8217;re in a hurry with the Chinese supplier, it&#8217;s not going to go well because either they&#8217;re going to assume you&#8217;re desperate which you probably are, and up the price of things over time, or they will cut corners on the quality. So be very, very careful with rushing in China. Financial expectations and timing. We&#8217;ve talked about what financial expectations are a little bit more clear, in a lot of ways in the sense that you it&#8217;s it&#8217;s numbers so it&#8217;s either you&#8217;re going to give them a 30% deposit or or you&#8217;re not you know, it&#8217;s either is fairly black and white.<\/p>\n<p>14:00<br \/>\nBut having said that, it is a good idea to clarify that if it isn&#8217;t absolutely written in stone somewhere, make sure you&#8217;re very, very clear about that. expectations with other people, for example, photographers, if they&#8217;re going to provide photos for you, that&#8217;s one thing. But if you&#8217;re expecting a photographer, to start to do graphic design, that&#8217;s probably outside what they&#8217;re prepared to do. And it&#8217;s important to clarify exactly what you do and do not expect from somebody as early in the process as you can get, you may have to have a conversation first. But it&#8217;s particularly important before you sign cut some kind of contract or before you agree on a figure because if you change the job specification, quite naturally, people will change the figure the cost of that and by the way, going back to Chinese suppliers very easy to end up thinking of things last minute and then adding them into the mix and then being shocked when your Chinese supplier said, well, we&#8217;ll have to change the price of that and the timescale because if you change the features you want, whether it&#8217;s something physical or more digital like it whether it&#8217;s the features of a product or a photography<\/p>\n<p>15:00<br \/>\nThen expect the price to change to try and get that warbling out of the way first and then come to a clear point where you go right with signing off on this, there&#8217;s a contract, there&#8217;s this, there&#8217;s a purchase order. If you&#8217;re buying stuff in China, you put it into the purchase order for photography, unless you&#8217;re spending thousands. And then there&#8217;s financial clarification as well. Business Partners again, so this is so huge defining expectations is so so important, just because you both own the company, and you&#8217;re kind of, in theory aligned in your interests. And it&#8217;s not as obviously adversarial as you versus supplier sometimes can lead you into being very vague about this stuff. And that can create all sorts of bad feeling down the line. We&#8217;ve already talked about clarifying long term goals. I think that is really, really critical that you have those conversations and that you keep having those conversations and talk about how the business fits in with their life and the rest of the life and how the rest of its going. You need to define roles. This is again really critical if you end up with two people doing the same thing all the time, which drives you a bit nuts and I&#8217;ve experienced that. That is really<\/p>\n<p>16:00<br \/>\ngets defined roles, who&#8217;s going to do the tax return at the end of the year or liaise with your company accountant? Who is going to do the sourcing for a particular product? Indeed, how are you going to split things up? Is it by department? Or is it by product line, when you&#8217;ve got few product lines, product lines, probably the natural way to split it up. So each person takes responsibility for particular product line. later down the line, there might be one person who has a particular expertise in an area. And there is a member of the 10 k collective, for example, who has a business partner, who is based out in Hong Kong, and he himself is Kiwi origin. So from New Zealand, but lives in the UK. So there&#8217;s a very obvious split there that the business partner is the expert in sourcing, in fact, owns part of a factory. So there&#8217;s a very clear split there. So that&#8217;s clearer than usual. But if it isn&#8217;t clear, make sure you define roles, who&#8217;s going to do what and also who isn&#8217;t going to do what that the two things to avoid are duplication. And of course, where the even worse where suddenly falls between two stores the classic, I thought you were going to do that conversation, right, which is what anyone who&#8217;s been married for more than five years.<\/p>\n<p>17:00<br \/>\nis familiar with, guess what you want your business partner partnership to be probably more formally organized and hat because you don&#8217;t have the kind of glue of, you know sexual attraction and affection and the cuddle to make up for shortfalls in that at least not in most normal business partnerships. Of course, if your business partner is your wife or husband, which is quite common, then I would argue you need to be even more careful in how you manage your business relationships. Because if your business was a relationship goes wrong, it&#8217;s going to affect your personal relationship as well. So there&#8217;s a huge amount of work to do here. For most of us, myself included, you got to think about the clarify the amount of time each business partner or team member will contribute. That&#8217;s really important. And you&#8217;ve also got to be aware of the rest of their life. If they&#8217;ve got kids that are young and they&#8217;re going to be kept awake half the night then you need to set realistic expectations there look at their other financial commitments to the rest of their life. We&#8217;ve already talked about that. So do they own property empire for example, that demands cash, and then the financial commitments within the business<\/p>\n<p>18:00<br \/>\nHe&#8217;s contributing lots and roughly what some amount of money if you got available now and in future which is a critical thing for cap capital intensive business model, how to even say this last two deposits, emotional deposits deposit number five emotional deposit, remember being something that increases somebody&#8217;s trust within you your relationship deposit number five showing personal integrity,<\/p>\n<p>18:27<br \/>\nshowing in other words, if you say you have values that you act on them so they say honesty is putting into words what your actions are accurately and they say integrity is putting your words into action. So if you make a promise to a customer, you better deliver on that. And if you mess up, you better deal with it quickly. So deliver on your promises. This comes down to getting competent at working with and selecting suppliers, working with your supplier to get a good choice of product materials and design, working with them to make sure quality control is taken care<\/p>\n<p>19:00<br \/>\nAnd resolving issues around that. And then having inspection yourself to make sure that you assure quality control as well. So all of that contributes to you, your product delivering on your behalf to promises you&#8217;ve made to your customer and all businesses work on the basis of making a price and delivering on it really or failing to and then again, if you fail to deliver on promises, apologize replace refund, these are this the holy trinity of simple tactical actions ASAP very, very fast. Lead genuinely apologetic, if you get defensive, then you are basically in customers eyes whilst it&#8217;s understandable from your perspective. From the customers perspective, you made a promise and you broke it and now you&#8217;re being defensive instead of apologizing and dealing with it. That goes it goes down very badly, just as badly as it would in a personal situation. With product supplier to be honest about future orders. We all sort of BS a little bit about that and say I&#8217;m planning to build an empire. But I think is better if you do genuinely have a plan to build an empire and negotiate with respect as well and you can ask for<\/p>\n<p>20:00<br \/>\nLower money or whatever we&#8217;re understanding of somebody&#8217;s situation, there&#8217;s a whole bunch of cultural stuff around that. But try and show some integrity. The main thing I would say there is with Chinese suppliers, don&#8217;t be too naive and expect too much personal integrity from people, if they are willing to cut corners, then that&#8217;s just normal business in China, I&#8217;m afraid. And that may be in other places as well. I&#8217;m only saying that about Chinese suppliers, because it&#8217;s often true and most of us will source in China. That&#8217;s probably true for many other countries as well. So if you know you&#8217;re dealing with a culture that has that expectation that there&#8217;s a Chinese saying, if you can fool him, then do for them something along those lines, then make sure you&#8217;re not naive. Just make sure you manage that expectation with or manage that situation by having quality control. But just because somebody else acts with a lack of personal integrity doesn&#8217;t mean you have to follow them down that route. And I particularly advise against that. When you&#8217;re dealing with developed world customers who will have high expectations of your integrity. Do you start selling shoddy goods, and you don&#8217;t really deal with that property, your revenue<\/p>\n<p>21:00<br \/>\nis going to dive bomb pretty damn fast and in my opinion, deservedly so, but even pretend that moral thing out of the equation is not good business practice. What else we need to do? Yeah, its own personal integrity, I guess with other people means basically trying to honor commitments and if you mess up on that dealing with it honestly, with business partners, I guess it means do what you&#8217;ve agreed on your commitments and again, apologize sincerely and change your ways if you don&#8217;t.<\/p>\n<p>21:24<br \/>\nTalking apologies. Deposit number six. In the emotional bank account, the last one, six of six is apologizing sincerely. Note when you make a withdrawal, if you mess up with customers because you break what they feel that you broken trust with them. By not delivering on your promises, then you must apologize refund and replace as quickly as possible. I&#8217;ve already talked about that with product suppliers, negotiate if you&#8217;re late paying up for example, apologize. Don&#8217;t make a habit of it with product supplies. They probably won&#8217;t release your products until you pay them the remaining balance in most cases. That&#8217;s quite right.<\/p>\n<p>22:00<br \/>\nSo you wouldn&#8217;t normally get the chance to do that. But if you have a photographer, for example, and they invoice you in May, then don&#8217;t stop playing them in July, August, September, because you&#8217;re going to risk them going broke if everyone did that. And that&#8217;s just not good. If you&#8217;re going to be late paying, for example, and you know, just tell them up front. That&#8217;s always good. If you&#8217;ve got creditors, then. Yeah, tell people up front, apologize if you do it, and don&#8217;t make a habit of it, because you will ruin your relationships there. What else business partners Yeah, and it&#8217;s so important you are going to with somebody you interact with as much and as often as a business partner, you probably are going to mess up, do the work, apologize and revisit the practicality of the workload if you&#8217;re not going to be able to sustain something, rather than trying to kid yourself or your business partner, then revisit it and make it more sustainable, more realistic, if you&#8217;re constantly falling behind. And again, that comes down to personal management, the private victory receives public victory if you are bad at time management and you simply aren&#8217;t good at estimating how much you can realistically get done in a week. That<\/p>\n<p>23:00<br \/>\nThis is what you actually do, guess what, that&#8217;s a personal time management issue. And you&#8217;re going to have to take care of that before you can really be a reliable business partner. And that&#8217;s certainly something that I struggle with. I&#8217;m not great at time management. It&#8217;s one of those things I just need to keep working on. And I use a coach to keep me accountable. And just even doubt, don&#8217;t take on too much. And then let people down. Just say up front, I&#8217;m sorry, I&#8217;m not going to have time to do that. And then you don&#8217;t create the expectation that you then break, right. So that comes down to there&#8217;s an interesting place where integrity and competence need to overlap. So you cannot deliver on your promises to your customers. If you have no competence in selecting the right suppliers, reviewing design,<\/p>\n<p>23:41<br \/>\nand materials and reviewing your own quality control, for example, that comes down to technical competence, but it will be perceived as a lack of integrity by your customer, even if you might say, Oh, I can blame somebody else. There is a mindful well guess what you will You&#8217;re the one who&#8217;s picked the supplier and accepted the products. So there&#8217;s not much point in passing on the blame. You can<\/p>\n<p>24:00<br \/>\nTry your customer where that they don&#8217;t care. Same thing with other people. Generally, you need to get a grip on your own. Get your own house in order before you can really keep integrity. So the last thing I&#8217;d say about insincere apologies, it&#8217;s no good using an apology as a way of life. By most of the time you need to honor your commitments and it&#8217;s only the odd mess up on that way you should be apologizing if you just spend your life apologizing for being late for things all the time and I&#8217;ve done that for years in a lot of my life. Guess what, this is a side you&#8217;ve got to change and you&#8217;ve got to get a grip on things. So another place talking about problems however, covey says p problems or production problems are PC opportunities or production capability opportunities. If you&#8217;ve got a customer on Amazon, the classic example that you messed up with a view apologize, replace, replace and refund and give them great customer service. Quite often they can result in a one star review becoming a five star review. I&#8217;ve experienced that multiple times and I think most people have who have been selling on Amazon for a significant time and rather than the<\/p>\n<p>25:00<br \/>\nRather than neutral thing where people just buy a product think it&#8217;s okay and don&#8217;t bother leaving a review. So quite often, you can flip an angry customer to a really loyal customer more easily, much more easily actually then you can turn a very neutral person to being passionate either way, either for or against your product. So this really is true my experience with product suppliers. If your supplier deals with well with a problem, particularly quality problem normally, you&#8217;ll probably trust them more than a new one. And they say it&#8217;s better the Devil You Know. And that&#8217;s true my experience. All suppliers going to have some problems and nobody&#8217;s going to be perfect and being perfectionist is not really the way to go particularly dealing with Chinese suppliers. Equally dealing with a new quality control issue improves your skill set as a retailer or product developer in multiple ways. For example, negotiation skills, intercultural understanding, understanding QC, future proofing your business, improving SAP or standard procedures that you have. And if you&#8217;ve got other people involved if you&#8217;ve got a team, improving training as well, so there are multiple opportunities to make you a better business person and make your business stronger.<\/p>\n<p>26:00<br \/>\nIf you solve problems with the mindset that this is an opportunity to improve the machine and to improve yourself, rather than just going, Oh my god, I got a problem what a disaster, right? And it&#8217;s only human nature to go, oh God, we&#8217;re going to problem. That&#8217;s not great, that&#8217;s normal. But the main thing is to let go of that and get on with solving it and recognize it by solving it, you&#8217;re strengthening yourself in your business. That is the difference is not being a pure than the driven snow. It&#8217;s it&#8217;s having a normal human reaction, but then getting down to it and seeing the positive. That&#8217;s one of the aspects of a strong business builder, as opposed to somebody who&#8217;s just going to not cope and just end up not building a business with other suppliers and the same kind of thing. You can improve a relationship. Again, writing a brief for designers or photographers, if you end up with a poor result, then you may have to learn Okay, next time I&#8217;m going to write a clear brief, okay, this is a common learning with photography, or designers. With business partners, you can improve your relationship if you handle it properly. As I said, if you just apologize as a substitute for getting<\/p>\n<p>27:00<br \/>\norganized, you&#8217;re not going to do very well long term. But again, it can improve your skill set of organizing relationships and roles and task allocation. There&#8217;s a sharp learning curve there, but that can be a very useful one as well. And again, you can improve so please or even creates standard procedures if you don&#8217;t have any in place. So what&#8217;s coming up them with Covey&#8217;s system is really the habits of interdependence which grow out of these insights habits four, five and six habits for his thinking when when interpersonal leadership, habit five is seeking first to understand and then to be understood, which is basically the the principle of empathy. And habit six is synthesizing. In other words, creative cooperation, one plus one equals more than two, if you get it right. So that&#8217;s what&#8217;s coming up. But just to reflect back on this quite lengthy, a very important area, I think, really, you cannot properly develop good relationships between other people until you&#8217;ve got a good relationship with yourself. And apart from some self esteem and other such emotional issues, really, it comes down<\/p>\n<p>28:00<br \/>\nto being a proactive person, in other words, being willing to change and to have the positivity to believe that you can change your life, you can change your circumstances you can create a business you can make stuff that didn&#8217;t exist before you can change things about your behavior that you didn&#8217;t used to do. Have it to the beginning with an end in mind really important quite often the chronic problem of having no clear goal and no clear aim in your business shows up in the day to day with habit three, which is First things first, you can&#8217;t prioritize things if you don&#8217;t know what&#8217;s important. So you can&#8217;t do time management without setting longer term goals and visions. I would argue in an all of those things together makeup, personal leadership, or private victory is covey puts it and really you&#8217;re not going to end up with good relationships if you don&#8217;t get on top of those things first, so it&#8217;s always worth revisiting. And there&#8217;s something that problem it says of the relationship. How is this a reflection of my lack of personal management and leadership and there&#8217;s nearly always an element of that in there. I&#8217;m not saying you should blame<\/p>\n<p>29:00<br \/>\nyourself everything, but you may as well reflect on the things that you can change about yourself. Because that is under your control other people are not. So I think it&#8217;s a very proactive thing talking about habit one to work on yourself, because that is under your control. Other things may be under your influence, but they&#8217;re not under your control. So bitching and moaning about Amazon, about your supplier about your business partner, that is a week and not a business building mentality. It&#8217;s natural enough to do a bit of it, find do it every beer, get it out of your system, but then focus, what can I change a lot of the time is what habits can I change about myself? But then when it does come to the interpersonal stuff, the emotional bank accounts are fantastically simple and powerful metaphor. And it&#8217;s all about trust, which is such a key currency online trust is the scarce currency and the six major deposits you can make just to review our number one, understanding the individual number two, attending to the little things Number three, keeping commitments. Number four, clarifying expectations number five, sharing personal<\/p>\n<p>30:00<br \/>\nIntegrity. And number six, apologizing sincerely, sincerely being the word when you make a withdrawal. And as I&#8217;ve said, I think that applies to customers, your product suppliers, at least any other suppliers people you&#8217;re outsourcing to and in business partners or team members to say just the very least, of the areas that I could just think of off the top of my head. So this is, once again, very easy to overlook, because it sounds obvious. And in a sense, it is isn&#8217;t anything your grandmother couldn&#8217;t have told you. It&#8217;s not high tech. It&#8217;s not clever strategic is not a business strategy in the pure sense. But what I do think it is, is a very neglected area. And if you just use this as a checklist, go through all your relationships and really reflect honestly, maybe with your team or with your business partner about this, I think you&#8217;ll find there&#8217;s a lot of work you can do that is very simple. That if you implement rigorously and consistently, you will really massively improve everything about your business relationships and thus, everything about your business because in the end, I think everything is driven<\/p>\n<p>31:00<br \/>\nBy relationships, even if you&#8217;re selling physical widgets online, you&#8217;re selling widgets to people. They are made by people and people are on the other end of the Amazon system. There are people not numbers. And if we never forget that we&#8217;re going to stand out ahead of those who do forget it. Thanks so much for listening speech in the next show.<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n<h3><strong>Watch my discussion of Building Relationships in e-Commerce<\/strong><\/h3>\n<p>[video_page_section type=&#8221;youtube&#8221; position=&#8221;bottom&#8221; image=&#8221;&#8221; btn=&#8221;light&#8221; heading=&#8221;&#8221; subheading=&#8221;&#8221; cta=&#8221;&#8221; video_width=&#8221;1080&#8243; hide_related=&#8221;false&#8221; hide_logo=&#8221;false&#8221; hide_controls=&#8221;false&#8221; hide_title=&#8221;false&#8221; hide_fullscreen=&#8221;false&#8221;]https:\/\/www.youtube.com\/watch?v=HmxD04WsN9M&#038;feature=youtu.be[\/video_page_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F329.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F329-building-relationships-in-e-commerce%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/329.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6516-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/329.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"329.mp3\">Download<\/a> (Duration: 39:38 &#8212; 27.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 39:38 &#8212; 27.2MB)Subscribe: Spotify | Email | RSSTHE EMOTIONAL BANK ACCOUNT “We all know what a financial bank account is. We make deposits into it and build up a reserve from which we can make withdrawals when we need to. An Emotional Bank Account is a metaphor that describes [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":6517,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[4],"tags":[1853,1295],"class_list":["post-6516","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-amazon-fba","tag-amazing-fba-podcast","tag-building-e-commerce-relationships","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Building Relationships in e-Commerce - 7 habits of Highly effective people<\/title>\n<meta name=\"description\" content=\"“We all know what a financial bank account is. An Emotional Bank Account is a metaphor that describes the... trust that’s been built up in a relationship.&quot;\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Building Relationships in e-Commerce - 7 habits of Highly effective people\" \/>\n<meta property=\"og:description\" content=\"“We all know what a financial bank account is. An Emotional Bank Account is a metaphor that describes the... trust that’s been built up in a relationship.&quot;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-05-30T16:36:38+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-13T04:58:07+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/329.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"35 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"#329 Building Relationships in e-Commerce (Based on “7 habits of Highly effective people”) Part TWO\",\"datePublished\":\"2019-05-30T16:36:38+00:00\",\"dateModified\":\"2020-05-13T04:58:07+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/\"},\"wordCount\":7347,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/329.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"Amazing FBA Podcast\",\"Building e-Commerce Relationships\"],\"articleSection\":[\"Amazon FBA Private Label\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/\",\"url\":\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/\",\"name\":\"Building Relationships in e-Commerce - 7 habits of Highly effective people\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/329.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-05-30T16:36:38+00:00\",\"dateModified\":\"2020-05-13T04:58:07+00:00\",\"description\":\"“We all know what a financial bank account is. An Emotional Bank Account is a metaphor that describes the... trust that’s been built up in a relationship.\\\"\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/329.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/329.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"Building e-Commerce Relationships\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"#329 Building Relationships in e-Commerce (Based on “7 habits of Highly effective people”) Part TWO\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Building Relationships in e-Commerce - 7 habits of Highly effective people","description":"“We all know what a financial bank account is. An Emotional Bank Account is a metaphor that describes the... trust that’s been built up in a relationship.\"","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/","og_locale":"en_GB","og_type":"article","og_title":"Building Relationships in e-Commerce - 7 habits of Highly effective people","og_description":"“We all know what a financial bank account is. An Emotional Bank Account is a metaphor that describes the... trust that’s been built up in a relationship.\"","og_url":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-05-30T16:36:38+00:00","article_modified_time":"2020-05-13T04:58:07+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/329.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"35 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"#329 Building Relationships in e-Commerce (Based on “7 habits of Highly effective people”) Part TWO","datePublished":"2019-05-30T16:36:38+00:00","dateModified":"2020-05-13T04:58:07+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/"},"wordCount":7347,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/329.png?fit=1280%2C720&ssl=1","keywords":["Amazing FBA Podcast","Building e-Commerce Relationships"],"articleSection":["Amazon FBA Private Label"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/","url":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/","name":"Building Relationships in e-Commerce - 7 habits of Highly effective people","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/329.png?fit=1280%2C720&ssl=1","datePublished":"2019-05-30T16:36:38+00:00","dateModified":"2020-05-13T04:58:07+00:00","description":"“We all know what a financial bank account is. An Emotional Bank Account is a metaphor that describes the... trust that’s been built up in a relationship.\"","breadcrumb":{"@id":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/329.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/329.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"Building e-Commerce Relationships"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/329-building-relationships-in-e-commerce\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"#329 Building Relationships in e-Commerce (Based on “7 habits of Highly effective people”) Part TWO"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/05\/329.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-1H6","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6516","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=6516"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6516\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6517"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=6516"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=6516"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=6516"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}