{"id":6553,"date":"2019-06-07T21:34:16","date_gmt":"2019-06-07T20:34:16","guid":{"rendered":"https:\/\/amazingfba.com\/?p=6553"},"modified":"2020-05-13T05:48:16","modified_gmt":"2020-05-13T04:48:16","slug":"330-10-mindset-learnings-for-e-commerce-entrepreneurs","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/","title":{"rendered":"#330 “What 10 learnings have you had about the 7 Habits since the book’s release”?"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F330.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F330-10-mindset-learnings-for-e-commerce-entrepreneurs%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/330.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6553-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/330.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"330.mp3\">Download<\/a> (Duration: 48:27 &#8212; 39.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><h2><strong>1. The importance of understanding the difference between principles and values.   <\/strong><\/h2>\n<p>Principles are natural laws that are external to us and that ultimately control the consequences of our actions. Values are internal and subjective and represent that which we feel strongest about in guiding our behavior.<\/p>\n<p>Values govern people’s behavior but principles govern the consequences of those behaviors.<\/p>\n<p>I have come to believe that <strong>humility is the mother of all virtues<\/strong>. Humility says we are not in control, principles are in control, therefore we submit ourselves to principles.<\/p>\n<p>Pride says that we are in control, and since our values govern our behavior, we can simply do life our way. We may do so but the consequences of our behavior flow from principles, not our values. Therefore we should value principles.<\/p>\n<p><!--more--><\/p>\n<h2><strong>2. The Universal nature of principles<\/strong><\/h2>\n<p>I have come to see the universal nature of the principles undergirding this material. <strong>Illustrations and practices may vary and are culturally specific, <\/strong>but the principles are the same. I have found the principles contained in the 7 Habits in all six major world religions.<\/p>\n<p>There is an internal sense of the principle of justice or win\/win.<\/p>\n<p>There is an internal moral sense of the principle of responsibility, of the principle of purpose, of integrity, of respect, of cooperation, of communication, of renewal. These are universal. <strong>But practices are not. They are situationally specific<\/strong>. Every culture interprets universal principles in unique ways.<\/p>\n<h2><strong>3. Organizational implications<\/strong><\/h2>\n<p>I have come to see the organizational implications of the 7 Habits, although, in the strict technical sense, an organization does not have habits. <strong>Its culture has norms or mores or social codes<\/strong>, which represent habits.<\/p>\n<p>“An organization also has established systems, processes, and procedures. These represent habits. In fact, in the last analysis, all behavior is personal.”<\/p>\n<h2><strong>4.Which habit to learn first<\/strong><\/h2>\n<p>You can teach all 7 Habits <strong>by starting with anyone habit<\/strong>. And you can also teach one habit in a way that leads to the teaching of the other six. It’s like a hologram where the whole is contained in the part and the part is contained in the whole.<\/p>\n<h2><strong>5. Start with the outside challenge (<em>then <\/em>take the inside-out approach)<\/strong><\/h2>\n<p>Even though the 7 Habits represents an inside &#8211; out approach, it works most successfully when you start<strong> with the outside challenge and<\/strong> then take the inside &#8211; out approach.<\/p>\n<p>In other words, if you are having a relationship challenge, say a breakdown of communication and trust, this will define the nature of the needed inside &#8211; out approach in winning the kind of private victory that enables the public victory meeting that challenge. This is the reason I often teach Habits 4, 5, and 6 before I teach Habits 1, 2, and 3.<\/p>\n<h2><strong>6. Interdependence is much harder than independence<\/strong><\/h2>\n<p>Interdependence is ten times more difficult than independence.<\/p>\n<p>It demands so much more mental and emotional independence to think win\/win when another person is into the win \/lose, to seek to understand first when everything inside you cries out for understanding and to search for a better third alternative when compromise is so much easier.<\/p>\n<p>In other words, to work successfully with others in creative cooperative ways requires an enormous amount of independence, internal security, and self &#8211; mastery.<\/p>\n<p>Otherwise, what we call interdependency is really counter-dependency where people do the opposite to assert their independence or <strong>codependency where they literally need the other person’s weakness to fulfill their need and to justify their own weakness.<\/strong><\/p>\n<h2><strong>7. A simple summary of 1st 3 and next 3 habits<\/strong><\/h2>\n<p>You can pretty well summarize the first three habits with the expression “make and keep a promise.<\/p>\n<p>”And you can pretty well summarize the next three habits with the expression<\/p>\n<p>“involve others in the problem and work out the solution together. ”<\/p>\n<h2><strong>8.Powerful New Code\/language of the 7 Habits<\/strong><\/h2>\n<p>The 7 Habits represents a new language even though there are fewer than a dozen unique words or phrases.<\/p>\n<p>This new language becomes a code, a shorthand way of saying a great deal.<\/p>\n<p>When you say to another “ Was that a deposit or a withdrawal? ” “ Is that reactive or proactive? ” “ Is that synergistic or a compromise? ” “ Is that win\/win or win\/lose or lose\/win? ” “ Is that putting first things first or second things first? ” “ Is that beginning with the means in mind or the end in mind? ”<\/p>\n<h2><strong>9. Integrity is a higher value than loyalty<\/strong><\/h2>\n<p>Integrity is a higher value than loyalty. Or better put integrity is the highest form of loyalty. Integrity means being integrated or centered on principles, not on people, organizations, or even family.<\/p>\n<p>You will find that the root of most issues that people are dealing with is “ is it popular (acceptable, political), or is it right ?”<\/p>\n<p>When we prioritize being loyal to a person or group over doing what we feel to be right, we lose integrity. We may temporarily gain popularity or build loyalty, but, downstream, this loss of integrity will undermine even those relationships.<\/p>\n<p>In a sense, the first three habits represent integrity and the next three loyalty; but they are totally interwoven. Over time, integrity produces loyalty.<\/p>\n<p>It’s better to be trusted than to be liked.<\/p>\n<h2><strong>10. Living the 7 Habits is a constant struggle<\/strong><\/h2>\n<p>Living the 7 Habits is a constant struggle for everyone. Everyone falters from time to time on each of the seven and sometimes all seven simultaneously. They really are simple to understand but difficult to consistently practice. They are common sense but what is common sense is not always common practice.<\/p>\n<p>Any airplane is off track much of the time but just keeps coming back to the flight plan. Eventually, it arrives at its destination. This is true with all of us as individuals, families, or organizations. The key is to have an “ End in Mind ” and a shared commitment to constant feedback and constant course correction.<\/p>\n<p>…if there were some other desirable characteristics you would like to make into a habit, you would simply put that under Habit 2 as one of the values you are trying to live by.<\/p>\n<p>In other words, if punctuality is a desirable trait you want to make a habit, that would be one of the values of Habit 2. So no matter what else you came up with you would put it under Habit 2, your value system.<\/p>\n<p>Habit 1 is the idea that you can have a value system, that you can choose your own value system . Habit 2 is what those choices or values are and Habit 3 is to live by them. So they are very basic, generic, and interconnected.<\/p>\n<h2><strong>Related thoughts<\/strong><\/h2>\n<h3><strong>Effectiveness vs. Greatness<\/strong><\/h3>\n<p>Being highly effective as individuals and organizations are no longer optional in today’s world — it’s the price of entry to the playing field. But surviving, thriving, innovating, excelling and leading in this new reality will require us to build on and reach beyond effectiveness.<\/p>\n<p><strong>If you had it to do over again, what is the one thing you would do differently as a businessperson? <\/strong><\/p>\n<p>I would do more strategic,<strong> proactive recruiting and selecting<\/strong>.<\/p>\n<p>I am convinced that when recruiting and selecting is done strategically, that is, thinking long &#8211; term and proactively, not based upon the pressures of the moment, it pays enormous long &#8211; term dividends.<\/p>\n<p>When you are buried by the urgent…it is so easy to put people that appear to have solutions into key positions. The tendency is… not to do <strong>“due diligence,” <\/strong>nor is it to <strong>carefully develop the criteria that need to be met in the particular roles or<\/strong> assignments.<\/p>\n<p>Someone once said, “ That which we desire most earnestly we believe most easily.”<\/p>\n<p>You really have to look deeply into both character and competence because eventually, downstream, flaws in either area will manifest themselves in both areas. I am convinced that although<strong> training and development is important, recruiting and selection are much more important.<\/strong><\/p>\n<hr \/>\n<h2>Transcript<\/h2>\n<p>Hello and welcome to amazing FBA. This is your host of Michael vz today we are doing another episode based around Stephen Covey&#8217;s The Seven Habits of Highly Effective People. Why are we doing yet another episode on this? You may ask Do I read no other books? No, I read a lot of business books. And we will be going over those more or in some ways more strategic or geared to bigger businesses or more fast growing businesses in the new 10 k collective podcast. By the way, if you want to check that out, go to amazing FBA calm forward slash 10 K, and you&#8217;ll find links to the technical editor podcast and you&#8217;ll be able to sign up to our email list to get advanced versions of the audio uncut audio if you like from us before the general public gets it. Anyways. So yes, we&#8217;ve got other book valuations coming up, but I think that sounds<\/p>\n<p>habits is a fantastic book because it summarizes what on one hand should be, as covey himself says common sense. But as they say common sense isn&#8217;t common. And also just because something is simple doesn&#8217;t mean it&#8217;s not worth re articulating very, very frequently. In fact, one of the things that emerges from various books which could be said to be more geared to the sophisticated business seller on the surface like Jim Collins Greater Good to Great or great by choice, or Vern harnesses scaling up, which are wonderful books that I have been reading recently. One thing that emerges from that is the importance in leadership terms of having very few simple principles which you then re articulate, you know, I repeat very, very, very frequently and to do hardwire them into your business. And one of the things that great businesses have is exactly that. For example, Jeff Bezos, one of his jobs at Amazon apart from being incredibly sophisticated, doesn&#8217;t very simple things. He keeps reality<\/p>\n<p>Waiting for the investors for consumers, Amazon&#8217;s consumers, and indeed pharmacies, employees to keep hearing the same message, which is that customers want faster delivery, more product selection, and lower prices. And they&#8217;ve consistently done things, lots of clever things over the decades. But mostly it&#8217;s been geared to functioning one of those functions to fulfilling one of those functions, I should say. So this is not just for baby businesses or for beginners. This is a mindset that I think has to apply to the highest level businesses in the world as well. So I make no apologies for the Seven Habits coming back. This is a particularly interesting one at the end of the new edition of the book, the latest one that I&#8217;ve been reading, there are some really good questions that people have put to cover and one of which is what 10 learnings Have you had about the Seven Habits since the book&#8217;s release? Which I did have one there exactly. Ask him but sometime in the late 2000s 2010,<\/p>\n<p>maybe an idea<\/p>\n<p>years ago, so probably three decades or more of experience that we&#8217;re talking about here for somebody who reflected very deeply about life. So I think incredibly valuable 10 lessons on life and business from Stephen Covey. Okay the first learning is the importance of understanding the difference between principles and values. We talked about this in one of the other episodes. If you want the Show Notes for this episode, go to amazing FBA. com forward slash 331. And you can get all the show notes there including will tell you how to get the link to episodes there are several episodes now about the seven habits. So the importance of understanding the difference between principles and values principles as covey our natural laws that are external to us and that ultimately control the consequences of our actions and values by internal and subjective and represent that which we feel strongest about in guiding our behavior. Values govern people&#8217;s behavior, but principles govern the consequences.<\/p>\n<p>of those behaviors. Very, very interesting statement. You can have the value for example of profit at all costs. And I think revenue at all costs is extremely common in e commerce generally on Amazon, particularly, especially for newbies, and we&#8217;ve all been there, myself included, but one of the principles of good business is it needs to be profitable. As they say, turnover is vanity. Profit is sanity. cash is king. And if that&#8217;s a trite little phrase, but I think it is a basic principle and if you ignore that, then your value of business growth at all costs or revenue at all costs is going to start competing with the reality of having to value profits. Another thing that you might value more than other things is profits. At the expense of customers getting a good results you might be prepared prepared is a value to full customers. And I do know several friends of mine who are very sales oriented to a very, very fraudulent or at least say friends. I&#8217;m going to<\/p>\n<p>became acquaintances gradually as this emerged, but there are either frozen or just rather over focus on just winning business at the expense potentially of the customer. I just don&#8217;t think that&#8217;s sustainable because the principle of integrity and links with that of building a reputation. In other words, you can&#8217;t really build a reputation by treating people badly or rather, you do a bit of reputation, you build a reputation for building bad relationships. That&#8217;s one of the examples I mean, so I really think this is true and and there is a big difference between principles and values. That&#8217;s an excellent phrase, I&#8217;m going to say it again. So good values govern people&#8217;s behavior, but principles given the consequences of those behaviors.<\/p>\n<p>I&#8217;ve come to believe said covey that humility is the mother of all virtues. Humility says that we are not in control principles are in control. Therefore we submit ourselves to principles. Pride says that we are in control. And since our values govern our behavior, we can simply do life our way<\/p>\n<p>We may do so. But the consequences of our behavior flow from principles, not our values, therefore, we should value principles. And again, this is such a classic mistake in business, particularly for clever people who&#8217;ve done well, which is a great thing to celebrate. But to think that therefore, you can control the future even if you can you believe you can predict it accurately, which is very hard to do in real life because there are so multifactorial things. Can you predict Brexit result? For example, could you predict Trump? Could you predict that the trade war would kick back off recently, despite Trump making noises that it was all over? Those things are very hard to predict? And if we could all do that we&#8217;d all be multi billionaires. But that&#8217;s not how life works. Multi billionaires actually don&#8217;t become multi billionaires mostly by predicting or controlling the world but recognizing what they do control, such as their actions, the direction of travel, they take their companies in, but they don&#8217;t control the marketplace. And I think the difference between what we do control and what we don&#8217;t control<\/p>\n<p>There&#8217;s an absolutely profound thing to be aware of. Sometimes people have negative thoughts where they don&#8217;t think they&#8217;re in control of anything at all. And I think that&#8217;s not true either. And that&#8217;s another sort of defects of character in a, you know, rather sort of fatalism, maybe a valley for some people you know, that they believe in. I don&#8217;t think that&#8217;s a helpful one for entrepreneurs either. But I think being realistic about the fact that principles are what really govern things cause and effect relationships, then you can start to work within how reality works, not trying to impose your will on it, nor give up I just think what you&#8217;re in charge of, you should work really hard on and what you&#8217;re not in charge of what you&#8217;re not in control of. You should be humble about that I couldn&#8217;t agree more with covey and I think that ties in with the really super successful people that I know. They work very, very hard on what&#8217;s under their control and they don&#8217;t sweat about everything else. Number two, the universal nature of principles.<\/p>\n<p>Covey says, I have come to see the universal nature of the principles undergirding this material.<\/p>\n<p>illustrations and practices may vary and are culturally specific, but the principles are the same. I found the principles contained in the seven habits in all six major religions major world religion says Covey,<\/p>\n<p>there is an internal sense of the principle of justice or when when there is an internal moral sense of the principle of responsibility and the principle of purpose, integrity, respect, cooperation, communication, renewal, these are universal, but practices are not they are situationally specific. Each culture interprets universal principles in unique ways. That&#8217;s what covey had to say. fascinating idea. I don&#8217;t know if I have a broad enough experience compared to Kathy&#8217;s incredible experience of going around the world for decades implementing his teaching. Certainly there are culturally specific differences between the cultures that I&#8217;m familiar with, which is I guess, to a degree American online business British certainly in a ways<\/p>\n<p>Germans, who I know more from my old days in music, and the Chinese who I have a vague knowledge of through my interactions with Chinese suppliers, but there&#8217;s certainly very, very different culturally specific ideas that ranges from the superficial For example, we say trousers and the American say pants, that that can lead to some entertaining situations. But I think also there are there is a culture of celebrating wins in America, there&#8217;s a culture almost of celebrating losses in the UK or trying to keep your head down and not get criticized. And this is one of those things that changes culturally, but I think somebody who&#8217;s not honest, somebody lacks integrity in most cultures is not admired. Now, there are some profound differences. I think Mainland China has some pretty different cultural norms from most of the West that I&#8217;m familiar with. And the idea of being completely honest in business negotiations may not be such a strong tradition there. What I think you can say is that the idea of risk<\/p>\n<p>portability of purpose integrity, respect, cooperation, communication. Those are things that everyone&#8217;s going to appreciate in your behavior. I&#8217;ve certainly found that everyone appreciates integrity. If you say you&#8217;re going to do something, you do it but communicating properly, and treating people with respect and part of respect is recognizing differences, and recognize that people work in different ways. So I think in every business dealing you do you should keep high standards of personal behavior. I just think you&#8217;re going to get a better result that way, it seems more professional apart for anything else. There&#8217;s nothing more petty seeming than somebody throwing their toys out of the pram and yes, very famous business leaders like Steve Jobs and or job sorry. And even the great<\/p>\n<p>Jeff Bezos himself famously through the times out of the pram from time to time, but that is actually a weakness counterbalanced by huge strengths. Plus they are big, powerful CEOs. They can kind of do what they want to appoint. That&#8217;s not true of your me so I think it never goes out of style to work within a good<\/p>\n<p>framework of being responsible if you say you&#8217;re going to do something doing it, of being respectful of cooperating with people, and equally respecting the fact that people express that in different ways, and I think sometimes the Brits and the Americans can be very, very bad at trying to impose their own cultural norms on other countries. And that&#8217;s a shame because I think if you take a bit of time and effort to understand the other side, then you will get a much better result. And I guess that comes back to one of these principles, which is seek first to understand then be understood, which we will be covering in a separate podcast episode. Next one, number three organizational implications. This is fascinating, of course, for anyone who&#8217;s building a business, covey says I have come to see the organizational implications of the Seven Habits although in the strict technical sense, an organization does not have habits, its culture has norms or mores or social codes, which represent habits. That&#8217;s a fascinating statement. Let&#8217;s look at that. Ultimately have<\/p>\n<p>are a sense of personal leadership and the way you personally interact with everyone around you. So of course, that will set the tone for everyone around you, Steve Jobs was a screamer and the sort of perfectionist and I guess that probably said, very perfectionist creative, but very stress, heady culture around him. Now, I didn&#8217;t work for Apple back in the day and nor do I now. So I don&#8217;t have the inside track on that I do know that you will generally set the tone for the organization. And what&#8217;s very interesting is norms or mores or social codes represent habits and that&#8217;s quite different from you writing something formal, like a mission statement or an SAP. There&#8217;s the famous standard operating procedure that nearly all entrepreneurs at least Amazon sellers got very, very obsessed with a while ago and probably still are. And yes, it&#8217;s good to have standard ways of doing things. But that&#8217;s not a substitute for habits. For example, a habit or a norm of your culture might be to ignore what&#8217;s written and just freestyle it which may be good or bad depending on the instincts and quality of your people. For example,<\/p>\n<p>So that&#8217;s a cultural difference. And fascinating point. Covey also says an organization also has established systems, processes and procedures, these represent habits. In fact, in the last analysis, all behavior is personal. So once again, he&#8217;s emphasizing that really it comes down to personal responsibility. But an organization has systems, processes, procedures, they can become habits, but again, only if the culture of your organization is to follow them. I mean, some places have very rigid sort of culture. And that works for them. Some places have raised a free willing culture and that can work as well. I suspect probably you need a blend between some firm discipline but not too many rules to follow. I think probably, it&#8217;s important to have discipline. I suspect that that&#8217;s very strongly correlated with good outcomes certainly seems to be amongst the people that I know who&#8217;s successful and these organizations are and also it&#8217;s correlated with that as well. with Jim Collins is great by choice book which is for organizations growing in very<\/p>\n<p>uncertain times, which I&#8217;m definitely going to be doing, probably several episodes about at some point on the 10 k collective podcast because it&#8217;s so incredibly powerful and relevant to those of us in the fast moving online world. Number four, the question of which habit to learn first comes up and covey says, you can teach all seven habits by starting with any habit, very interesting. And he says, You can also teach one habit in a way that leads to the teaching of the other six. It&#8217;s like a hologram where the hole is contained in the part and the part is contained in the hope. Again, really profound thoughts, just to remind is probably appropriate at this point of what the seven habits are. So he splits things up into three basic areas. One is private victory, moving from dependence to independence, the next three habits are our habits four to six are about moving from independence to interdependence, and what equals public victory. And then habit seven, surrounds everything. So the first habit is beat.<\/p>\n<p>Correct. The second habit is begin with the end in mind the third habit is put First things first. And the fourth habit is think Win win. So those first three habits be proactive begin with the end in mind and put First things first are private victory. They&#8217;re about you and personal leadership getting you from dependence to independence. The fourth is think when when the fifth is seek first to understand then to be understood and the sixth is synergies. And that leads to what can be called the public victory or the journey from independence to inter dependence in other words, into personal relationships. And then the seventh habits surrounds all of those which is sharpen the sore, which is basically about keeping yourself in shape physically, emotionally, mentally, and of course practicing the habits daily and weekly and developing and deepening your practice of those are indeed any other good ways of thinking or being. By the way, we have done episodes on the first four habits and to get all the details on this get the go to the show notes amazing fba.com<\/p>\n<p>voiceless 331. So, that is a summary of what covey is referring to here. So which habits to learn first, you can start with any of them. For example, you could start with thinking when when, when you go into negotiation with your supplier. Adam Hudson has a very interesting take on this. Normally f1 wants to when I say everyone, I mean that the buyers, so for us, the Amazon sellers, but we&#8217;re buyers from the suppliers in China or wherever, wherever that is, conventionally, we would expect to go in and knock down the price that this blog offers us now Adam Hudson has an insane way of turning that on its head, and they give him a cost for a product. And then Adam goes back and says, Look, if I give you 20% more than then you offered me, what can you do to make this the best product you can produce? And normally you have to say that twice or three times because the suppliers miss anything if they&#8217;ve misunderstood because everyone negotiates down, maybe 20%, maybe 50%. But what an interesting way to approach things and Adam Hudson certainly done a good job on his students.<\/p>\n<p>One of whom I&#8217;ve worked with very intensively recently, in the last, the last year on and off as a consulting client, they do pretty well because they have a very quality first approach, which I think is more important than ever when it comes to Amazon and competing. So that&#8217;s very, very smart. And that&#8217;s an example of thinking when when another thing you might start with is putting First things first, you know, in your daily actions, your weekly timetable your quarterly plan for your business goals. And of course, in order to put First Things First I need to start to work on most important things before you work on the less important things you need to define what is most important and by doing that, of course, you are beginning with the end in mind habit to and of course, the fact that you&#8217;re doing it at all means you&#8217;re being proactive. I have it one right. So very interesting. I mean, you can you can play with all of this stuff, but very, very interesting point and very heartening as well. So instead of being perfectionist about it, it&#8217;s a question of like, get the newest thing and start which is always good advice. When you<\/p>\n<p>starting something good and worth worthwhile talking of that. The fifth inside that cubby has remember that when he&#8217;s responded to the question, what 10 learnings to be had about the Seven Habits since the books released? Well, the fifth learning, he said was start with the outside challenge, then take the inside out approach. Very, very interesting. Here&#8217;s what covey has to say it. Even though the Seven Habits represents an inside out approach says Covey, it works most successfully when you start with the outside challenge, and then take the inside out approach. In other words, if, for example, you&#8217;re having a relationship challenge, say a breakdown of communication and trust, this will define the nature of the needed inside out approach in winning the kind of private victory that enables the public victory to meet that challenge. This is the reason I often teach habits four, five and six before I teach habits, one, two, and three. That&#8217;s really fascinating that the man who wrote the book in this order for that reason, found that in practice you often had to teach<\/p>\n<p>The more external habits first. And that&#8217;s really very interesting. Now that sort of ties in with my experience, which is really when people want, what they think they need the external things. For example, in FBA, they think they need to know what product to sell. And I would say that&#8217;s very interesting. let&#8217;s reverse engineer from that. And then they realized they need to think about what keyword niche they would, would be selling into, which may or may not relate to the product name. For example, if you&#8217;re selling a back scratcher to deal with an itchy back, people might put the word issue back in or they might put back scratcher. But the point is, that&#8217;s,<\/p>\n<p>that&#8217;s the way that people express themselves. You need to understand that and then behind that as a person, so you need to understand the person and the pain they have. So I actually think you need to understand the person that you&#8217;re trying to serve. First, who are they what&#8217;s their pain, then you need to understand the competition within the sort of search term or niche of search terms or keywords, whatever you want to call them.<\/p>\n<p>Only then do you want to start thinking about the physical product as a solution to that if indeed, it&#8217;s a good idea to go into it. So that&#8217;s an example of where I think you actually need to start with something different from where most people want to start. So sometimes you need to start on the outside and work your way back in very, very interesting. You having a relationship challenge quite often it&#8217;s because you&#8217;re, you&#8217;re too insecure, in your own view, to accept that there might be a different view in life, right? And I say this as myself as well. If I ever get into an argument about politics or ways of doing business or whatever else it may be, it&#8217;s often because I really should be, you know, working on being more secure in my own views and the fact that I can then tolerate the fact that there&#8217;s different ways of seeing things and that&#8217;s not a problem, but very, very interesting that covey himself should come up with that idea.<\/p>\n<p>Learning number six is interdependence is much harder than independence. interdependence says covey is 10 times more difficult than independence. It demands so much more mental and emotional energy.<\/p>\n<p>pendants to think when when, when the other person is in to win lose, to seek to understand first when everything inside your cries out for understanding and to search for a better third alternative, when compromise is so much easier, in other words is covered to work successfully with others in creative cooperative ways, requires an enormous amount of independence, internal security, and self mastery. Very, very interesting. I think that&#8217;s true. I mean, I think the more internal security people have in self mastery, the easier they are going to be to work with and the user they&#8217;re going to find success with others. I mean, it&#8217;s normally the insecure person that starts throwing their way around and, and to my shame. I admit, that has been me at times. Sometimes I&#8217;ve done that. I&#8217;ve been a bit of harsh in even running up my beloved masterminds who I really like. And I&#8217;m sad about that. Sometimes I get too stressed about time management or something and forget to value the relationship. Sometimes I&#8217;ve done that as a conductor in the past as well. So maybe I have a tendency to you know,<\/p>\n<p>fluffy handle a bit when I think feel things are getting out of control. And that&#8217;s an internal feeling really that things need to stay under control. And that can be very true in people&#8217;s relationships with suppliers in Amazon businesses. And I&#8217;ve certainly had many crosswords my suppliers over the years, and it&#8217;s understandable, you get frustrated if Chinese factory produces goods that you think are simply below an acceptable quality level. But then there is a big cultural difference in what I think is quality and what they think is quality. So that&#8217;s just a bridge that I have to get to span. And that&#8217;s up to me to spend it. And<\/p>\n<p>it&#8217;s certainly true that you are utterly dependent on a good supplier. I mean, on the other hand, you&#8217;re not just dependent on one supplier, you can change suppliers. But for sure, this is not a business model. Private labeling is not a business model, which enables anyone to act in total isolation is just not possible. And to be honest, most business doesn&#8217;t really lend itself to the only way but it certainly isn&#8217;t possible with private labeling and in addition to what covey says<\/p>\n<p>Is this otherwise he says what we call interdependency is really counter dependency, where people do the opposite to assert their independence, or codependency, where they literally need the other person&#8217;s weaknesses to fulfill their need and to justify their own weakness. And it&#8217;s very nice in a way in our business model with private labeling or even custom manufacturing to turn around and just bitch and moan at suppliers and have a scapegoat for the fact that we probably didn&#8217;t do our due diligence properly in the first place soon so why are you working with the wrong supplier in the first place? That&#8217;s your decision not theirs? Why are you Why did you approve a production process that is inadequate? Why did you not do some quality control specifications before you made your purchase order? Why did you not do some quality control at the other end before shipping? Those are the things that we should be doing taking responsibility for, for ourselves as sellers before we stop blaming other people, and yeah, blaming other people can feel very morally justified and everyone<\/p>\n<p>indulges including that the biggest CEOs in the world, I&#8217;m quite sure, but guess what, it&#8217;s never the strong option. And it&#8217;s never the productive option. Because what it&#8217;s saying is you&#8217;re putting the responsibility and the power outside of yourself on to somebody else. And the truth is, that&#8217;s never going to go in the direction you want, you always got to focus on where you have influence. And if you feel your supplier isn&#8217;t working the way you should, then I would suggest those two things. Number one, you work in a different way with them, and you work to communicate better and get more control over what you do control if you don&#8217;t pay them before you&#8217;ve checked the quality, for example, or don&#8217;t pay them all of their money. And the other thing is you can walk away and get another supplier. So those are the two basic things that we have under our control. And I really think it&#8217;s critical to focus on that. And a great sign of becoming codependent is when you start bitching about how crappy your treatment is by Amazon, or how badly your supplier has done with your products. I mean, both of them could be 100% true, but by focusing on that you&#8217;re focusing on things out of your control and<\/p>\n<p>Instead of just going well, I have to accept that however better that pill to swallow and focus on what is under my control, like writing a plan of action for Amazon, if they suspend your account, like improving the metrics on your listings, if they&#8217;ve suspended a listing, like contacting them at you know, 100 times if they don&#8217;t give you competent customer service the first 99 times, and with suppliers, we talked about what you can do, there&#8217;s lots of things you can do so, very, very interesting and absolutely agree with everything can be saying here about interdependence very much had an independence but very, very much work working for as well.<\/p>\n<p>What 10 learnings Have you had about the Seven Habits since the book&#8217;s release? There was the question put to covey and the seventh one is pretty simple summary of the first and next three and the first three and the next three habits you can pretty well summarize says covey the first three habits are the expression make and keep a promise. And you can pretty much summarize the next three habits with the expression involve others in the program.<\/p>\n<p>The problem sorry and work out the solution together, just to remind you, then, once again, the first three habits. First one, be proactive. Secondly, begin with the end in mind. Thirdly, put First things first, make a promise and keep a promise, I guess, particularly in marketing and, in fact, in your whole business, in any kind of business, but particularly, I think, on Amazon, where the expectations of being created very, very high, possibly artificially high by the environment that Amazon&#8217;s created, have a wonderful experience. Your job is really to make a pretty strong promise which is part of your differentiation from the competition otherwise you cannot stand out. But also to make sure you deliver on it and which is really hard to do which comes down to good marketing or you which promise you do make to which people and great production IE you select your suppliers and you have a production process and a design if you&#8217;re doing unique design product custom designed such that you can fulfill your promise and that&#8217;s pretty much marketing in a nutshell is is finding out what people want promising what they<\/p>\n<p>Really want and then making sure you deliver on your promise. So that&#8217;s a very, very, very relevant thought for us in e commerce.<\/p>\n<p>And then next three habits are think when when seek first to understand and then be understood and synergy eyes, habits four through six. And you can summarize those as involve others in the program in the problem, involve others in the problem and work out the solution together. In other words, when when,<\/p>\n<p>for example, we talked about that example of of Adam Hudson and his approach to Chinese suppliers. You could think lots of other woodwinds I mean, broadly speaking, if you sell lots of units, and you&#8217;re ordering a lot of units from your supply, you win, and the supplier wins. And if you&#8217;re selling good quality products out of value, price, relative to what else is available, then the customer wins as well. So it&#8217;s a win win win if you want to put it that way. Plus, the freight company wins because they get more business from you. Everybody wins. Basically, even the US government gets lots more import tariffs. You may not wish that winter happen, but it will happen. Yeah, I think working out some<\/p>\n<p>meeting together is critical. I mean together, not dumping the problem on your supply and saying it&#8217;s your problems sorted out, nor just trying to solve it all on your own. But collaborating with other people and again, even doubt, especially in the early stages, but not only for the early stages, I just think once again, isolation is a dream killer. I keep saying that, quote, can&#8217;t remember who said it. But it&#8217;s critical that you involve others in workout solution. If you are stuck at the beginning of your journey, and you don&#8217;t know where to go, then get some help with others do not expect a coach or a program or community to solve all your problems for you. That&#8217;s not my job. It&#8217;s not their job. And I will never be able to do that. And I try and be very, very clear with any coaching clients I take on and the odd person that I do actually reject, simply because I get the very strong impression, not just sort of a slight impression, but that they really believe that it&#8217;s my responsibility to make their business work and I don&#8217;t think I can do that. I don&#8217;t think it&#8217;s possible. Also, that&#8217;s not the right mentality. It&#8217;s codependent and what we really need to be as interdependent IE<\/p>\n<p>everybody works together towards a common goal. But everyone takes responsibility for their area. And that&#8217;s how I work. So, if you&#8217;re struggling, go find somebody to not barely out and rescue you. Because now we can do that for you, but to help you get where you want to work with you, not instead, not for you, but with you to help you achieve what you want, and you&#8217;re much more likely to succeed in my experience.<\/p>\n<p>The eighth learning that we had from the seven habits in self is the powerful new code or language of the seven habits. The Seven Habits says covey represents a new language even there are fewer than a dozen unique words or phrases. This new language becomes a code a shorthand, way of saying a great deal. When you say to one another, was that a deposit or withdrawal? Is that reactive or proactive? Is that synergistic? Or a compromise is that win, win or win lose or lose when is that putting First things first or second things first, is that beginning with a means in mind, the means in mind or the end in mind that<\/p>\n<p>you&#8217;re communicating in a very powerful way, you&#8217;re reminding each other of the sorts of principles that you should be working on and win, win or win, lose or lose win. Those are very important ways of evaluating any deal you&#8217;ve just done with the supplier with a photographer with a customer, anything you like. I mean, you really need to evaluate everything you do within this language. And the language or the code of it is, is, as you said, a pretty simple way of checking in with each other, especially in a team. So that&#8217;s very, very true. I think I don&#8217;t tend to use this language with people because I don&#8217;t necessarily have yet teams of people who are forced to read the Seven Habits but thinking of it, if I start onboarding some new staff, which I&#8217;m planning to do pretty soon for the podcast, then I&#8217;m probably going to be thinking about required reading it and somewhere along the line, it&#8217;s quite a thick book, but I think if I&#8217;m going to take anyone on even part time and more permanent basis, I will probably pay for them to have some time to read the Seven Habits of Highly Effective People because I think it is that powerful and we can<\/p>\n<p>Then we can start using that code as Sam covey puts it. The next learning number nine is a very interesting one integrity, a higher value than loyalty. This is covey again integrity says covey is a higher value than loyalty or, but it puts integrity is the highest form of loyalty. Integrity means being integrated or centered on principles, not on people, organizations or even family, you&#8217;ll find that the root of most issues that people are dealing with is, is it popular, acceptable political, or is it right? Drake Creek key question there. When we prioritize being loyal to a person or a group over doing what we feel to be right, we lose integrity says Covey, we may temporarily gain popularity or build loyalty. But downstream this loss of integrity will undermine even those relationships. In a sense. The first three habits represent integrity and the next three loyalty but they are totally interwoven over time in tech.<\/p>\n<p>It produces loyalty. last comment from Covey&#8217;s, it&#8217;s better to be trusted than to be liked. It&#8217;s very, very, very thought provoking. I mean, this is a difficult one in business. But I think there&#8217;s a lot to be said for this. I mean, I&#8217;m sure that there are nuances to be hit. But broadly speaking, if you&#8217;re trying to stay loyal to somebody, it probably is driven by wanting to be popular with them. And the trouble is, if what they&#8217;re asking you to do is out of integrity, it&#8217;s not going to go in a great direction. I mean, there may be even a case for just moving away from relationships with people who repeatedly request that you damage integrity, and everyone else has a everyone has a personal definition of integrity. I&#8217;m not here to preach what that should be. But I think we all have a reasonable sense of moral compass and know what we think is right wrong. We may choose again values with principles, the first learning that covey talks about but we may choose to ignore principles or moral ideas that we have and that&#8217;s rather different. We may choose to go roughshod over them, but ultimately, what<\/p>\n<p>I think most people have a pretty clear sense of that. So I guess what it comes down to is not letting the need to be liked to be honest, overcome our sense of right and wrong. And that makes sense to me, I just don&#8217;t think it&#8217;s going to be very sustainable. If you&#8217;re doing something that ends up illegal or immoral or is going to damage your reputation long term, you probably need to get out of that situation or change it. And it could be that some difficult conversations are ahead with that business partner, that family member, that person. And that&#8217;s one of those things that we have to have the courage to do. Again, interdependence, pretty challenging at times. It&#8217;s not not all about just finding harmony. It&#8217;s about balancing out what you think is important with the needs of the other person and coming to some kind of new synergy. And that&#8217;s sometimes going to take a lot of time and effort and work and I guess you&#8217;ve got to decide, decide whether it&#8217;s worth it or not, but certainly the courageous path is to try and be true to your values. And I think I&#8217;ve got to say that&#8217;s got to be the right thing to do. So learning<\/p>\n<p>Number 10 from covey is that living the Seven Habits is a constant struggle which is kind of reassuring to hear from the creator of the Seven Habits themselves. Living the Seven Habits says covey is a constant struggle for everyone. Everyone falters from time to time on each of the seven, and sometimes all seven habits simultaneously. They really are simple to understand, but difficult to consistently practice. They are common sense. But what is common sense is not always common practice. An airplane is off track much of the time but keeps coming back to the flight plan. Eventually, it arrives at its destination. This is true with all of us as individuals, families or organizations. The key is to have an end in mind and a shared commitment to constant feedback and constant course correction. Very, very interesting and a humble again, somebody who values humility. That&#8217;s good to hear the truth there. And I think it makes sense that getting off track is called being human. And getting back on track requires a commitment. Well, first, we gotta have a goal. Otherwise there&#8217;s no definition of what is<\/p>\n<p>on or off track anyway, and a lot of us don&#8217;t have as clear goals as we could or should have. I&#8217;m really going through a process now of really trying to dig deep into the purpose and an aim of amazing FBA as a business as a whole, over the next three to five years. And I think it&#8217;s very important to do that, particularly as an established business. If you&#8217;re just starting out, it&#8217;s good not to be pretentious about that. But you should have an aim where you want to go with your business over the next year at least. And the other thing is to have a with a commitment to correcting course frequently and using feedback and that&#8217;s very, very important if you&#8217;re gonna have a goal but if you don&#8217;t have any feedback on whether you&#8217;re there or even your you have it but you&#8217;re not willing to engage with it or share with each other and have difficult conversations at times, whether it be with a business partner or your wife or husband if you&#8217;re trying to start a business and they&#8217;re not necessarily supportive or they may be but they may get less supportive as it takes longer to get to profit then you you would like or even to get to revenue. You know, that requires commitment and courage. And again, you can&#8217;t really go very far without those virtues.<\/p>\n<p>Can we ask a couple of other things to say about developing desirable habits or characteristics. Covey says, if there were some other desirable characteristic you would like him to make into a habit, you would simply put that on a habit to as one of the values you&#8217;re trying to live by habit to just remind you is begin with the end in mind. In other words, a punctuality for example is a desirable trait, you want to make a habit that would be one of the values of habit to some are no matter what else you come up with, you would put it under habit to your value system, have it one is the idea that you can have a value system that you can choose your own value system. Habit two is what those choices or values are. And habit three is to live by them. So they&#8217;re very basic, generic and interconnected. Again, it comes down to the same thing seen from multiple sides and repeated a lot of different ways. But it&#8217;s very hard to fault this stuff. Honestly, I think this is one of the most profound, applicable bits of general business wisdom I&#8217;ve come across that I think really stands the test of time. So<\/p>\n<p>Have a value system choose your values carefully and then try and live by them you can&#8217;t really fault that But again, it&#8217;s easy to say this stuff I think the real art is to consistently interrogate yourself, your business your organization to see if you&#8217;re actually living by this stuff or whether you&#8217;re just giving it lip service. So some very thought provoking stuff from covey about his own Seven Habits I hope that was useful. I find this stuff very, very thought provoking. I don&#8217;t think it provides instant tactical wins is not going to make you rich overnight, but I think it does lay a rock rock solid foundation on which you can build some great business habits and practices which will make you rich and then certainly you&#8217;re not going to get rich by ignoring these principles and if you start acting in a reactive way and depending on Amazon to get you success or depending on your supplier to be perfect without you doing anything about it. For example that is breaking habit one you know being reactive, not proactive, or being codependent rather than independence over the the first three habits you all you need to do is apply<\/p>\n<p>The sort of test of if I did the opposite, would I succeed? And it&#8217;s very quick to see that you wouldn&#8217;t, and therefore, that these habits are in fact valid. And I<\/p>\n<p>hesitate to spend a lot of time on the wrong kinds of quick fix. mindset books, there&#8217;s no substitute for action. But I really think,<\/p>\n<p>right action follows right thought, as the Buddhists say, and I&#8217;m not talking about sort of moralistic Lee or religiously I&#8217;m not qualified to talk about that. But in business, I think that&#8217;s really true. And I think it can be that we get caught up in superficial thought and thrashing around action, but I think deep thought, followed by serious action, and reflection on that is really the way to go. I mean, it&#8217;s very, very interesting to me just how powerful the discipline of monthly meetings most months I mean, not everyone makes everyone but the collective particularly has been meeting pretty regularly now for about 18 months. And I do think there&#8217;s a correlation between people being willing to take that time out to really really think strategically in a deep level. It&#8217;s hard work is intensive.<\/p>\n<p>Work is not a chat. I mean, there is chat over lunch, but it&#8217;s intense. Perhaps thinking is harder work than most people make it out to be. But on the other hand, when they go back to their businesses and implement that stuff, thoughtfully, really debated, really committed to new, deeply held ideas can actually become something that becomes concrete and makes real money. So who knew that that thought is actually very powerful? So I&#8217;m not suggesting is a substitute for action I&#8217;m suggesting isn&#8217;t necessarily indeed very powerful prelude to action, should you choose to accept to that mission? Thanks for listening.<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F330.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F330-10-mindset-learnings-for-e-commerce-entrepreneurs%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/330.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6553-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/330.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"330.mp3\">Download<\/a> (Duration: 48:27 &#8212; 39.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 48:27 &#8212; 39.2MB)Subscribe: Spotify | Email | RSS1. The importance of understanding the difference between principles and values.    Principles are natural laws that are external to us and that ultimately control the consequences of our actions. Values are internal and subjective and represent that which we [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":6557,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[4],"tags":[1296,1853,750,1297,78],"class_list":["post-6553","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-amazon-fba","tag-10-mindset-learnings-for-e-commerce-entrepreneurs","tag-amazing-fba-podcast","tag-ecommerce","tag-lesson","tag-mindset","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>10 Mindset learnings for e-commerce entrepreneurs<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"10 Mindset learnings for e-commerce entrepreneurs\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 48:27 &#8212; 39.2MB)Subscribe: Spotify | Email | RSS1. The importance of understanding the difference between principles and values.    Principles are natural laws that are external to us and that ultimately control the consequences of our actions. Values are internal and subjective and represent that which we [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-06-07T20:34:16+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-13T04:48:16+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/330-1.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"45 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"#330 “What 10 learnings have you had about the 7 Habits since the book’s release”?\",\"datePublished\":\"2019-06-07T20:34:16+00:00\",\"dateModified\":\"2020-05-13T04:48:16+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/\"},\"wordCount\":9173,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/330-1.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10 Mindset learnings for e-commerce entrepreneurs\",\"Amazing FBA Podcast\",\"ecommerce\",\"lesson\",\"mindset\"],\"articleSection\":[\"Amazon FBA Private Label\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/\",\"url\":\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/\",\"name\":\"10 Mindset learnings for e-commerce entrepreneurs\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/330-1.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-06-07T20:34:16+00:00\",\"dateModified\":\"2020-05-13T04:48:16+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/330-1.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/330-1.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"10 Mindset learnings for e-commerce entrepreneurs\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"#330 “What 10 learnings have you had about the 7 Habits since the book’s release”?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"10 Mindset learnings for e-commerce entrepreneurs","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/","og_locale":"en_GB","og_type":"article","og_title":"10 Mindset learnings for e-commerce entrepreneurs","og_description":"Podcast: Play in new window | Download (Duration: 48:27 &#8212; 39.2MB)Subscribe: Spotify | Email | RSS1. The importance of understanding the difference between principles and values.    Principles are natural laws that are external to us and that ultimately control the consequences of our actions. Values are internal and subjective and represent that which we [&hellip;]","og_url":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-06-07T20:34:16+00:00","article_modified_time":"2020-05-13T04:48:16+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/330-1.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"45 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"#330 “What 10 learnings have you had about the 7 Habits since the book’s release”?","datePublished":"2019-06-07T20:34:16+00:00","dateModified":"2020-05-13T04:48:16+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/"},"wordCount":9173,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/330-1.png?fit=1280%2C720&ssl=1","keywords":["10 Mindset learnings for e-commerce entrepreneurs","Amazing FBA Podcast","ecommerce","lesson","mindset"],"articleSection":["Amazon FBA Private Label"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/","url":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/","name":"10 Mindset learnings for e-commerce entrepreneurs","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/330-1.png?fit=1280%2C720&ssl=1","datePublished":"2019-06-07T20:34:16+00:00","dateModified":"2020-05-13T04:48:16+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/330-1.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/330-1.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"10 Mindset learnings for e-commerce entrepreneurs"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/330-10-mindset-learnings-for-e-commerce-entrepreneurs\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"#330 “What 10 learnings have you had about the 7 Habits since the book’s release”?"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/330-1.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-1HH","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6553","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=6553"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6553\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6557"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=6553"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=6553"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=6553"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}