{"id":669,"date":"2016-06-27T10:47:37","date_gmt":"2016-06-27T10:47:37","guid":{"rendered":"http:\/\/amazingfba.com\/?p=669"},"modified":"2020-05-13T07:30:24","modified_gmt":"2020-05-13T06:30:24","slug":"65-ryan-bredemeyer-of-hello-profit-part-1-of-2","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/","title":{"rendered":"#65 Ryan Bredemeyer of Hello Profit &#8211; Part 1 of 2"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FRyan_Bredemeyer_pt1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F65-ryan-bredemeyer-of-hello-profit-part-1-of-2%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Ryan_Bredemeyer_pt1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=669-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Ryan_Bredemeyer_pt1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Ryan_Bredemeyer_pt1.mp3\">Download<\/a> (Duration: 32:40 &#8212; 26.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><b>How did you come to be selling on Amazon?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Ryan was a part of <\/span><a href=\"http:\/\/amazingsellingmachine.com\/\"><span style=\"font-weight: 400;\">ASM<\/span><\/a><span style=\"font-weight: 400;\"> and that what got him started. That’s what really piqued his attention. Ryan says that when he finds something he wants to do he really pushes ahead with it until he learns how to conquer it and ASM got him started on that.<\/span><\/p>\n<p>He did very well on his first product despite it being a very commonly sold product on Amazon. He cites his creative thinking and hard working attitude to his success. He was able to take this generic item and really dominate the market with it. After his initial success, he was itching to expand with it.<\/p>\n<p><span style=\"font-weight: 400;\">From there he met with a good friend, <\/span><b>Nakisha Muhammad<\/b><span style=\"font-weight: 400;\"> and discussed some of the issues he was experiencing. She then became interested in Amazon selling and they went in together on a joint venture. She started seeing those same issues with seller central and limited reporting. She, being a world-class coder, approached Ryan saying she could build a solution. Together they worked on it and came up with their dream ‘seller central’. Thus, <\/span><a href=\"https:\/\/helloprofit.com\/\"><span style=\"font-weight: 400;\">Hello Profit<\/span><\/a><span style=\"font-weight: 400;\">, was born.<\/span><\/p>\n<p><b>What were the problems with seller central that made you feel the need to develop software to replace it?<\/b><\/p>\n<p>In seller central, you see all these revenue numbers and it is extremely difficult to see what you’re actually profiting, even with Quickbooks or Xero. Once you have more than a couple skus, everything gets clumped together. If you launch a new item, it is difficult to see which one is profitable or which variation is actually profitable and which ones are draining you.<\/p>\n<p><b>Can you describe the 3-5 commonest problems Amazon sellers have with profit and loss numbers on Amazon?<\/b><\/p>\n<ol>\n<li><b>Not being able to gauge how you are profiting<\/b><\/li>\n<\/ol>\n<p>As mentioned before it is difficult to see where you are profiting. However, that really isn’t Amazon’s issue. It’s not the chore to make a cohesive solution. Their focus is customer service so there no benefit to them to make this. It’s up to us to understand how our business is doing.<\/p>\n<p><b>2. The Payout Report<\/b><\/p>\n<p>If you have ever downloaded this file, it is a mess. You could have 100,000 records of every little thing and way over on one side it the ascent it’s associated with. It is not humanly possible to go through all that manually, and figure out what’s happening.<\/p>\n<p><b>3. Tracking Promotion Giveaways<\/b><\/p>\n<p>It was difficult to tell how many promotions were given away on each day, and how that affects the bottom line. They give you that widget of like the top 5 promotional items, but if you have 10 or 50, that’s pretty much useless, plus it 24 hours behind or more.<\/p>\n<p><b>How do you deal with Amazon ads costs?<\/b><\/p>\n<p>A new feature that is going to be added to Hello Profit is a wizard that is going to help optimize ads. The purpose of HP is to help you see your real profit. Now. Amazon doesn’t make it easy to see this. So, HP pulls in reports through the API, and the main one is available the morning following today’s numbers. So you can’t see what today is doing, because the day isn’t finished, but you can see any day in the past, which is sufficient to tighten up your ad spending.<\/p>\n<p>So, HP pulls that number in, on the merchant dashboard it deducts that range of ad spend from that range of sales. You can view the numbers from the very top, all the way down to every variation of every product and it pulls the information from every campaign and aggregates it for every product variation.<\/p>\n<p><b>Do you deal with the keyword side of things, or strictly with the profit?<\/b><\/p>\n<p>HP will have a campaign reports so you can see how your campaigns are doing. You choose any product you wish as well as any date range, unlike Amazon which only has a few predefined ranges. You can set thresholds for you ad spend, like amber level, you might be getting out of your comfort zone or red which is like you’re bleeding out. So you can see which keywords are being profitable and which ones you might want to cut.<\/p>\n<p>The biggest takeaway from any of this is that there is fat to trim. You have to look at your daily numbers and find where you’re losing profit. You might not think you have a profit issue but you almost certainly do. It is not in Amazon’s interest to be transparent in how much you’re spending in ads. Whatever tool you use, it is vital to review your numbers.<\/p>\n<p>What if you can tighten things up and save 10%? That’s like launching a whole new product. It is much more efficient to find that profit in your numbers rather than going through a product launch.<\/p>\n<p><b>What are the problems with using a spreadsheet to handle your numbers?<\/b><\/p>\n<p>That’s where Ryan and Nikisha started in the beginning. It is possible to get around 80% of Hello Profit’s functionality with a spreadsheet, IF, you are a master at spreadsheets and are willing to hire a team to handle the spreadsheets, but some of it is too advanced to handle with Excel. And you will end up spending your profits on the team.<\/p>\n<p>There is so much data coming from Amazon, and the reports are so bloated, that it will take a team of spreadsheet experts to go through it all. It is much better to have a tool that can automatically handle the data. If you try to do it manually, you’re probably going to miss something and be off the mark at the end of the day anyway.<\/p>\n<p>You might have $10,000 in inventory and it’s irresponsible to go about it blindly. That’s why it’s important to have a tool that handles this nightmare that way you can get back to being a business owner. Launching products, and expanding your business. And it’s important to outsource tasks that take away from that. So unless you’re an expert programmer and expert in accounting, you’ll need to outsource this. You can’t do everything.<\/p>\n<p><b>What are the biggest mistakes sellers make with Inventory stats?<\/b><\/p>\n<p>Ryan brings up a related issue that HP isn’t the solution for yet, though they hope to be, is the issue of inventory. This is one area you need to be proficient in or find a tool to help you with, because running out of inventory is so damaging to promotions, sales velocity, and making the algorithm happy.<\/p>\n<p>If you’re out of inventory for a week or two weeks, how much does that cost? Can you calculate the cost of running out of inventory for two weeks? Also, on the opposite end, having too much inventory and being charged by Amazon for long-term inventory fees.<\/p>\n<p>You have to consider seasonality, lead times of your suppliers, how long it will take by sea or by air and the costs associated, fudge factors if Amazon decides not to put your time out nine days for whatever reason.<\/p>\n<p>You also have to consider the cost of getting ranked again if you run out of inventory, or even considering how things have changed in the time you’ve been out.<\/p>\n<p>Let’s say you run the same promotional strategy that you did 6 months ago, the fields changed, the algorithm has changed. There’s no guarantee that you’re going to get back to where you were. So it could be a long-term loss because you didn’t act accordingly.<\/p>\n<p>You also need to consider when and how much Amazon pays you out, so you can consider how much inventory you can afford. Hello Profit does this to an extent. It will predict how much you have made so far, and using that determine what your likely payout will be. So if you’re halfway though the payout cycle, just double what your prediction is.<\/p>\n<p><b>What do you personally do in term of projecting cash flow?<\/b><\/p>\n<p>The simplest thing Ryan has found is to go for products that have a high ROI. He likes to do 150% or more. This way he will have made enough to pay it off, cover associated costs, and have enough left over to buy another 1.5x inventory. This puts in some room so that he doesn’t have to be as perfect in his math and leaves enough profit to cover unexpected costs like increase ad spend if there is an increase in competition and has to reduce his retail.<\/p>\n<p>One piece of advice to anyone is to make sure your ROI is solid. If all things stay the same and your demand goes up, as we all want, you’ll be able to buy more inventory than you have ever sold, and not have to pay in again. So each product, not only covers itself, but has groth built in. So if you order 1000 unit, next time you can order 1200.<\/p>\n<p><b>Can you touch on the differences between profit and ROI?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">If you Google the<\/span><a href=\"https:\/\/sellercentral.amazon.com\/fba\/profitabilitycalculator\/index?lang=en_US\"><span style=\"font-weight: 400;\"> FBA revenue calculator<\/span><\/a><span style=\"font-weight: 400;\">, you plug in your competitor&#8217;s products, and it calculates the FBA fees you should have as well, and there is a field to plug in you landed costs. Once you hit calculate, it will hopefully show you a green number on the bottom, which is the anticipated payout to you for one sale. You can take that number then and divide it by your costs to get you ROI.<\/span><\/p>\n<p>Let’s say your anticipated payout is $10 and your total cost is $5.<\/p>\n<p><span style=\"font-weight: 400;\">(10<\/span><span style=\"font-weight: 400;\">5)<\/span><span style=\"font-weight: 400;\">100%=<\/span><span style=\"font-weight: 400;\"> 200% ROI<\/span><\/p>\n<p>This would be a great product. Because there is a lot of room for growth, you can decrease you retail if you need to, you can do a lot of giveaways, you can do promotions and ads, and you will still be profitable and you can still grow as demand grows.<\/p>\n<p><b>How do you find products that have a high ROI?<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Ryan recommends <\/span><a href=\"http:\/\/affiliate.junglescout.com\/idevaffiliate.php?id=945_2\"><span style=\"font-weight: 400;\">Jungle Scout<\/span><\/a><span style=\"font-weight: 400;\">, though Hello Profit comes with many of the same features.  Ryan will go into HP and use Product Genie and search for all kinds of things and over time it aggregates all kinds of data, even things he wasn’t searching for because it happened to show up in the results as well. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">It all goes into a database associated with his account, and he can search against things he didn’t know he had. He usually looks for a certain BSR. He doesn’t mess with sub-100 anymore, but if you can find one that 200-300 or the 1000 range, those are great products. If he can find one that is not too big or heavy, that he has an idea how much shipping will cost. He will take a look on Alibaba and get a rough cost estimate, then use the <\/span><a href=\"https:\/\/sellercentral.amazon.com\/fba\/profitabilitycalculator\/index?lang=en_US\"><span style=\"font-weight: 400;\">calculator <\/span><\/a><span style=\"font-weight: 400;\">to find his ROI. He can find out if this product is worth his time in a couple minutes.<\/span><\/p>\n<p>Look at your competitor that you think has a similar business model and look in their storefront and find other product ideas for yourself. Leverage other people’s research. There are a lot of great products out there that might not have major numbers but a good ROI. Even it they only do 10-13 sales a day, launch 10 of them and you’ll make a good profit with that kind of ROI.<\/p>\n<p class=\"p1\"><span class=\"s1\">HOW TO SUBSCRIBE TO THIS PODCAST<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">A podcast is a free downloadable audio show that enables you to learn while you’re on the go.<span class=\"Apple-converted-space\">  <\/span>To subscribe to my podcast for free, you’ll need an app to listen to the show from.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">For iPhone\/iPad\/iPod listeners – Grab your phone or device and go to the iTunes store and search “Amazing FBA”.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">This will help you to download the free Podcasts App (produced by Apple) and then subscribe to the show from within that app.<span class=\"Apple-converted-space\">  <\/span>Every time I produce a new episode, you’ll get it downloaded right away. <\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">For podcast enthusiasts – If you already listen to podcasts and have a podcatcher that you prefer, the feed you’ll need to add is: http:\/\/ amazingfba.com\/feed\/podcast.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">For those who don’t have a mobile device – You can always listen to the show by clicking the audio file at the top of this page.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">If you have any queries, just go to www.amazingfba.com\/ask<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\"> <\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FRyan_Bredemeyer_pt1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F65-ryan-bredemeyer-of-hello-profit-part-1-of-2%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Ryan_Bredemeyer_pt1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=669-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Ryan_Bredemeyer_pt1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Ryan_Bredemeyer_pt1.mp3\">Download<\/a> (Duration: 32:40 &#8212; 26.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Making Sales on Amazon is one thing. Making Profit however is the goal. So how can you tell if you are making profit? Ryan Bredemeyer of Hello Profit talks through the issues and gives his solutions.  <\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":true,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"#66 Ryan Bredemeyer of Hello Profit - Part 1 of 2","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[4],"tags":[1853,65,337,340,339,149,338,336,96],"class_list":["post-669","post","type-post","status-publish","format-standard","hentry","category-amazon-fba","tag-amazing-fba-podcast","tag-finances","tag-financial-reporting","tag-how-much","tag-how-much-are-you-making","tag-inventory-management","tag-make-money","tag-measuring","tag-profit","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>#65 Ryan Bredemeyer of Hello Profit - Part 1 of 2 - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"#65 Ryan Bredemeyer of Hello Profit - Part 1 of 2 - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Making Sales on Amazon is one thing. Making Profit however is the goal. So how can you tell if you are making profit? Ryan Bredemeyer of Hello Profit talks through the issues and gives his solutions.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2016-06-27T10:47:37+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-13T06:30:24+00:00\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"#65 Ryan Bredemeyer of Hello Profit &#8211; Part 1 of 2\",\"datePublished\":\"2016-06-27T10:47:37+00:00\",\"dateModified\":\"2020-05-13T06:30:24+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/\"},\"wordCount\":2098,\"commentCount\":1,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"keywords\":[\"Amazing FBA Podcast\",\"Finances\",\"financial reporting\",\"how much\",\"how much are you making\",\"inventory management\",\"make money\",\"measuring\",\"profit\"],\"articleSection\":[\"Amazon FBA Private Label\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/\",\"url\":\"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/\",\"name\":\"#65 Ryan Bredemeyer of Hello Profit - Part 1 of 2 - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"datePublished\":\"2016-06-27T10:47:37+00:00\",\"dateModified\":\"2020-05-13T06:30:24+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"#65 Ryan Bredemeyer of Hello Profit &#8211; Part 1 of 2\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"#65 Ryan Bredemeyer of Hello Profit - Part 1 of 2 - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/","og_locale":"en_GB","og_type":"article","og_title":"#65 Ryan Bredemeyer of Hello Profit - Part 1 of 2 - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Making Sales on Amazon is one thing. Making Profit however is the goal. So how can you tell if you are making profit? Ryan Bredemeyer of Hello Profit talks through the issues and gives his solutions.","og_url":"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2016-06-27T10:47:37+00:00","article_modified_time":"2020-05-13T06:30:24+00:00","author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"#65 Ryan Bredemeyer of Hello Profit &#8211; Part 1 of 2","datePublished":"2016-06-27T10:47:37+00:00","dateModified":"2020-05-13T06:30:24+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/"},"wordCount":2098,"commentCount":1,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"keywords":["Amazing FBA Podcast","Finances","financial reporting","how much","how much are you making","inventory management","make money","measuring","profit"],"articleSection":["Amazon FBA Private Label"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/","url":"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/","name":"#65 Ryan Bredemeyer of Hello Profit - Part 1 of 2 - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"datePublished":"2016-06-27T10:47:37+00:00","dateModified":"2020-05-13T06:30:24+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/65-ryan-bredemeyer-of-hello-profit-part-1-of-2\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"#65 Ryan Bredemeyer of Hello Profit &#8211; Part 1 of 2"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-aN","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/669","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=669"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/669\/revisions"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=669"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=669"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=669"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}