{"id":6789,"date":"2019-07-25T17:47:57","date_gmt":"2019-07-25T16:47:57","guid":{"rendered":"https:\/\/amazingfba.com\/?p=6789"},"modified":"2020-05-13T05:47:55","modified_gmt":"2020-05-13T04:47:55","slug":"private-label-strategy","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/private-label-strategy\/","title":{"rendered":"Private Label Strategy (step 1 of 10) &#8211; Who do I learn Private Label from?"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F341_Private_Label_Process-Who_do_I_learn_Private_Label_from_Step_1_of_10-25_07_2019_17_40.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fprivate-label-strategy%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/341_Private_Label_Process-Who_do_I_learn_Private_Label_from_Step_1_of_10-25_07_2019_17_40.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6789-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/341_Private_Label_Process-Who_do_I_learn_Private_Label_from_Step_1_of_10-25_07_2019_17_40.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"341_Private_Label_Process-Who_do_I_learn_Private_Label_from_Step_1_of_10-25_07_2019_17_40.mp3\">Download<\/a> (Duration: 29:20 &#8212; 53.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><!--more--><\/p>\n<h1 class=\"p1\"><b>Private Label Strategy &#8211; Who do I learn from? <\/b><\/h1>\n<p class=\"p3\"> This mini-series is based on the<span class=\"Apple-converted-space\">  <\/span>Amazing FBA <a href=\"https:\/\/amazingfba.kartra.com\/page\/Build\">“Build”  10 Step PDF Guide<\/a>,  which is a Private Label Strategy guide.<\/p>\n<p>It&#8217;s NOT tactical and immediate.<\/p>\n<p>It IS a framework you can hang your other Amazon business-building tactics on.<\/p>\n<p class=\"p3\"><a href=\"https:\/\/amazingfba.kartra.com\/page\/Build\">Click here to download the free PDF<\/a><\/p>\n<p class=\"p4\"><b>The 10 steps to building an Amazon Private Label business <\/b><\/p>\n<p class=\"p3\">Step 1 &#8211; what we all know &#8211; but don’t do! (More in a second on this)<\/p>\n<p class=\"p3\">Step 2 &#8211; how to learn more from $600 than $6000 (launch in phases)<\/p>\n<p class=\"p3\">Step 3 &#8211; The NSL process (how the overall phase works)<\/p>\n<p class=\"p3\">Step 4 &#8211; Avoid wasting $5000+ (classic errors)<\/p>\n<p class=\"p3\">Step 5 &#8211; Why “Product Research” Fails (and what to do instead)<\/p>\n<p class=\"p3\">Step 6- The keys to great sourcing<\/p>\n<p class=\"p3\">Step 7 &#8211; The New “old-school” Launch method that <i>works <\/i><\/p>\n<p class=\"p3\">Step 8 &#8211; Finding buried Treasure in your Amazon business (measuring &amp; understanding)<\/p>\n<p class=\"p3\">Step 9 &#8211; When to scale up (and when not)<\/p>\n<p class=\"p3\">Step 10 &#8211; The 3 Cs to Success with Amazon Private Label (the framework you need to BUILD a business as a solopreneur)<\/p>\n<h2 class=\"p1\"><b>Who should you Learn From?<\/b><\/h2>\n<p class=\"p4\"><b>Expert modellers<\/b><\/p>\n<p class=\"p3\">NLP founders, Bandler and Grinder, weren’t experts in many areas &#8211; they were experts at <i>modelling <\/i>(the True meaning of NLP according to many).<\/p>\n<p class=\"p4\"><b>“Those who can’t, do; those who can, teach”<\/b><\/p>\n<p class=\"p3\">…Well&#8230;yes and no.<\/p>\n<p>Sure, you need to learn from someone who has learned how to do things themselves from real experience. However, simply following peak performers is not enough. Peak performers often have extreme talent and quite some luck too. The best football (soccer or American Football) coaches are not necessarily &#8211; or even often &#8211; those who were outstanding players. Coaching and training is a different art than performing, and the same is true in business.<\/p>\n<h2 class=\"p1\"><b>Who NOT to follow for your Private Label Strategy<\/b><\/h2>\n<p class=\"p4\"><b>FaceBook groups are like bin-diving<\/b><\/p>\n<ul class=\"ul1\">\n<li class=\"li3\">There may be value in some groups &#8211; but be selective<\/li>\n<li class=\"li3\">Much of what you hear is from the “Amazon Echo Chamber” (Will Tjernlund’s phrase)[LINK to Goat Consulting]<\/li>\n<\/ul>\n<p class=\"p4\"><b>Facebook+Youtube+Podcasts=Confusion!<\/b><\/p>\n<ul class=\"ul1\">\n<li class=\"li3\">Absorbing info in bits means you have to integrate it\n<ul class=\"ul1\">\n<li class=\"li3\">But if you’re new, what are you integrating it INTO?<\/li>\n<\/ul>\n<\/li>\n<li class=\"li3\">There are multiple ways to do anything\n<ul class=\"ul1\">\n<li class=\"li3\">Following 10 people means having 10 views on how to do it all<\/li>\n<li class=\"li3\">Distilling your own model from scratch costs time<span class=\"Apple-converted-space\">  <\/span>&#8211; and time=opportunity cost<\/li>\n<\/ul>\n<\/li>\n<li class=\"li3\">In the end, you need to have clear structure<\/li>\n<\/ul>\n<h2 class=\"p1\"><b>Private Label <\/b><b>Courses and “Gurus”  <\/b><\/h2>\n<h3 class=\"p4\"><b>Basing things on reading\/learning only is too abstract<\/b><\/h3>\n<ul class=\"ul2\">\n<li class=\"li3\">Not doing it yourself you don’t know what it FEELS like\n<ul class=\"ul2\">\n<li class=\"li3\">That means you can’t deal with the psychology of fear and greed &#8211; which is critical<\/li>\n<li class=\"li3\">It’s hard to get people to trust you if you haven’t done something yourself<\/li>\n<\/ul>\n<\/li>\n<li class=\"li3\">Also it’s sometimes impossible to judge “Facebook warriors”<\/li>\n<\/ul>\n<h3 class=\"p4\"><b>Based on 1 seller’s<span class=\"Apple-converted-space\">  <\/span>experience is too narrow<\/b><\/h3>\n<ul class=\"ul2\">\n<li class=\"li3\">Each market (category on Amazon) is different\n<ul class=\"ul2\">\n<li class=\"li3\">Some are more seasonal eg toys<\/li>\n<li class=\"li3\">Some are problematic because of low demand (eg UK)<\/li>\n<li class=\"li3\">Some are hyper-competitive (eg supplements; eg USA)<\/li>\n<\/ul>\n<\/li>\n<li class=\"li3\">Success once or twice <i>can <\/i>be just luck &#8211; and luck is not a strategy!<\/li>\n<li class=\"li3\">Particular times had particular ease eg starting in 2013 &#8211; strategy needs to work now<\/li>\n<\/ul>\n<h3 class=\"p4\"><b>Based on success from five years ago is out of date<\/b><\/h3>\n<ul class=\"ul2\">\n<li class=\"li3\">Amazon changes rapidly<\/li>\n<li class=\"li3\">Whole strategies that worked 5 years ago are a disaster now<\/li>\n<li class=\"li3\">Tactics that were <i>powerful<\/i> to use 3 years ago would get your Amazon account permanently suspended now<\/li>\n<\/ul>\n<h3 class=\"p4\"><b>Here’s what our work is based on: <\/b><\/h3>\n<ul class=\"ul2\">\n<li class=\"li3\">Selling on Amazon personally for about 4 years<\/li>\n<li class=\"li3\">Interviewing serious power sellers &#8211; mostly American &#8211; for the podcast (about 3 ½ years)<\/li>\n<li class=\"li3\">Private connections in the UK to Power Sellers (over £100k\/month)<span class=\"Apple-converted-space\">  <\/span>(for about 3 ½ years)<\/li>\n<li class=\"li3\">The 10K Collective Masterminds (collective turnover around £12\/$15 mill a year) This group, which I&#8217;ve run since Sept. 2017, is full of power sellers. The most successful sellers in that have about doubled turnover since they joined (just about 22 months ago)<\/li>\n<\/ul>\n<p class=\"p3\">“Success leaves clues”. The power sellers I know &#8211; probably about 40 of the UK’s 7-figure-per-year sellers &#8211; do things differently. I capture, codify and pass that on to my clients.<\/p>\n<h2 class=\"p1\"><b>How I can help you <\/b><\/h2>\n<h3 class=\"p4\"><b>Free help<\/b><\/h3>\n<p class=\"p3\"><a href=\"https:\/\/amazingfba.kartra.com\/page\/Build\">PDF “10 Steps to building a business” guide<\/a><\/p>\n<p class=\"p3\"><a href=\"https:\/\/amazingfba.com\/class\/\">Free 4-part video series<\/a><\/p>\n<p class=\"p3\">Blog with over 340 podcast show notes: <a href=\"http:\/\/www.amazingfba.com\/blog\"><span class=\"s2\">www.amazingfba.com\/blog<\/span><\/a><\/p>\n<h3 class=\"p4\"><b>Paid help<\/b><\/h3>\n<p class=\"p3\"><a href=\"https:\/\/amazingfba.com\/10kacademy\/plp\/\">The Private Label Process course<\/a> (how to launch your first private label product on Amazon within 6-12 months)<\/p>\n<p class=\"p3\"><a href=\"https:\/\/go.amazingfba.com\/Mentoring-No-VSL\">Mentoring 1-1 programme<\/a>: weekly or bi-weekly video coaching calls tailored to your personal situation.<\/p>\n<p>&nbsp;<\/p>\n<h2>TRANSCRIPT<\/h2>\n<p>Unknown Speaker 0:02<br \/>\nI hereby introduce to you, Mr. Michael Veazey. Hey, Hey, Hey, welcome to amazing FBA the place to be for UK based Amazon entrepreneurs. I&#8217;m your host, Michael Veazey. Welcome to the show.<\/p>\n<p>Michael Veazey 0:21<br \/>\nLadies and gentlemen, welcome to amazing FBA. This is your host, Michael Veazey. Amazing FBA the place to be for UK based Amazon sellers, British Amazon sellers. If you&#8217;re watching the YouTube version, it says on the board behind me Well, yes and no, I don&#8217;t care whether you&#8217;re British, or where you&#8217;re from. This is not a place for racists or nationalists, boxers want to clarify that because there&#8217;s some strange people out there these days in mainstream politics now. And I don&#8217;t care what the hell you&#8217;re from, what I care about is where you&#8217;re going. And I want to help you get that. So this is basically, the only difference is that this is for people based in the UK. In fact, many of my clients have been from all around the globe. This is a wonderful thing about London, at very, very international. And I&#8217;m very happy about that. And I just wanted to clarify that I&#8217;ve had people with ethnic origins from all over the globe. And I love that, I just want to say that very strongly and clearly in case you get the wrong idea, but what I mean by British, so coming up, then we are going to do a little series of 10 podcast based around the 10 step build Guide, which I created recently. And you can get that amazing fba.com forward slash build BILD amazing f the Friday before Bertie, eighth alpha.com forward slash be for birdie for uniform iPhone, indigo, alpha Lima, D for delta. And this is the 10 steps to actually creating and building a real Amazon based private label business, as opposed to quick, kind of quick and dirty things that come and go is not a tactical thing. It&#8217;s a very big picture overview is not in and of itself enough to build a business. And I&#8217;m not claiming that it is. But I do think it gives you a mental framework within which you can then hang other things. And that&#8217;s really, really critical point, I&#8217;m going to come back to you again and again. So what I&#8217;m going to do in this particular episode, I&#8217;m going to talk about the 10 steps. And then we&#8217;re going to start on step one, which is about what we all know, but don&#8217;t do. And we&#8217;ll talk about that in a second. So here are the 10 steps, then of the build guide. The first step today what we all know, but don&#8217;t do, we&#8217;ll talk about this in a second. But I&#8217;ll give you a clue, it&#8217;s about modeling.<\/p>\n<p>The second step, how to learn more from $600, down and $6,000 spend or pounds or euros for that matter. And the secret of that is launching in phases. And we&#8217;ll talk about that in the next episode. Step three is the NSL process or how the overall process works for each phase. And we&#8217;ll talk about that in in the third episode in this little series. Step four is avoiding wasting $5,000 in one go. So classic areas. And again, this is connected with the idea of launching in phases, we&#8217;ll talk about that in step for Step five, why product research fails and what to do instead, right, and the clue is the word product. That obsessive focus is, I believe the wrong focus. And there is a great focus, I think from experience of people who&#8217;ve done very well either those I&#8217;ve mentored or those who I know as well as myself. So step six, the keys to great sourcing, there are some really major do&#8217;s and don&#8217;ts. And again, this is the big picture stuff. But that&#8217;s also important. Step seven, the new old school launch method that works. It&#8217;s not rocket science, but it&#8217;s very, very proven. And I know that from working with some seriously successful sellers using this step eight, it&#8217;s finding buried treasure in your Amazon business. And the hint there is measuring and understanding the numbers above or understanding them. At nine is when to scale up and when not quite different from a lot of the usual advice. And step 10 is the three C&#8217;s to success with Amazon private label, that&#8217;s the framework, you need to build a business as a solo printer. And the framework you need to build a business is different from the business model that you&#8217;re building, right. So these 10 steps, our guide to help you to build a business. They&#8217;re not just a business model, they are a model for how to build a business. That makes sense. So I&#8217;m not giving you the blueprints to a house, I&#8217;m telling you how to go about the process of designing them building the house. So it&#8217;s very big picture. But I think it&#8217;s a missing part of a lot of the information out there, especially the free information. So let&#8217;s come back to step one, which is that the step we&#8217;re on right now, which is modeling performance, which is the thing that I say we all know, but don&#8217;t do. Why do we say we all know and don&#8217;t do it? Well, we tend to follow the people that shout the loudest, or the people that have a lot of money behind them or claim to fame made a lot of money. And there are some good things about that. And some things we need to be careful about. The first thing I would say is I&#8217;m modeling peak performers means that I think you need to be working with or looking at people who are experts at modeling. And the most profound example I can think of in this of self development. And even that internet marketing business type industry is the NLP space where there&#8217;s a lot of people shouting very loudly about a lot of things. But if you look at about the founders of NLP Banda and Brenda, rich abandoned john renderer, I think they weren&#8217;t experts in many areas, although they were experts in linguistics and psychology seven, and they&#8217;re very, very good backgrounds to have as experts in modeling. But what they did, we&#8217;re becoming experts at modeling. And that&#8217;s the true meaning of NLP too many people have certain amount of background and NLP that I could bore you with over drinks, if you like a minute, I&#8217;m not going to talk about here because I don&#8217;t think it&#8217;s relevant to e commerce. But what is relevant, very, very relevant is the fact that they forgot we&#8217;re able to help people become more experts, skiers, or any other things and tennis to name but a few wise that were they great playing tennis or skiing? No. They were great at modeling expert skiers and breaking down exactly what it was that differentiates them from the also rounds. And that I think is a really key.<\/p>\n<p>key thing. Another thing I want to say up front is there&#8217;s a phrase those who can do, and those who can&#8217;t teach. Very interesting one, I mean, you certainly need to be careful who you follow. And this is what I&#8217;m going to talk about for the rest of the episode he&#8217;s following who not to follow the things to watch out for in the end is a very personal decision. So those who can&#8217;t do those who can teach? Well, to some degree, I believe that you can&#8217;t teach unless you can do things to a point where you don&#8217;t necessarily get stellar results. Here&#8217;s what I would say. Really stellar results generally come from a blend of really great talent and really great lock. Right. So wonderful footballers, wonderful tennis players, wonderful musicians for that matter, are born not made, I think there is also a lot of hard work which you can model. And there is a degree of luck, which you cannot model or rather you can&#8217;t copy you luck, you either get it or you don&#8217;t. And as somebody who was and is a certain degree of talent, in music, I can certainly attest the fact that I got my degrees in French horn playing, for example, conducting Princeton, particularly I think I just had a certain talent for it. I didn&#8217;t have great teaching early on, I had great teaching later on, I became a peak performer in that. And to be honest, I was not the greatest teacher, for beginners. Why? Because that requires being able to break down for people who are struggling with it, how to make it how to go from struggling to good, I just arrived good by talent and hard work. But that is not a process that somebody normally can follow. That is not a great teacher. So I was not a great teacher because it&#8217;s in that art. So just because you achieve results doesn&#8217;t automatically get you make you a great teacher, having no results in an area also isn&#8217;t going to make you a great teacher. I think the truth is that a lot of football coaches, whether soccer or American football, or whatever else, you talk about Aussie Rules or whatever. We&#8217;re not the greatest players that game but they had played the game, they understood the grind profoundly, but they had to work at it. And they didn&#8217;t have as much talent, possibly as some other people who they pick for their teams. But in the end, you need to break the processes down the modeling bit and then relate to how people feel and take them through the process. And that I believe with the great teachers. So I don&#8217;t think you should be too obsessed with the people who are achieving great results necessarily. Right. So it is part of the picture, but I don&#8217;t think it&#8217;s the whole picture. So here&#8217;s what I would say, first of all, what not to follow who not to follow the first place that people go to Facebook groups, Facebook groups, I think I&#8217;d like been diving, okay, there may be value in some groups, of course there is. But it&#8217;s going to be a small percentage of the overall number of people in there. So be selective, there may be value in some groups. I guess it&#8217;s a bit like the sort of food recycling.<\/p>\n<p>Would you call it movement now, which is a great thing. In theory, I think it&#8217;s wonderful. And there are probably places where you can go to like, if you go to Whole Earth foods or Whole Foods, I think at the end of the day, sometimes you can pick some great things up those are recent thing my wife subscribe to some app is now I forget. And Malik is not ecommerce, but you can go and get food for like half price, quarter price from some wonderful quality places that are going to throw the food out. That&#8217;s a good example of being selective and maybe paying a little bit of money. But getting great value. That is very different from been diving, right. Unless you&#8217;re desperate, you probably shouldn&#8217;t be going through everybody&#8217;s bins, and not for any second criticizing anyone who&#8217;s desperate enough to have to do that. That&#8217;s an extraordinary situation. And I feel sorry for that person. But I don&#8217;t think my wife and I, much as we believe in and my wife believes in, you know, food recycling are going to go and dump through bins, because yes, you&#8217;ll probably find some food you can eat. But you gonna have to dig through an awful lot of rubbish, it&#8217;s going to be depressing and possibly bad for your health. And I think the same is true for that average Facebook group as well. Much of what you hear in those is from the so called amazon echo chamber as well turning will turn and puts it and that is pretty dangerous. Because just because everyone&#8217;s saying it doesn&#8217;t make it true. So you need some Reality Check that as well. The other place that people often find, or try to find guidance on how to start and indeed build an Amazon business or a private label business is the mixture of Facebook and YouTube and podcasts. I think that just leads to confusion. I say this is somebody who&#8217;s running a podcast and who is podcasting right now they have their place and absorbing infocomm bits can be wonderful, but it means you have to have a place to integrate it into, which I think is the missing piece out there in terms of the free information anyway. So what how does it plug into an overall framework? Again, not just a business model, but a framework for building a business, which is different, right? That&#8217;s like the difference in blueprint for house and the scaffolding. If you don&#8217;t have the scaffolding, you may have a wonderful blueprint for house you might even be quite good at brick work and carpentry of brick work and masonry work sorry, building walls or or even carpentry, but you need the scaffolding to physically go from the blueprint to the making and the building. Right. That is the bit that I think is missing. If you&#8217;re new, how can you integrate information about Amazon ranking into an overall business model? I think the answer is you can&#8217;t if you don&#8217;t have an overall framework. The other thing is this there are multiple ways of doing things. And there&#8217;s more than one way to make Amazon money. In fact, there&#8217;s probably 16 different business models outside of private label such as wholesaling, drop shipping, retail arbitrage to name but the three most common ones. But there&#8217;s lots and lots of ways to do private labeling as well. So if you follow different 10 different people, you&#8217;re gonna have 10 different views and how to do it all. Now Sure, you may want to distill down what they have in common. And and there&#8217;s nothing wrong with doing that. But it&#8217;s going to be an awful lot more work and time. And there is a time cost to doing this stuff as well. Just to put opportunity cost in perspective, I just listened to a podcast with one of my old mentoring clients, who has since gone full time their Amazon business, Richard coat, so I hope you don&#8217;t mind me mentioning you. But you&#8217;re out there on the ETFs. Our podcast escape the rat race podcast, which is something run by Chris Rodwell, a very good friend of the show. And she would never got to the point of being able to quit the day job if she was still watching YouTube videos and such as such as that of which she took the plunge, pay for some mentoring with me and for course, and was for time a part of a mastermind I used to run for people at the early stage. And guess what it&#8217;s actually worked for her and she&#8217;s escaped from her day job, which is amazing news, but she would still be stuck in that and the opportunity cost in terms of money lost would have been 10s of thousands of dollars, and the opportunity of leaving the day job. In some other ways, it&#8217;s hard to put a price on that. In the end, I think what you need is clear structure and getting clarity from a bunch of things that are designed to get your attention in order to fulfill the needs of the marketer. And that includes podcasts. And that includes some of my podcast, of course, that may lead to confusion if you follow like 10 different ways of doing things.<\/p>\n<p>So assuming that you&#8217;re convinced that the free stuff out there was very good to have, of course, in many ways is not the solution to really creating a structure and a scaffolding in which to build your business. Okay, what do we do, we probably going to go and either follow a guru, if you like, or a course, or maybe get some training or join a group. And those are all good things, I would start with the word guru, I would claim that I&#8217;m not a guru that the word guru, I think it means teacher, but also, it implies that they are sort of spiritually, they&#8217;ve had some kind of enlightenment, as I understand it, I&#8217;m not a great expert in this, but again, don&#8217;t need to because this isn&#8217;t really about the true meaning of the word guru in in Hindu religion or something, which I really do not tend to know much about. But it&#8217;s about the way it&#8217;s used in the sort of Internet Marketing World in very much including e commerce, I think if it means you park your own brain and just do what you&#8217;re told, you already lost, and his wife is an entrepreneur needs to be very independent and very pro active. And in the end, you need to make your own decisions. So you need to start with a framework, just because it saves you time. And you don&#8217;t reinvent the wheel, which is very, very expensive, both in terms of money, but also time, which is the one thing you cannot get back, you can spend money you can make money, you cannot do anything spend time, right? So I think it&#8217;s very good to save time, but never to just park your brain. So I would say the word Guru is risky. Because of the mental relationship it implies I get that as well. I get people coming to me as a quote guru, which I hate that word. And I definitely not. I do not claim that whatsoever, right. I&#8217;m just a guy who&#8217;s done a hell of a lot in a particular space and become a guest, a specialist and has a lot of things to offer from just repeated experience. So the main thing is this, you get people I get people coming to me, you want to kind of Park responsibility for and they want a guarantee and parking responsibility for their own business success is guaranteeing failure because they don&#8217;t have a productive mindset so that I&#8217;m going to guarantee they&#8217;re going to fail. And I don&#8217;t work with those guys, because they want something I can&#8217;t offer. There&#8217;s somebody asked me for guarantee of an outcome. And I said no, I cannot possibly offer you that. And I understand why he does that. But I suggested that is not a mindset that&#8217;s going to serve you. And I&#8217;m afraid I can&#8217;t take your money and I can&#8217;t help you. So I turned down business for that reason. The other thing is that you just have to be proactive, you cannot park responsibility, but you cannot park<\/p>\n<p>the cure curiosity, you know what I&#8217;m searching here cannot believe things very well. I don&#8217;t think you can park the need to get over your own fear. You know, if you&#8217;re asking somebody to hold your hand too much in a very competitive business environment, which is any kind of internet based business whatsoever, I would argue and that includes e commerce that includes armas, and I don&#8217;t think you&#8217;re ready for the fight, in which case you need to get yourself ready by working on your own mentality. So that&#8217;s not something I can particularly help with. I&#8217;m not a life coach, I guess I&#8217;m not a psychotherapist, I&#8217;m a you know, I&#8217;m not those things. So, bit abstract. But I think there is a relationship between how you feel and your own mentality and the guru slash courses that you&#8217;re looking for. I think you need to look for a teacher. And I think you need to look for education and training and need to take that seriously, and you need to follow what it does. But you don&#8217;t need to do so slavish Lee, but you need to do it intelligently. And with your own responsibility. There you go. That&#8217;s my summary on that. So courses and gurus who to follow who not to follow, here&#8217;s a few do&#8217;s and don&#8217;ts. First of all, the don&#8217;ts based on hearsay only is too abstract. So if someone hasn&#8217;t done it themselves, they don&#8217;t know what it&#8217;s feel like. That means you can&#8217;t deal with the psychology of fear and greed, which is critical. We all feel fear, we offer greed, we have to deal with the twin imposters, if you like having done it yourself means you&#8217;re in a position to help other people do it. Right. The other thing is, it&#8217;s hard to get people to trust you if you haven&#8217;t done something yourself. And if I hadn&#8217;t sold on Amazon a lot, then I wouldn&#8217;t be able to get people to believe that I know what I&#8217;m doing. And rightly so. The other thing is, it&#8217;s impossible to judge Facebook warriors or the latest tactics and strategies if you don&#8217;t have a deep insight from doing something yourself about what will and won&#8217;t work won&#8217;t work. So that&#8217;s a fairly obvious one, right? Now, here&#8217;s the second one, which is a lot more subtle, which is, most people who are out there offering Amazon sales training, have done massive numbers on Amazon, or at least claimed to have done, I do not claim that I claim that I&#8217;ve done into the six figures marks $100,000 plus my own account and between myself and business partners businesses, over a quarter of a million, which is a starting point for knowing that I have actually achieved something and I know from experience what goes on, but I certainly do not claim to done a million dollars a year 2,000,005 million, like a lot of people do. And you know what, that&#8217;s great. And those are people you should consider following because that is not an easy thing to achieve. Here&#8217;s what I would say about that, though I&#8217;m basing it on one sellers experience is too narrow, in my experience my opinion, even if they&#8217;ve done really, really well. Here&#8217;s why. Number one, each market category on Amazon is different. Some of very seasonal like toys, some of them problematic because of low demand, like if you&#8217;re in the UK, particularly. So some of them are hyper competitive, the opposite problem, for example, supplements, for example, in a lot of markets in the USA, and those are very, very different problems to have.<\/p>\n<p>Hyper competition is probably the biggest problem and Amazon but you can find particularly in Europe, there are some areas where just not enough demand is the problem. And those are quite different problems to deal with. A second reason why basing something on one sellers experiences too narrow success once or twice can just be luck. And luck is not a strategy. Now, I wouldn&#8217;t say that somebody doing seven figures consistently is just luck, it probably isn&#8217;t. But the fact that they grew it so fast, can be luck. And basically on one experience is just luck is not a strategy, as I saying, I think that comes down to the third thing, which is particular people at certain times had particular easing started, for example, in 2013. If you happen to work with supplements in 2012 2013, in the USA, maybe you did well with a bit of luck, and you made a killing. And there are people who did that name no names, who created courses that I took, which turned out to have no clue what so ever, about sourcing from China, which is where most people are going to be sourcing from unless you&#8217;re selling supplements or topical oils. I&#8217;m not saying don&#8217;t sell topical supplements are famously competitive. But I do have a couple of clients and the million pound mastermind and and other places that have done well with supplements. But it&#8217;s really, really hard. So if that&#8217;s an example the that course I took people who&#8217;ve done massive numbers, but based around supplements in the USA, and guess what if you were trying to sell it anywhere else, and you were trying to sell anything else other than supplements, they will use this at helping you I was quite crossed about the lack of information that it gave me because it cost me months and months of my time to try and recreate the wheel in terms of sourcing from China. So there&#8217;s an example of success in one place isn&#8217;t necessarily duplicatable. So something else if you started in 2013, you become a multi million dollar seller, fantastic rate. That&#8217;s a real achievement. Most people who started then did not achieve that. Having said that, that isn&#8217;t really very helpful for somebody starting in 2019 2020. and beyond. Because what what then won&#8217;t work now, right. So being based on something that worked five years ago is way too out of date, Allison changes rapidly whole strategies that work five years ago, or a disaster now, for example, going for supplements most of the time, taxes that were powerful to us three years ago will get your Amazon account permanently suspended, not suspended. Now, most famously the review manipulation allegations, if you just asked me for a five star review, and yes, most responsible course traders are not going to be giving you that now. But that may have been how they built their businesses back in the day. Nothing wrong with that, no criticism of that. But that doesn&#8217;t place them very well to help you create your business now from scratch, if that&#8217;s where it&#8217;s coming or from a low level, and with the tactics that work there. So just to clarify where I&#8217;m coming from, and where our works based, doesn&#8217;t mean you should or shouldn&#8217;t go for it. But I believe that you should know where we come from. And then you can make your own decision. First of all been selling on Amazon personally for about four years. And I&#8217;ve talked about that before. So the kind of turnover is pretty modest. But at least I&#8217;ve been out in the trenches for a substantial time. And I&#8217;ve seen the changes over time as well. So I&#8217;ve got some perspective, and not basing something on 12 months worth of experience or something. The second thing is interviewing serious power sellers for the podcast, private connections as well in the UK. So the podcast that&#8217;s been over about three and a half years of interviews as well. So I&#8217;ve got a really long perspective on what works now what still works, what are the longer term perspectives that work and strategies, and what are the things that have changed with time. I&#8217;ve got private private connections in the UK to power sellers who are doing over 100,000 pounds a month or seven figures a year comfortably. And I&#8217;ve been in those for for about three or four years now as well. Then the 10 k collective or maybe like three and a half years as well, I&#8217;m trying to figure out roughly how long it is. And then the 10 collective mastermind, the collective turnover is about $15 million a year 15 I should say, this group, which I&#8217;ve run since September 27 teen is full of power sellers, I mean, most of them are doing several hundred thousand dollars a month upwards, the most successful sellers in that have about doubled turnover since they joined which about 22 months ago. So this is a very, very up to date insight across multiple different business categories, and different marketplaces, some of them selling UK only in a bit of Germany, someone selling the US mostly.<\/p>\n<p>And I get to see the inside of those those businesses month in month out for a long period. And that&#8217;s been the most incredible learning for me. And that is the thing that I can pass on success leaves clues as they say. So the power says that I know probably about 40 of the UK seven per year sellers, seven figure per year. So let&#8217;s do things differently. I capture and codify that and pass it on to my clients. As I said, the ability, the ability to model and the ability to teach people at the early stages are quite different from the luck plus talent to do things at a high level yourself. That doesn&#8217;t necessarily mean you can break it down for people, a lot of the time I find that the selling courses out there are very positive and get people into motion, which is great. The Americans are particularly good at that, and hats off to them for their can do attitude. But here&#8217;s the thing, if it&#8217;s not based on some kind of reality, you&#8217;re going to hit a wall and you won&#8217;t bounce, you know, you just fall over and don&#8217;t get back up. And most people just quit. And that is the problem I&#8217;ve seen. So you need to have a positive mentality. But I think you need to base it on really strong reality checks as well. So that you don&#8217;t go in with a crazy idea that it&#8217;s going to be easy. I think it&#8217;s more like an epic sea voyage. Just to wrap things up with a bit of a metaphor. recently been reading a book, it&#8217;s actually a kind of comic book. But it&#8217;s it&#8217;s fiction, but it&#8217;s based on quite a lot of decent research that reminded me of the whole reason why companies were invented back in the day, I believe that the dollar invented limited companies, I&#8217;m going to have some German or French person or Italian on the phone to me next to telling me that I got it wrong. But the UK certainly water the English back in the day, were very quick to emulate that. And the reason was because the English had a massive navy and their big naval tradition, and they used to send merchant ships off to see their fortune. And what do you need to do? Well, number one, you need to have a genuine opportunity, often involving importing from abroad. So that hasn&#8217;t gone out of fashion. I mean, that&#8217;s still what a lot of Amazon businesses are based around and differentiation between the labor all the goods you can get in in often in the Far East. And that&#8217;s still the case today. And the amount you can sell them for in Britain them. And that was true for spices back in the day, which will work some of them worth more than their weight in gold. And that&#8217;s not normally the case for Amazon products, by the way, but so you could have a prize with winning, then you can have manageable competition, you got to be able to compete, and then you got to love the fact that you&#8217;ve got that.<\/p>\n<p>See that it&#8217;s a risky venture, and the game is going to be worth the candle. But nevertheless, there is risk and the job is not to pretend it doesn&#8217;t exist, because then you&#8217;ll come completely a Cropper, you need to acknowledge the risk, and do it the right way, number one, by setting up a limited company, which is what people did, so they limited the downside and their liability. Number two by building a solid craft to sail the seas number three, by getting experienced crew on board to make sure that if a storm, the inevitable storms and problems came up that they can handle it and stay afloat. And those are broadly speaking still true for business ventures today. I mean, we no longer use vehicles like literally a ship of our own. But we do literally put goods on ships from the Far East. So it&#8217;s not as different as you might think, actually, there&#8217;s still risk there, the risk of containers fall into the sea is not that great. To be honest, the risks are more posed by the competition once you get on Amazon. But the risks are still there. And actually 10,000 new containers a year do fall into the sea. So there&#8217;s a small risks to the containers, but much more importantly, the risk of competition. But in the end, you need to have a mixture of a spirit of Daring Do and some courage and some conviction, make sure that the prize is worth winning. But also you need to protect yourself against the downsides and going in a very, very structured way and learn from other people&#8217;s mistakes. So you don&#8217;t have to recreate them and build a see where the business and vessel vehicle if you like. So those are the things that we&#8217;re working towards in our approach. So we&#8217;ve done the steps, who to follow who to model and just some things to watch out for. The next thing we&#8217;re going to do step two is how to learn more from $600, spending $6,000 pounds, which is about launching in phases, which is one of the things that I think makes our message with a private label process course, but different to other guru types out there. And this, by the way, is the backbone of our private label process, which is the backbone both to the course that we sell, and the mentoring that I provide as well if you want to check out the course go to amazing fba.com forward slash PLP. That&#8217;s amazing. f Friday be for Bertie a for alpha.com forward slash p for Peter alpha Lima p for Peter signs of private label process. And if you want to check out mentoring one to one with me, if you need more hands on help, amazing fba.com forward slash mentoring me NTURING. And just to quickly reiterate again, if you haven&#8217;t got the build guide yet, which is completely free PDF mostly presented, I think which gives the overall framework to how to build an Amazon business. And that is the critical framework, I think on which you can put all the other bits of information, then go to amazing fba.com forward slash build. That&#8217;s amazing. fba.com post IBUILD for delta. Thank you so much for listening speech in x podcast.<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n<h3><strong>Watch my full discussion of Private Label Strategy, Who do I learn Private Label from?<\/strong><\/h3>\n<p>[video_page_section type=&#8221;youtube&#8221; position=&#8221;bottom&#8221; image=&#8221;&#8221; btn=&#8221;light&#8221; heading=&#8221;&#8221; subheading=&#8221;&#8221; cta=&#8221;&#8221; video_width=&#8221;1080&#8243; hide_related=&#8221;false&#8221; hide_logo=&#8221;false&#8221; hide_controls=&#8221;false&#8221; hide_title=&#8221;false&#8221; hide_fullscreen=&#8221;false&#8221;]https:\/\/www.youtube.com\/watch?v=Cz70JBDhF5Q&#038;feature=youtu.be[\/video_page_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F341_Private_Label_Process-Who_do_I_learn_Private_Label_from_Step_1_of_10-25_07_2019_17_40.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fprivate-label-strategy%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/341_Private_Label_Process-Who_do_I_learn_Private_Label_from_Step_1_of_10-25_07_2019_17_40.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6789-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/341_Private_Label_Process-Who_do_I_learn_Private_Label_from_Step_1_of_10-25_07_2019_17_40.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"341_Private_Label_Process-Who_do_I_learn_Private_Label_from_Step_1_of_10-25_07_2019_17_40.mp3\">Download<\/a> (Duration: 29:20 &#8212; 53.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 29:20 &#8212; 53.7MB)Subscribe: Spotify | Email | RSS<\/p>\n","protected":false},"author":1,"featured_media":6790,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1837],"tags":[1853,1456,955,851,201,1455,1454,1457],"class_list":["post-6789","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-starting-an-ecommerce-business","tag-amazing-fba-podcast","tag-amazon-guru","tag-amazon-private-label","tag-amazon-training","tag-private-label","tag-private-label-process","tag-private-label-strategy","tag-private-label-training","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Private Label Strategy (step 1 of 10) - Who do I learn Private Label from?<\/title>\n<meta name=\"description\" content=\"A Private Label Strategy is your overall scaffolding for building an Amazon private label business. Who should you learn from to build an FBA business?\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/private-label-strategy\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Private Label Strategy (step 1 of 10) - Who do I learn Private Label from?\" \/>\n<meta property=\"og:description\" content=\"A Private Label Strategy is your overall scaffolding for building an Amazon private label business. Who should you learn from to build an FBA business?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/private-label-strategy\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-07-25T16:47:57+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-13T04:47:55+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/Private-Label-Strategy_-Who-to-Follow_.png?fit=560%2C315&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"33 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/private-label-strategy\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/private-label-strategy\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Private Label Strategy (step 1 of 10) &#8211; Who do I learn Private Label from?\",\"datePublished\":\"2019-07-25T16:47:57+00:00\",\"dateModified\":\"2020-05-13T04:47:55+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/private-label-strategy\/\"},\"wordCount\":6829,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/private-label-strategy\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/Private-Label-Strategy_-Who-to-Follow_.png?fit=560%2C315&ssl=1\",\"keywords\":[\"Amazing FBA Podcast\",\"Amazon guru\",\"amazon private label\",\"Amazon training\",\"Private label\",\"private label process\",\"private label strategy\",\"private label training\"],\"articleSection\":[\"Starting An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/private-label-strategy\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/private-label-strategy\/\",\"url\":\"https:\/\/amazingfba.com\/private-label-strategy\/\",\"name\":\"Private Label Strategy (step 1 of 10) - Who do I learn Private Label from?\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/private-label-strategy\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/private-label-strategy\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/Private-Label-Strategy_-Who-to-Follow_.png?fit=560%2C315&ssl=1\",\"datePublished\":\"2019-07-25T16:47:57+00:00\",\"dateModified\":\"2020-05-13T04:47:55+00:00\",\"description\":\"A Private Label Strategy is your overall scaffolding for building an Amazon private label business. Who should you learn from to build an FBA business?\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/private-label-strategy\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/private-label-strategy\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/private-label-strategy\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/Private-Label-Strategy_-Who-to-Follow_.png?fit=560%2C315&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/Private-Label-Strategy_-Who-to-Follow_.png?fit=560%2C315&ssl=1\",\"width\":560,\"height\":315,\"caption\":\"Private Label Strategy\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/private-label-strategy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Private Label Strategy (step 1 of 10) &#8211; Who do I learn Private Label from?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Private Label Strategy (step 1 of 10) - Who do I learn Private Label from?","description":"A Private Label Strategy is your overall scaffolding for building an Amazon private label business. Who should you learn from to build an FBA business?","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/private-label-strategy\/","og_locale":"en_GB","og_type":"article","og_title":"Private Label Strategy (step 1 of 10) - Who do I learn Private Label from?","og_description":"A Private Label Strategy is your overall scaffolding for building an Amazon private label business. Who should you learn from to build an FBA business?","og_url":"https:\/\/amazingfba.com\/private-label-strategy\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-07-25T16:47:57+00:00","article_modified_time":"2020-05-13T04:47:55+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/Private-Label-Strategy_-Who-to-Follow_.png?fit=560%2C315&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"33 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/private-label-strategy\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/private-label-strategy\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Private Label Strategy (step 1 of 10) &#8211; Who do I learn Private Label from?","datePublished":"2019-07-25T16:47:57+00:00","dateModified":"2020-05-13T04:47:55+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/private-label-strategy\/"},"wordCount":6829,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/private-label-strategy\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/Private-Label-Strategy_-Who-to-Follow_.png?fit=560%2C315&ssl=1","keywords":["Amazing FBA Podcast","Amazon guru","amazon private label","Amazon training","Private label","private label process","private label strategy","private label training"],"articleSection":["Starting An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/private-label-strategy\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/private-label-strategy\/","url":"https:\/\/amazingfba.com\/private-label-strategy\/","name":"Private Label Strategy (step 1 of 10) - Who do I learn Private Label from?","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/private-label-strategy\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/private-label-strategy\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/Private-Label-Strategy_-Who-to-Follow_.png?fit=560%2C315&ssl=1","datePublished":"2019-07-25T16:47:57+00:00","dateModified":"2020-05-13T04:47:55+00:00","description":"A Private Label Strategy is your overall scaffolding for building an Amazon private label business. Who should you learn from to build an FBA business?","breadcrumb":{"@id":"https:\/\/amazingfba.com\/private-label-strategy\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/private-label-strategy\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/private-label-strategy\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/Private-Label-Strategy_-Who-to-Follow_.png?fit=560%2C315&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/Private-Label-Strategy_-Who-to-Follow_.png?fit=560%2C315&ssl=1","width":560,"height":315,"caption":"Private Label Strategy"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/private-label-strategy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Private Label Strategy (step 1 of 10) &#8211; Who do I learn Private Label from?"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/Private-Label-Strategy_-Who-to-Follow_.png?fit=560%2C315&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-1Lv","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6789","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=6789"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6789\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6790"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=6789"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=6789"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=6789"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}