{"id":6837,"date":"2019-08-01T06:00:22","date_gmt":"2019-08-01T05:00:22","guid":{"rendered":"https:\/\/amazingfba.com\/?p=6837"},"modified":"2020-05-13T05:47:52","modified_gmt":"2020-05-13T04:47:52","slug":"rebates-for-amazon","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/rebates-for-amazon\/","title":{"rendered":"#343 Rebates for Amazon with Paul Harvey of Seller Chatbot"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F343_Rebates_for_Amazon_with_Paul_Harvey_Seller_Chatbot-30_07_2019_16_28.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Frebates-for-amazon%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/343_Rebates_for_Amazon_with_Paul_Harvey_Seller_Chatbot-30_07_2019_16_28.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6837-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/343_Rebates_for_Amazon_with_Paul_Harvey_Seller_Chatbot-30_07_2019_16_28.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"343_Rebates_for_Amazon_with_Paul_Harvey_Seller_Chatbot-30_07_2019_16_28.mp3\">Download<\/a> (Duration: 29:34 &#8212; 54.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><!--more--><\/p>\n<h1 class=\"p1\">Rebates for Amazon with Paul Harvey of <a href=\"https:\/\/paykstrt.com\/5550\/27131\">Seller Chatbot<\/a><\/h1>\n<h3> What are rebates for Amazon about?<\/h3>\n<p>In the e-commerce world, rebates for Amazon are another way to get good keyword ranking for new products when launching. It works especially well because the ranking effect of each reduced-price sale is much less than that of full-priced sales. Basically it means giving a customer a rebate after they buy an item.<\/p>\n<h3 class=\"p5\"><b>Are Rebates Amazon TOS compliant? <\/b><\/h3>\n<p class=\"p3\">Back in the day, you could sell products by using incentivised reviews.<\/p>\n<p class=\"p3\">Paul played by what he thought were good rules,  but his competition went past him<\/p>\n<p class=\"p3\">It took Amazon getting nasty press to change it.<\/p>\n<p class=\"p3\">Rebates are similar. Rebates are not against TOS [but they are possibly a grey area -ed.]<\/p>\n<p class=\"p3\">However, asking for rebates and then asking for a review IS against TOS and Paul has known a couple of Amazon sellers have their Amazon accounts suspended for doing this.<\/p>\n<p class=\"p5\"><b>Amazon are reluctant to change it &#8211; BUT it will change!<\/b><\/p>\n<p class=\"p3\">Rebates are likely to stay for a while. Amazon makes more money off a full-price sale than a discount<\/p>\n<p class=\"p3\">Also, Amazon would need to get access to Paypal to prove that rebates are being used.<\/p>\n<p class=\"p3\">One day however it will change &#8211; so you need to have more tactics than that.<\/p>\n<h3 class=\"p5\"><b>So how does rebate flow work?<\/b><\/h3>\n<p class=\"p3\">You <i>can<\/i> automate everything eg on Manychat.<\/p>\n<p class=\"p3\">There are API integrations with FaceBook &#8211; eg automatic PayPal refund, or add another product (Buy One Get One Free deals etc.)<\/p>\n<p class=\"p3\">Paul recommends automating everything.<br \/>\nHOWEVER, Paul and Anthony and Steve Simonson were chatting about this 2 months ago.<\/p>\n<p class=\"p3\">And Steve said, “hang on, are you wanting to automate a way to take money out of my account? What if your whole flow went viral?&#8221;<\/p>\n<p class=\"p3\">Yes, you can put boundaries and restrictions in place &#8211; but they take work.<\/p>\n<p class=\"p5\"><b>Hasn’t Amazon got a stake in Paypal?<\/b><\/p>\n<p class=\"p3\">Who knows?<\/p>\n<h3>What&#8217;s the best way to talk to customers about rebates?<\/h3>\n<p class=\"p3\">Paul speaks to customers &#8211; who ask &#8220;why is it free?&#8221;. The reason he gives is that he wants to get their feedback about the product and the buying process.<\/p>\n<p class=\"p3\">Some sellers choose to follow up later and  ask for a review, but this is definitely black hat.<\/p>\n<h3 class=\"p5\"><b>Chatbot Flow for Rebates<\/b><\/h3>\n<p class=\"p3\">In the flow, when you do search and buy, seller chatbot cycles through various keywords, which helps the searches appear more organic to Amazon.<\/p>\n<p class=\"p3\">VA manually handles all the stuff and does rebate. She monitors this and uses customer screenshots as proof before issuing rebates.<\/p>\n<h3 class=\"p5\"><b>Using Chatbots to improve PPC<\/b><\/h3>\n<p class=\"p5\">Eg search and buy &#8211; if bidding heavily on a keyword, you will often have your ad appear high in the search results.<\/p>\n<p class=\"p5\">You can get Super low ACoS if you combine PPC with Chatbot in the right way.<\/p>\n<h3 class=\"p5\"><b>What URL do you use?<\/b><\/h3>\n<p class=\"p3\">Paul hasn’t used a Super URL for 2 years.<\/p>\n<p class=\"p3\">He has used &#8220;search and buy&#8221; for 2 years.<\/p>\n<h3>Why search and buy not a Super URL?<\/h3>\n<p class=\"p3\">Amazon can see that customers are coming to the home page, typing in the keyword and then clicking on the ad (and in the best case, buying the product as a result).<\/p>\n<p class=\"p3\">Ranking and relevancy go through the roof.<\/p>\n<p class=\"p3\">There are something like 80 data points that Amazon accounts for in ranking, so it&#8217;s not the only aspect of ranking, but click rates and sales via Amazon ads are very powerful still in ranking your organic product listing.<\/p>\n<p class=\"p5\"><b>Amazon Ads<\/b><\/p>\n<p class=\"p3\">If the customer types in “baby blanket” and they see your ad, likely to click.<\/p>\n<p class=\"p3\">Amazon will reward your organic ranking in response to better CTR, conversions via ads.<\/p>\n<p class=\"p3\">Amazon loves ads because that makes them profit!<\/p>\n<p class=\"p3\">ACOS drops and relevancy will improve.<\/p>\n<p class=\"p3\">Sellers don’t want to spend on PPC but it sends more signals to your listing. It pays off really well in the medium term.<\/p>\n<h3>Example flow:<\/h3>\n<ol>\n<li class=\"p3\">Customer searches &#8220;baby blanket&#8221;<\/li>\n<li class=\"p3\">Sees sponsored ad<\/li>\n<li class=\"p3\">Clicks on ad<\/li>\n<li class=\"p3\">Then purchasea<\/li>\n<\/ol>\n<p class=\"p3\">Then PPC improves because the conversion rate (CVR) and Click-Through-Rate (CTR) are high.<\/p>\n<p class=\"p3\">Relevancy improves; all of which pushes organic ranking for that listing for that keyword.<\/p>\n<h2 class=\"p5\"><b>How can Seller Chatbot help Amazon Sellers with Amazon launches?<\/b><\/h2>\n<p class=\"p3\">2 basic types of packages &#8211; plus a “Done for you” service<\/p>\n<h3 class=\"p5\"><b>Basic version<\/b><\/h3>\n<ol class=\"ol1\">\n<li class=\"li3\">Monthly fee &#8211; get going right now &#8211; Seller Chatbot will do everything else<\/li>\n<\/ol>\n<ul class=\"ul1\">\n<li class=\"li3\">FaceBook ads<\/li>\n<li class=\"li3\">Popup on your website<\/li>\n<\/ul>\n<p><a href=\"https:\/\/paykstrt.com\/5550\/27131\">To explore more, click here<\/a> (affiliate link)<\/p>\n<p class=\"p5\"><b>Advanced templates<\/b><\/p>\n<p class=\"p3\">Advanced training with Paul<\/p>\n<p class=\"p5\"><b>How do people get hold of you to discuss agency work?<\/b><\/p>\n<p class=\"p6\"><a href=\"mailto:Paul@sellerchatbot.com\">Paul@sellerchatbot.com<\/a><\/p>\n<p class=\"p6\"><span class=\"s1\">Or <a href=\"mailto:support@sellerchatbot.com\">support@sellerchatbot.com<\/a><\/span><\/p>\n<p class=\"p5\"><b>What&#8217;s you final Best advice about this?<\/b><\/p>\n<p class=\"p3\">Get out there and fail!<\/p>\n<p class=\"p3\">Go to FaceBook ads library &#8211; see ads from competitor<\/p>\n<p class=\"p3\">Type in “rebate”<\/p>\n<p class=\"p3\">Take note of how terrible their ads are and how good their chatbot flow.<\/p>\n<p class=\"p3\">Have a small budget of $100 and learn!<\/p>\n<p class=\"p3\">You learn from your mistakes more than a little success.<\/p>\n<p class=\"p3\">And remember as a good English speaker you’re in a good spot! (Most Chinese sellers still have poor English in chatbot flows as well as in Listings)<\/p>\n<p class=\"p5\"><b>Advanced training<\/b><\/p>\n<p class=\"p3\">Price is currently $299<\/p>\n<p class=\"p3\">Going up to $499 soon.<\/p>\n<h3>To explore using Seller Chatbot software and advanced training, <a href=\"https:\/\/paykstrt.com\/5550\/27131\">click here<\/a><\/h3>\n<p>(affiliate link)<\/p>\n<h2>To hear more about Chatbots for Amazon from Paul (free information)&#8230;<\/h2>\n<p><a href=\"https:\/\/amazingfba.com\/chatbots-for-amazon\/\">Check out our recent interview about Chatbots for Amazon here<\/a><\/p>\n<p><a href=\"https:\/\/amazingfba.com\/309-why-facebook-chatbot-for-ecommerce-is-the-new-email\/\">Why Chatbots are the new email<\/a><\/p>\n<p>___________________________________________________________________________________________________<\/p>\n<h2>TRANSCRIPT<\/h2>\n<p>Michael Veazey 0:22<br \/>\nLadies and gentlemen, welcome to the amazing FBA show. This is your host Michael Veazey. delighted to welcome an old friend to the show who I know probably least three years for hobby of Sella chatbot. So Paul, welcome back to the show.<\/p>\n<p>Paul Harvey 0:35<br \/>\nThank you, thanks for that intro.<\/p>\n<p>Michael Veazey 0:37<br \/>\nTell me about this. The rebate flow. We mentioned this before. This is one of the more controversial but also potentially sexy topics. So let&#8217;s get into this.<\/p>\n<p>Paul Harvey 0:48<br \/>\nWe published our recent rebate flow about maybe two-three weeks ago and he announced that recently, and we were reluctant to be reluctant to because again now, Michael, you you&#8217;ve been around for years. And you remember there&#8217;s a period on Amazon when incentivized reviews were allowed.<\/p>\n<p>Michael Veazey 1:06<br \/>\nYeah, it was halcyon days. I remember it.<\/p>\n<p>Paul Harvey 1:08<br \/>\nCrazy, right? I remember when Amazon made this was at Amazon, when this thing was it was strategy was effective. You could simply go into a site like Amazon track a list your product, the people will buy it at a discount, if they give you a five star review ranking goes through the roof and five star reviews go through the roof. It was a great strategy. However, at that time, I was on the fence saying though, guys, this is breaking as Amazon Terms of Service. And I did believe that. But Amazon did not clamp down and there was no nothing strict and it&#8217;s here we&#8217;re saying that. And then what happened a year and a half later, after Amazon got some bad press about this. Amazon, they changed the bad to worse and even then doing incentivize reviews will be bad. And then that held up to that. Now Junior period always trying to be the NASCAR, I should be having morals and say this against service? And do you incentivize reviews. However all my competitors did. And they just they just flew straight past me. So I tried to be NASCAR. I talked about the rules, and it didn&#8217;t work. And actually, those rules were pretty much subjective. Because I assumed was against the terms of service. But people said no, but there&#8217;s no actual nothing against this in the terms of service. Now rebates are exactly this. It really is because as I said a ghost in a few other little was because there&#8217;s nothing in the Amazon Terms of Service that says rebates are not allowed. Nothing at all. So and having spent a number of high profile sellers, they got into writing from Amazon saying, Yeah, you can do it. However, when you mix reviews, or rebates, and then you ask for a review, right there there is breaking to with and I&#8217;ve never seen anyone being suspended for rebates, but I have seen rebates and then asking for reviews from those rebates, those people being suspended. So and also again, think of this, right, and Amazon makes more money off of a full price sale than a discount. So they actually happy for people to rebates because they make more money. So the and also secondly, hackers Amazon checklist, how they know you doing rebates don&#8217;t need access to your PayPal accounts and a whole bunch of checking stuff there. It&#8217;s a pain. So that there&#8217;s two factors. That was my reluctance to change this. However, that being said, what&#8217;s gonna happen next is people are going to abuse the system, they really are. And then Amazon will be forced to make these changes. So again, I&#8217;m saying to everyone, you know, what, to your business decision, but do it now? Because how long is this loophole gonna open for and right now to do when a rebate is expensive? That&#8217;s the best way to rank? Really?<\/p>\n<p>Michael Veazey 3:53<br \/>\nYeah, that makes sense. I mean, I think it&#8217;s a very grown up way of looking at business quite calmly from a distance , Okay, so let&#8217;s, let&#8217;s look at the three levels, if you like, like, for example, if you go back to the seller, review things for those of us who have been around for a while, as you say, first of all, back in the day, yes, you could basically just buy reviews effectively, or influence people heavily. And quite understandably, that was against the spirit of the review system, but not against the letter of the law as it stood at that point. If you tried to be the nice guy, everyone passes you. But there is a point where that flips on his head, because you&#8217;ve been very aggressive. Suddenly, Amazon turns around, because quite rightly, the press was accurately I think, saying that their system was inaccurate. So yeah, and this is sort of strategy, overall strategy, in other words are not tactical plan. So<\/p>\n<p>Paul Harvey 4:39<br \/>\none thing I want to state about that is just about the ones that when Amazon then stopped the incentivized reviews &#8211; there was a period of a year and a half where there were tons of Amazon Coursera courses pushing out, it&#8217;s so easy now because you just list your product. And there&#8217;s on these that review sites get sold out, and so and so forth. And it was so easy. When Amazon then changed the rules. People had no marketing experience. They have no to launch a product, do anything. And then it&#8217;s a tough spot. And actually, during that period, actually, as I told a number of sellers that use these incentivize review services, it&#8217;s him listen, you&#8217;re missing out and learning how to do your own marketing. You&#8217;re taking a shortcut, and I will come back and bite you. And yeah, I did. And I knew I was part of a course back then. I hopped on this training course there was with the I think there&#8217;s over 150 people. And once that&#8217;s review system stopped the course closed down. Because people do know women&#8217;s has not learned Facebook ads PPC stuff. They can&#8217;t.<\/p>\n<p>Unknown Speaker 5:42<br \/>\nYeah, you&#8217;ve actually got to be grown up marketer. Yeah, I that&#8217;s a really good. So I think this is the grown up from this of it is like, number one, everyone else is doing it. So if you don&#8217;t, you&#8217;re going to lose out. But number two, it&#8217;s going to change. So have alternative marketing stop started. Number three, I guess that implies is be very aware of where Amazon&#8217;s at with this. And they didn&#8217;t change to incentivize review thing, because it was kind of in their interest because of things that like five star products, people will buy it. So it made my Amazon a lot of money.<\/p>\n<p>Michael Veazey 6:11<br \/>\nYeah, but then it just it was starting to affect their brand with consumers, which is sacred. So then they changed it. Whereas in this case, it&#8217;s all the same stuff again, isn&#8217;t it? I mean, when when it starts appearing on the 10 O&#8217;Clock News and Guardian articles and the Telegraph and all the sudden maybe I don&#8217;t know, depending on which demographic you&#8217;re after? These are the British newspapers, guys, you&#8217;re listening from America, whatever it is, you know, almost significantly in social media, then yeah, okay, they&#8217;re gonna have to change. It is funny how old school I am. And it is like the major papers is the main place that things need to be of course, it&#8217;s not going to be it&#8217;s going to be on social media, I guess. But yeah, at that point, it affects their brand that affects whether people go to Amazon or actually stop going to Amazon. And whether they trust Amazon to buy or not buy. Once that starts happening. Yeah, they&#8217;re going to change it. So we&#8217;ve got a, if you&#8217;re doing something that&#8217;s higher risk, it&#8217;s just like a good tennis player, you&#8217;re going to put the ball just inside the line. And and the closer you are to the line, the more accurate you need to be. And then we need to keep an eye on that Germany. So make sense. So okay, we&#8217;ve done all the legal stuff. So it works for now. So how are we going to get it? How does this actually work them?<\/p>\n<p>Paul Harvey 7:15<br \/>\nOkay, so now, there&#8217;s two options here right now. Because rebates are a very trending strategy right now, especially with a chatbots, that you can actually automate everything as if you use many chats, you can actually automate the whole process where customer will actually buy your product and then send you the order ID and then I think if you&#8217;re using it, others APO Integra metal and check your Amazon account for the order ID and if they&#8217;re already kind of a positive, they would then do an automatic PayPal refund. So pretty much all might have to do a PayPal refund too much, maybe maybe do add another product to send the customer because maybe you&#8217;re doing a buy one, get one off of whatever it is. So you can always make everything, which is great. And I recommend everybody went to do that. However, I was actually speaking to So Michael, you&#8217;ve met Steve salmansohn. And about two months back, myself and me and my partner and such apart and Steve or was all chatting, right? And we&#8217;re talking about automation. And we&#8217;re saying to Steve, you know, we really want to do automation of rebates and search efforts. You guys, wait a minute, guys, like, Are you saying, you want to automate a way to take money out of my account on a regular basis? I have no control over this. I&#8217;m monitoring it. And we like Yeah, he goes, why I want to be bankrupt within a few weeks, then this is ridiculous. How many people how many people actually do that? How many people are actually aware of this? And guess again, it was a good point there? What if What if your whole flow went viral? You could be bankrupt overnight? Yes, there are ways restrictions bound using put in place, however, to learn those boundaries and restrictions. takes a while was the deep learning curve. So right now, I said to everyone, that&#8217;s great. Go ahead and do that. But what I do right now is I&#8217;ve a rebate flow that talks about customer saying, and I don&#8217;t I say to them, this is for you, I do sets for you. But they&#8217;ll always ask why is this for you. So the reason is for us because we went to our we went to we do a launch and when to find out your feedback, we found your feedback about the buying process, the delivery, product improvements on so forth, the customer knows away, my day went by some feedback from me. And then later, I can ask them for review, which is black hat review, but used to or just not know, I often don&#8217;t, because the customer now knows away minutes, they found the catch, their company wants feedback. So they never I never, I never asked for feedback. But because all I wanted to say all but it makes sense to customers eyes while we doing this because free is a big catch was it free. And then in the flow, we say to them great, given that they&#8217;re searching by instructions, and they go by it, and so on and so forth. And we&#8217;re do as well, it&#8217;s the little ninja trick that when you do search and buy, the key word they search for, we use a feature into the chat box that goes cycles through keywords. So if you&#8217;re saying baby blankets, or play or say to you would say, please search for blue baby blankets for me or say, please search for baby blankets for boys. So pretty much every time you actually automate your relevancy towards the keywords, you do a search and buy through any keyword you wish, which is really, really powerful. But anyway, you carry on through that the customer does, there&#8217;s a whole search by instructions, they buy it, and they submit you with either your photo photo screenshots, or they give you the order ID. And then what I do then is I have a VA that manually handles all the stuff. So we will be she knows when rebates from 8am to 12pm or maybe like 2pm, whichever. Because she has to be aware by doing these things. And as soon as somebody submits a voter ID or someone submits a screenshot of the order, she would they get the email address and run the people through to them. Which is great. And I prefer this because I just a VA or all the automation. Yeah, I<\/p>\n<p>Michael Veazey 11:11<br \/>\nthink you&#8217;ve made extremely good point, which I think we was worth underlining, which is that whatever system you got sensor phone, you you kind of want marketing&#8217;s go viral, but you kind of don&#8217;t want the economics of it and negative. So yeah, it&#8217;s, it&#8217;s and that&#8217;s the classic thing, whether you still get that now there&#8217;s that they call it a check box of death, right somewhere in the promo code section that, that should this code be public and and if you forget to uncheck that box, and then suddenly, your cocoa go viral and your entire stock gets wiped out either free or 80% offer. And that happens all the time. And yes, as you say, you can do things like reserving order, you reserve stock for two weeks, and there&#8217;s there&#8217;s definitely ways around it. But a lot of people aren&#8217;t very fluent with that. And if it&#8217;s in any way uncertain, if you look at the problem, okay, maybe I always think in terms of risk reward toes, like maybe a 5% chance of getting my entire stock wiped out that that&#8217;s not risk that&#8217;s worth taking and dollars to get your product launch, if there&#8217;s a way of doing this more that safer. So this reminds me also an intensive sort of cash management of the very old school thing, which is you want to automate inflows of cash to your business, and you want to write a check or something for all of your in a very old school, especially in the UK, but you want to write a check for all of your bills, because that means they have to invoice you, and then you have to manually approve the check. And then you have to get it in the post. And then they have to take it to the bank. And then it takes four days to clear or whatever it is. That is the same thing. Like you want to protect your income, but you want to make it as easy as possible for people to buy. And then that means overall that so protecting your cash flow is more light and 10 up and down. Right. So that it&#8217;s a very wise thing when somebody who&#8217;s an expert in automation tells you not to automate things, because that&#8217;s the downside.<\/p>\n<p>Paul Harvey 12:57<br \/>\nThe guy that does more containers in a weeks than more most amazon sellers do a year. Every Sunday. So he&#8217;s a pretty serious guy.<\/p>\n<p>Michael Veazey 13:05<br \/>\nYeah, I&#8217;m conversations to get him in for the 10k collective podcast. Yeah, yeah, he&#8217;s a serious deal. So absolutely. And when somebody who&#8217;s who&#8217;s got that level of experience tells you stuff is worth listening, so that that&#8217;s very, very smart.<\/p>\n<p>Michael Veazey 13:20<br \/>\nSo tell me a little bit more, you can use chat bots to improve PPC as well. So this is a bit of another ninja tactic that we mentioned. So tell me a bit more about that.<\/p>\n<p>Unknown Speaker 13:30<br \/>\nSo this actually, actually, this is brand new, I&#8217;ve been told you about this. So now what people&#8217;s asked me, What super URLs do you use? Do you use a store friends, the add to cart, the brand new URL, everything. And to be honest, I haven&#8217;t used a super URL now for two years, purely because in all my life flows, I do search and by me, I give the customer search and by instructions. So maybe I want to rank for bit, the keyword baby blankets, I tell them top in baby blankets on Amazon, and our product on page two is a picture of it, purchase it. That&#8217;s it. And I prefer this because Amazon can see Wait a minute, customers are coming to the homepage, topping the keyword and going through this audience finding this product, therefore, this product must be relevant for the keyword. So you ranking with him. And he goes through the roof, however, very much interacting with him and see I forget the data now. But I think it&#8217;s like over 70 data points in helping you rank. So there&#8217;s only I don&#8217;t know how many how many data points this is but you know, searching by, but when if the customer tops in a baby blanket and they see your sponsored ad for baby blankets. And then they click on your sponsored add to cart and purchase. What happens then? Well, that&#8217;s an extra ranking point for Amazon because Amazon sellers women&#8217;s this customer clicks on this one to that and bought immediately. Therefore this product must be really particular keyword. And this, this product would then have a lower a class and a lower Amazon ads. Remember the Amazon ads? Think about it? Does Amazon make more money off a actually let&#8217;s say this, Michael, let&#8217;s say for example, you&#8217;re a best seller, and a very poor seller, very slow seller. and up and up. But it&#8217;s a $5 a click and you bid one click, Amazon will send you over me because you are better than Amazon, there&#8217;s more choice making a sale for you, then he&#8217;s with me. Amazon makes more money off the sale. So it&#8217;s really important to note that now it was nice seeing women people caught up in a keyword clicking on this part of their ad and buying. Now you&#8217;re a cost drops. And your relevancy improves. So so people ask. So people always apprehensive saying all I know we&#8217;re going to spend more money and PPC because it&#8217;s more everyone&#8217;s budget and like yes. But it pays off in the long run, you are sending so many social signals to your listing. And Amazon cannot avoid it. Amazon says women I&#8217;ll go He loves us. And your ranking goes through.<\/p>\n<p>Michael Veazey 16:10<br \/>\nExcellent. And the thing is that it&#8217;s so penny wise pound foolish if you&#8217;re going to spend money on getting people to the list in the first place. It&#8217;s going to cost you money or getting to Amazon. So yeah, the bottom line is that you want to tickle the algorithm and say this product is relevant to your customers and is going to make you money. So there&#8217;s always the three audiences that are involved, right with rankings. Number one, Amazon is it going to make the money number two, the customer who is God in Amazon&#8217;s eyes, eyes are going to keep them coming back to Amazon is going to keep the trust. That&#8217;s the brand thing. And that&#8217;s going to make the money in the end of the day. Right? So if you can do those things I was in is going to reward you. And that means high rankings it means more visibility, which means more sales, bigger market share, we&#8217;ve already talked about the importance of that. And everything else good flows on that. So yeah, it&#8217;s it&#8217;s just such a no brainer, really. But you&#8217;re gonna have to devote more money to the Lord. So I think that&#8217;s why another thing that&#8217;s common to the really successful sellers that we both personally know is that they are reading to spend a lot of money to launch in a very aggressive way. But they don&#8217;t depend on the expensive traffic sources for ongoing money. But the point about this is that yes, it&#8217;s more expensive. But it says such powerful ranking signals that you&#8217;re going to get the organic ranking, which means that you get free traffic for Amazon. And that&#8217;s, you know, in the Amazon jet stream, what if you call it then, you know, then then you in business, right? And then you can basically dial back on all the expensive marketing and dial up your price and you&#8217;re sitting pretty. And so it&#8217;s 100% makes sense? Well, look, Paul, I know you&#8217;ve got to rush off and take care of your, your different businesses, the Amazon businesses, their software as a service, which I understand is it is pretty hard work. But you&#8217;ve done the hard work for everyone else. So that you know, you&#8217;ve done the sweat behind the scenes that everyone else can do an easier job of launching. Thank you so much for your honesty and wisdom about the limitations of these things and how to box clever. And that is not a silver bullet, but that it really is extremely effective. We can pull now. So how do people get ahold of you? And what what are the options that you offer? Just briefly,<\/p>\n<p>Unknown Speaker 18:10<br \/>\nbest thing to do, I&#8217;d say to everyone is reach out to me at the chat box or just pull so the chatbot reach out to the and if I&#8217;m if I&#8217;m slow to respond to just make it support etc chatbots purely because, yeah, let&#8217;s see, we&#8217;ll jump on it and force force me to take action because my inbox I think it&#8217;s over for But anyway, reach out to us and search up but and then we often currently is what we recommend to everyone is this is we have to buy some basic templates to basic top of the packages, you sound right now, monthly fee, and then you can get going right now and use the chat button search hyperdrive. And I can do everything that other platforms can use. So basically, if you will use a chat widget on your website, if you went to use Facebook ads or anything really anything that means I can do we pretty much can do a mini chats with some so on set up differences. Secondly, welcome to everyone is we have some advanced training advanced templates. For example, let&#8217;s say maybe you want to do a with a fortune that has rebates, big discounts and viral sharing in it. That&#8217;s a really cool flow we have, you can do all that stuff, advice templates with was comes with advanced training, which is basically me just talking you through a whole bunch of strategies, which I use, use my clients as well. And, again, if you get the advanced training, I apologize, because you will be sick of my voice very, very soon. I think it&#8217;s fun.<\/p>\n<p>Michael Veazey 19:36<br \/>\nI don&#8217;t think you have a big problem with voice I trust me, I&#8217;ve interviewed a lot of people I think is good as anyone else. But I think the fact that you&#8217;re not a BS artist, he kind of already helps with a foot in this kind of arena. So the advanced training with you and that there&#8217;s a basic version of that. And then from what you&#8217;re saying, you know, you mentioned clients, so presumably people can get hold of you to discuss working with us in that, you know, an agency effectively. So it goes it That sounds to me, like there&#8217;s basically three different ways to work with you. Right? So there&#8217;s the basic use of this, Allah chatbot. There&#8217;s the advanced training and templates. And and then there&#8217;s working with you, you know, personally, and you guys implement this stuff for them. Right. Excellent, good. So and just remind us of the URL that people want to get going to in fact, you know what, we&#8217;ll put it in the show notes. It&#8217;s going to be easy, isn&#8217;t it? She wasn&#8217;t gonna be a long one. So that&#8217;s great stuff. Thank you so much for for coming back on the show.<\/p>\n<p>Paul Harvey 20:36<br \/>\nThank you. Michael was a lovely chat.<\/p>\n<p>Michael Veazey 20:38<br \/>\nIt&#8217;s always good. Yeah, I really enjoyed talking to you. And and I like I said that the fact that you got that master teacher background, you got that way of analyzing things. And you&#8217;re honest, I know that that ability to combine those two is really good in an area where, as you say, if someone gets obsessed with rebates, and that&#8217;s the only basic launch mechanism, that that&#8217;s all very well until it gets closed down, and then they&#8217;ll be out of business. So I like that the fact you put that in perspective, but you&#8217;re not being puritanical, it&#8217;s like, okay, you know, you can do it for the moment, the loophole will be closed. But for now, let&#8217;s make a but with with a bit of wisdom. So what&#8217;s the last piece of advice you&#8217;d have for somebody who&#8217;s, who&#8217;s launching products? Whether it&#8217;s the first product or they&#8217;ve been around for a while, I guess it says would be very general advice, what would you say?<\/p>\n<p>Paul Harvey 21:23<br \/>\nPretty much, that means that the best advice I can give to everyone is basically like teacher top advice is just get out there and fail as fast as you can. I know Facebook ads, I don&#8217;t think I get that. I know chatbots, I don&#8217;t it. However, if it&#8217;s not enough for you, it&#8217;s daunting for your competitors, I spend about half an hour every day just researching pages. And I recommend to recommend everyone go into the Facebook ads library, you can see them or the ads from your competitors top in their rebate, you can see them or the rebates as you come across and take notes, how horrendous the ads or how her this they bought flows are, have yet to come across by flow that I&#8217;m like, Wow, that&#8217;s cool. because there aren&#8217;t you? Well mean by that is, if you can get ahead, now, you&#8217;re in a good spot. And I&#8217;m not talking about ourselves at work, just having a small budget, maybe like $100, whichever and, and use that you just burned through to learn. And you learn more about burning and wasting your money than you would do sometimes by wisely investing because you&#8217;re learning to invest, you&#8217;re learning to market.<\/p>\n<p>Michael Veazey 22:30<br \/>\nExcellent advice. And I love what you&#8217;re saying. And I don&#8217;t have the sense of this as accurately as you do. But the fact that everyone else is doing it terribly, is always a good sign that you shouldn&#8217;t be so worried about nothing good. And, and also because it is fairly new, and people tend to approach it in the way they&#8217;ve approached other things that work a different way. And when somebody is treating my seller chatbots services anyway, the ones that I get on, basically like bad email marketing is just spam, spam, spam, pitch, pitch pitch. So all you suggested earlier is like nurturing people, immediately if you do that, which you&#8217;ve heard already from Paul, so you know, just give them good content. And you know, the audit says and what content they want from them the strategy you suggested, it&#8217;s not going to be hard to be better at. And one thing I&#8217;ve noticed,<\/p>\n<p>Paul Harvey 23:11<br \/>\nand this is something we need to be careful of is that a whole bunch of this rebate flows rebid ads, everything was clear. As soon as I click on the ad, this was a Chinese English was terrible to speak to them. It was it as terrible as like, wow, as an English speaker, we&#8217;re in a good spot. Because they can. I mean, I songs for China said they like in terms of numbers, in terms of units, they can just easily manufacture more, but they can&#8217;t. They&#8217;re to hire someone has good English speaker for the weekend. So but again, that won&#8217;t last long.<\/p>\n<p>Michael Veazey 23:48<br \/>\nAbsolutely. I mean, that&#8217;s the other thing that amazes me just to wrap up on is that we are in a golden period right now where the Chinese sellers are still, although they&#8217;re producing better photographs now on Amazon, but they still have a habit of writing awful English and things that just don&#8217;t appear to be like, have happy time. This is just such such a major Hello, this is a neon signs. And this is a Chinese seller, that cannot last I mean, somebody who&#8217;s spending collectively billions of dollars a year on marketing to Amazon. At some point, the penny simply has to drop, that you could hire somebody fairly cheaply, who&#8217;s a native English speaker to do your copywriting for you. And so crazy, radical idea, but it&#8217;s got to happen at some point. And at that point, we lose our advantage. So again, yeah, talking of playing, you know, making hay while the sun shines, and that&#8217;s going to change as well. So you know, it&#8217;s a, it&#8217;s a crazy depressing thought to end on. But in some ways, I also like, but it&#8217;s brilliant time right now, to get into the the fact that you could buy any kind of exist, as you said, doesn&#8217;t have to be Shakespeare, but you know, it&#8217;s going to be make you stand out in a world of terrible advertising.<\/p>\n<p>Michael Veazey 24:50<br \/>\nIn the in the world of the blind, the one eyed man is king, I guess, as well, we&#8217;re saying so. Cool. Thank you so much coming on. It&#8217;s fantastic.<\/p>\n<p>Paul Harvey 24:57<br \/>\nThank you, Michael.<\/p>\n<p>Michael Veazey 24:58<br \/>\nSo what a welcome change to have somebody so humble and straightforward and honest as well about the pitfalls as well as of different approaches in the Amazon space for in internet marketing Germany, but particularly for somebody who sells software as a service. And training has truly exceptional, which is why I&#8217;ve got Paul on the show multiple times, we&#8217;ll have him on again, because he&#8217;s aware and important kind of person from our point of view, also happens to be very, very competent otherwise, or that niceness wouldn&#8217;t count for anything. So nice. Plus competent, is basically what I require my guests these days, and pretty much anyone I hang out with the within the Amazon community so pulls a very trustworthy guy, which I think is the ultimate reason why it&#8217;s even worth considering. Listen to what he has to say. And very competent. Don&#8217;t forget, this is a man who&#8217;s very modest. And he didn&#8217;t sort of present that as a his sort of pitch about himself at the beginning of the show. But the fact is that he sold least two Amazon businesses in the last couple of years that he&#8217;s built from scratch. So an extremely capable ecommerce seller in his own right, but now also doing the software stuff. So if you are even thinking about a chatbot thing, I&#8217;d really suggest you check out seller chatbot. Because not only is Paul a very serious amazon seller himself and knows exactly what you really need. But and this is really important, he has created the processes already. So even if they weren&#8217;t programmed into his chatbot software, that is really worth having because reinventing the wheel folks is just painful and totally unnecessary. And so if you use many chat, and then you have to create your own chatbot flows that are untested, you&#8217;re gonna have to go through a lot of expensive testing and a lot of time and effort. That&#8217;s just not worth doing. In my experience, in my opinion, if you&#8217;re going to do something, and not everybody should be using chatbots as part of their marketing, they may assess it and decide that is not the right marketing channel for them. Because there are multiple different ways of marketing things. And that&#8217;s absolutely cool. But if you are going to do it, I would suggest very strongly you at least give it a trial, or or you know, try it for a month or two before using somebody else&#8217;s software because it is relevant to what you do. So it&#8217;s going to save you hours of time of reinventing the wheel. From point of view, if you are interested either in the seller chatbot basic thing itself or the more advanced training, I know that they advanced training is currently on sale for $299 at the time of recording, so late July, early August, but I believe that they&#8217;re going to take that down that offer in a few days, and it will go back to the standard price $499. So if you are a considering getting some advanced charting of some of the stuff that Paul&#8217;s been talking about with rebates and Facebook ads, obviously, you are going to learn as Paul said, you know, the best way to learn experience, but you might as well start from a training structure of somebody who really knows that onions. And if you&#8217;re going to do that, we have a deal for you at amazing fba.com forward slash chat bot that&#8217;s CHATBOT, amazing fba.com for size chatbot. And once again, just to be clear and honest, yes, I am an affiliate for Paul. But I&#8217;m proud to be associated with Paul, because he&#8217;s a super smart guy. He&#8217;s kosher, if you like a real person, a real amazon seller, and very good at creating products and services that serve people. So I&#8217;m very happy to be associated with him. And of course, like any affiliate, so deal, that means that the merchant, I the person selling the end stuff is the person who ends up paying for it. So you would never pay more through an affiliate link. So there&#8217;s no downside, really, but do whatever you like and go through whatever links you like. But I would say the final thing to say is this, by all means assess chatbots and make the decision. There&#8217;s some very smart sellers, I know do that it&#8217;s not part of the marketing mix that they think is the right way of them spending their money and effort. But I wouldn&#8217;t dismiss it without at least understanding in some detail what&#8217;s going on. Because if nothing else, your competition is using chat bots. And they&#8217;re going to be using them on a bigger and bigger scale over the next coming period. It&#8217;s very obvious where the trends going. So inform yourself If nothing else, so that you know what the environment you&#8217;re selling is going to be like over the next few months and couple of years. So that you go in smart, the end, education of the right kind doesn&#8217;t necessarily mean you have to do everything. But you should be aware of things that&#8217;s just as important in my view, because we don&#8217;t work in isolation and they&#8217;re really smart. So let&#8217;s know that everything they do is relative to the competition and the demand and that&#8217;s grown up selling. Thanks very much for listening speech in the next show.<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F343_Rebates_for_Amazon_with_Paul_Harvey_Seller_Chatbot-30_07_2019_16_28.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Frebates-for-amazon%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/343_Rebates_for_Amazon_with_Paul_Harvey_Seller_Chatbot-30_07_2019_16_28.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=6837-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/343_Rebates_for_Amazon_with_Paul_Harvey_Seller_Chatbot-30_07_2019_16_28.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"343_Rebates_for_Amazon_with_Paul_Harvey_Seller_Chatbot-30_07_2019_16_28.mp3\">Download<\/a> (Duration: 29:34 &#8212; 54.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 29:34 &#8212; 54.2MB)Subscribe: Spotify | Email | RSS<\/p>\n","protected":false},"author":1,"featured_media":6839,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[4],"tags":[1853,1198,1202,1466,1467,1468,1470,1469],"class_list":["post-6837","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-amazon-fba","tag-amazing-fba-podcast","tag-amazon-chatbot","tag-chatbot","tag-chatbot-for-amazon","tag-chatfuel","tag-manychat","tag-paul-harvey","tag-seller-chatbot","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>#343 Rebates for Amazon with Paul Harvey of Seller Chatbot<\/title>\n<meta name=\"description\" content=\"Rebates for Amazon launches are a hot topic these days. Should you use them? Are rebates with Amazon TOS? And if so, what are the does and don&#039;ts?\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/rebates-for-amazon\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"#343 Rebates for Amazon with Paul Harvey of Seller Chatbot\" \/>\n<meta property=\"og:description\" content=\"Rebates for Amazon launches are a hot topic these days. Should you use them? Are rebates with Amazon TOS? And if so, what are the does and don&#039;ts?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/rebates-for-amazon\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-08-01T05:00:22+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-13T04:47:52+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/Copy-of-Private-Label-Strategy_-Who-to-Follow_-1.png?fit=560%2C315&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"34 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/rebates-for-amazon\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/rebates-for-amazon\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"#343 Rebates for Amazon with Paul Harvey of Seller Chatbot\",\"datePublished\":\"2019-08-01T05:00:22+00:00\",\"dateModified\":\"2020-05-13T04:47:52+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/rebates-for-amazon\/\"},\"wordCount\":7078,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/rebates-for-amazon\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/Copy-of-Private-Label-Strategy_-Who-to-Follow_-1.png?fit=560%2C315&ssl=1\",\"keywords\":[\"Amazing FBA Podcast\",\"Amazon chatbot\",\"chatbot\",\"chatbot for amazon\",\"chatfuel\",\"manychat\",\"paul harvey\",\"seller chatbot\"],\"articleSection\":[\"Amazon FBA Private Label\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/rebates-for-amazon\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/rebates-for-amazon\/\",\"url\":\"https:\/\/amazingfba.com\/rebates-for-amazon\/\",\"name\":\"#343 Rebates for Amazon with Paul Harvey of Seller Chatbot\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/rebates-for-amazon\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/rebates-for-amazon\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/Copy-of-Private-Label-Strategy_-Who-to-Follow_-1.png?fit=560%2C315&ssl=1\",\"datePublished\":\"2019-08-01T05:00:22+00:00\",\"dateModified\":\"2020-05-13T04:47:52+00:00\",\"description\":\"Rebates for Amazon launches are a hot topic these days. Should you use them? Are rebates with Amazon TOS? And if so, what are the does and don'ts?\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/rebates-for-amazon\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/rebates-for-amazon\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/rebates-for-amazon\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/Copy-of-Private-Label-Strategy_-Who-to-Follow_-1.png?fit=560%2C315&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/Copy-of-Private-Label-Strategy_-Who-to-Follow_-1.png?fit=560%2C315&ssl=1\",\"width\":560,\"height\":315,\"caption\":\"Rebates for Amazon launches\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/rebates-for-amazon\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"#343 Rebates for Amazon with Paul Harvey of Seller Chatbot\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"#343 Rebates for Amazon with Paul Harvey of Seller Chatbot","description":"Rebates for Amazon launches are a hot topic these days. Should you use them? Are rebates with Amazon TOS? And if so, what are the does and don'ts?","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/rebates-for-amazon\/","og_locale":"en_GB","og_type":"article","og_title":"#343 Rebates for Amazon with Paul Harvey of Seller Chatbot","og_description":"Rebates for Amazon launches are a hot topic these days. Should you use them? Are rebates with Amazon TOS? And if so, what are the does and don'ts?","og_url":"https:\/\/amazingfba.com\/rebates-for-amazon\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-08-01T05:00:22+00:00","article_modified_time":"2020-05-13T04:47:52+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/Copy-of-Private-Label-Strategy_-Who-to-Follow_-1.png?fit=560%2C315&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"34 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/rebates-for-amazon\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/rebates-for-amazon\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"#343 Rebates for Amazon with Paul Harvey of Seller Chatbot","datePublished":"2019-08-01T05:00:22+00:00","dateModified":"2020-05-13T04:47:52+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/rebates-for-amazon\/"},"wordCount":7078,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/rebates-for-amazon\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/Copy-of-Private-Label-Strategy_-Who-to-Follow_-1.png?fit=560%2C315&ssl=1","keywords":["Amazing FBA Podcast","Amazon chatbot","chatbot","chatbot for amazon","chatfuel","manychat","paul harvey","seller chatbot"],"articleSection":["Amazon FBA Private Label"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/rebates-for-amazon\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/rebates-for-amazon\/","url":"https:\/\/amazingfba.com\/rebates-for-amazon\/","name":"#343 Rebates for Amazon with Paul Harvey of Seller Chatbot","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/rebates-for-amazon\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/rebates-for-amazon\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/Copy-of-Private-Label-Strategy_-Who-to-Follow_-1.png?fit=560%2C315&ssl=1","datePublished":"2019-08-01T05:00:22+00:00","dateModified":"2020-05-13T04:47:52+00:00","description":"Rebates for Amazon launches are a hot topic these days. Should you use them? Are rebates with Amazon TOS? And if so, what are the does and don'ts?","breadcrumb":{"@id":"https:\/\/amazingfba.com\/rebates-for-amazon\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/rebates-for-amazon\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/rebates-for-amazon\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/Copy-of-Private-Label-Strategy_-Who-to-Follow_-1.png?fit=560%2C315&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/Copy-of-Private-Label-Strategy_-Who-to-Follow_-1.png?fit=560%2C315&ssl=1","width":560,"height":315,"caption":"Rebates for Amazon launches"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/rebates-for-amazon\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"#343 Rebates for Amazon with Paul Harvey of Seller Chatbot"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/Copy-of-Private-Label-Strategy_-Who-to-Follow_-1.png?fit=560%2C315&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-1Mh","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6837","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=6837"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/6837\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6839"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=6837"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=6837"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=6837"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}