{"id":7068,"date":"2019-09-24T06:00:47","date_gmt":"2019-09-24T05:00:47","guid":{"rendered":"https:\/\/amazingfba.com\/?p=7068"},"modified":"2020-05-13T05:47:31","modified_gmt":"2020-05-13T04:47:31","slug":"product-research","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/product-research\/","title":{"rendered":"Product Research with Dani Avitz of Algopix"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F355.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fproduct-research%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/355.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=7068-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/355.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"355.mp3\">Download<\/a> (Duration: 26:10 &#8212; 21.3MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Product research is very much intertwined with market research and keyword research. In essence, you need to analyse demand and profitability.<\/p>\n<p><!--more--><\/p>\n<p><span style=\"font-weight: 400;\"><strong><a href=\"https:\/\/algopix.idevaffiliate.com\/idevaffiliate.php?id=118\">Algopix<\/a> <\/strong>is a product market research tool for Amazon sellers. Algopix is a trusted data source for over 65,000 sellers worldwide. <\/span><\/p>\n<h4><b>Which marketplaces are we talking about? (Amazon\/eBay etc.)?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">Amazon eBay Walmart<\/span><\/p>\n<p><span style=\"font-weight: 400;\">16 total marketplaces<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Co-founder Ori and Dani built a seller agency<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Biggest pain point was dead inventory &#8211; almost 20% of inventory $450 B dollars<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Improved results of reducing dead inventory 12-7% <\/span><\/p>\n<h4><b>Who are the different kinds of sellers on Amazon\/marketplaces you work with? <\/b><\/h4>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Resellers<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Private Label sellers before investing &#8211; and invest competitors<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Brands who want to understand their own catalogue <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Wholesalers<\/span><\/li>\n<\/ul>\n<h4><b>What is the difference, in your opinion, between “product research”, “market research” and “keyword research”?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">Very much related and intertwined. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Info is mostly related to different markets<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Eg specific product &#8211; UPC, ASIN etc. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Market level &#8211; demand level, competition, sales history. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Sales history &#8211; sales performance &#8211; unit sales and revenue &#8211; important for research. <\/span><\/p>\n<h4><b>If you have a specific product in mind<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">The product identifier is for a specific product. <\/span><\/p>\n<h4><b>Searching more broadly<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">This is more about keyword research &#8211; broader keyword searches and gets relevant product listings. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A new tool in <strong><a href=\"https:\/\/algopix.idevaffiliate.com\/idevaffiliate.php?id=118\">Algopix<\/a><\/strong> for this. <\/span><\/p>\n<h4><b>Which types of Amazon reseller need to focus on keyword research?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">Private label sellers don’t have a specific product in mind &#8211; this is good for them. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For brand owners to analyse their brand they need to be as general as they can so they don’t miss the competition. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Whereas wholesalers have a specific product identifier to analyse. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">From the data analysis, they can see how.<\/span><\/p>\n<h4><b>What are the top 2-3 key factors for deciding what markets to enter? (Product research\/market research\/kw research) <\/b><\/h4>\n<p><span style=\"font-weight: 400;\">The three top factors are demand, profitability and competition. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Sufficient demand is critical but doesn’t have to be huge. Sufficient is defined by profitable. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Profitability &#8211; you need to consider ALL your costs<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Not just purchasing, but shipping, taxes &#8211; marketplace fee &#8211; payment provider eg PayPal<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Regarding Competition: the key is to avoid crowded markets to avoid price wars. This is usually connected to demand as well. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Medium to high demand and low-to-medium competition is the sweet spot. <\/span><\/p>\n<h4><b>How do you analyse demand?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">Look at past info c<\/span><span style=\"font-weight: 400;\">ombine with common sense &#8211; or use machine learning and an algorithm which Algopix does for you. <\/span><\/p>\n<h4><b>How do you go about competitor analysis?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">Even in a market will low competition, you should never neglect them. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Competitive analysis is critical. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">On Amazon, you look at the total number of competitors<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Factors include: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Buy box price &#8211; winners of buy box get 90% of traffic. <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">reviews<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Sales volume  <\/span><\/li>\n<\/ul>\n<h4><b>How do you define a competitor?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">Firstly if you’re looking for a specific product using an identifier, this is simpler. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">But if a user uses a broader keyword term, you need to distinguish between relevant and irrelevant search results.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Algopix can do this, Eg “watch” won’t bring up “watch batteries&#8221;.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Sometimes there are in-between things that could be or not relevant. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">This is where human judgement is still needed. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Algopix also learns about how you work with results and results on the basis of what you do <\/span><\/p>\n<h4><b>How does profitability come into your market\/product choice?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">It is obviously critical to running a good business. SO it’s also critical in choosing a market. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you’re selling a low and medium price product, you need to consider<\/span><\/p>\n<p><span style=\"font-weight: 400;\">&#8211; marketplace fees<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Shipping<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Payment processing fees (eg Paypal on eBay) <\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Returns<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Storage fees<\/span><\/li>\n<\/ul>\n<h4><b>Profitability mistakes<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">The classic error is that business owners fall in love with being an e-commerce seller<\/span><\/p>\n<p><span style=\"font-weight: 400;\">They get proud of making $10-20,000 a month in sales. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Then they go to the bookkeeper and they get a different picture!<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Dani and Ori’s agency had big customers who sold offline.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">But when they got their first online sale, a CEO (who managed 200 people) still called them excited!<\/span><\/p>\n<h4><b>How do people find out more about Algopix?<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">Youtube channel, blog etc. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Free tools eg converting EAN, to UPC<\/span><\/p>\n<h4><b>Dani has recorded a video walk-through for Amazing FBA listeners\/viewers, here: <\/b><\/h4>\n<p><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/dm7eb9FWE7U?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-GB&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"><\/iframe><\/span><\/p>\n<h4><b>Are you offering any special bonuses for Amazing FBA listeners? <\/b><\/h4>\n<p><a href=\"http:\/\/amazingfba.com\/algopix\"><span style=\"font-weight: 400;\">Amazingfba.com\/algopix<\/span><\/a><span style=\"font-weight: 400;\"> <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">A full analysis of the entire Amazon inventory<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">This shows the most profitable products and also money drains.<\/span><\/li>\n<\/ul>\n<p><em>This page contains affiliate links. That means that Amazing FBA will receive compensation from the service or product seller (&#8220;The Merchant&#8221; if you click on the link and go on to buy that service or product.<\/em><\/p>\n<p><em>We only promote those products or services that I have throughly vetted (in many cases, personally use) and truly feel deliver value to you. It will never cost you extra to go via our affiliate link as opposed to going direct. Indeed, we always try to get an extra deal or bonus for Amazing FBA listeners and readers.<\/em><\/p>\n<p>&nbsp;<\/p>\n<hr \/>\n<h3>TRANSCRIPT:<\/h3>\n<p>Michael Veazey 0:20<br \/>\nstarting a business on your own can be lonely and worrying. selling online multiplies this issue tenfold. Getting expert help is a great way to reduce anxiety wasted time and confusion. The amazing FBA mentoring program is in its fourth year of helping sellers to get started on Amazon. By now we have former clients who have starting from scratch, done six figures and even in one case, seven figures a year. Obviously, these are not typical results. These are exceptional people. Nevertheless, we can help you get launched faster, safer, and with a much higher chance overall of success. with clients from Melbourne models Australia, to Manchester, England, we bring a genuinely international perspective. To find out more go to amazing fba.com forward slash mentoring. Thanks for listening.<\/p>\n<p>Unknown Speaker 1:12<br \/>\nLadies and gentlemen, welcome to the amazing MBA podcast. This is your host Michael Beasley today we&#8217;ve got Danny from aka pics with us, aka pics is a product of market research tool for Amazon sellers. And it&#8217;s a trusted data source by over 65,000 sellers worldwide. So there&#8217;s always always a need for product research and tools that help us do that. So always needed Danny a warm welcome to the show.<\/p>\n<p>Unknown Speaker 1:35<br \/>\nThanks, Michael. It&#8217;s a pleasure speaking with you here today, and hopefully we&#8217;ll be able to share some of our insights with your listeners.<\/p>\n<p>Unknown Speaker 1:43<br \/>\nYeah, Greg, just to quickly tell us where in the world you&#8217;re coming to us from because I always forget to ask that question. It&#8217;s always interesting.<\/p>\n<p>Unknown Speaker 1:51<br \/>\nSo I&#8217;m Beth Israel and actually I will be says the two different headquarters, the r&amp;d team based in Tel Aviv, Israel and the businesses quarters.<\/p>\n<p>Unknown Speaker 2:03<br \/>\nOh wow. So quite a quite a few different locations globally. And I know there&#8217;s this kind of major tech startup in the this Israeli tech startup seems pretty massive but for whatever reason you&#8217;ve got a real flair for that so so tell us first of all let&#8217;s let&#8217;s get into the the chase now listeners which marketplaces we talking about we talked about Amazon only or is it eBay? Or what sort of things this outcome pics how people researching?<\/p>\n<p>Unknown Speaker 2:26<br \/>\nOkay, so I&#8217;ll pick suppose the three major marketplaces on the US and the Europe, which means Amazon, eBay and whatnot. Those are the marketplaces where the majority of ecommerce sales happen in total support 16 different markets, eight of Amazon seven of eBay and Walmart. The reason why we chose those marketplaces, is because that before we started over PEX, my co founder and I spent over six years building an e commerce agency, the temp to online service to selling third party marketplaces exactly like even Amazon, we found out that one of the biggest pain points is the inventory, or what we call to the excess inventory. research says that almost 20% of our inventory and surplus the dead inventory equals to 450 billion dollars every year. So this is the problem, I would like to tackle it from our own records, we have a proven results of reducing the inventory from 20% in average to 7%, which is a significant change for online business<\/p>\n<p>Michael Veazey 3:38<br \/>\ncredit. So I have to ask you a bit about the dead inventory thing. The second I mean, first question, I suppose is what kinds of sellers Do you work with? Is it all sort of resellers and when so dead in the tree, I suppose. And particularly happens if you&#8217;re a retailer and you buy you know, 5000 things for the Christmas rush and then you only sell 3000, that sort of thing. But it&#8217;s those early resellers or as a private label is what sort of people work with your stuff.<\/p>\n<p>Unknown Speaker 4:03<br \/>\nActually, we work with the quiet range of sellers, those can be resellers who used to source new products on a weekly basis and we help them with their procurement process. And brands wants to know more about their online presence private label seller suppose who wants to perform a decent market research before they invest in the next product? Because it&#8217;s you know, it takes money and energy. Or maybe those all maybe they want to analyze the competitors, stores and products, which we haven&#8217;t done as well. Although keepers, having said that, Olympics is also proven to be very useful for for brand owners, manufacturers and wholesale businesses. So you can see the basic that basically, the whole ecommerce world can make use of the data we provide.<\/p>\n<p>Michael Veazey 4:51<br \/>\nYeah, I guess it makes sense because it&#8217;s, in the end, is kind of marketplace centred rather than the sort of business model centred. Okay, so let&#8217;s come to this one questions. One of my favourite topics to bang on about, get your opinion, the difference? What&#8217;s the difference in your opinion between product research, market research and keyword research in an e-commerce context?<\/p>\n<p>Unknown Speaker 5:12<br \/>\nOkay, that&#8217;s an excellent question.<\/p>\n<p>Unknown Speaker 5:16<br \/>\nOkay, so product research and market research are very much related in between. So when you are researching the specifics of the product, the information is mostly related to different markets. So for example, you&#8217;re conducting product research if you&#8217;re searching for a specific product. So you get the information about the product specifications and dimensions for the identifiers, such as CPC and the next scene, and it says shipping dimensions. When it comes to market level information over please provide the product market price on different 16 markets. Its demand level competitions Thursday, three a breakdown of the expenses associated with setting the like I mentioned, we provide says history information. So if it&#8217;s important for me, to elaborate more about this point, we have an accurate report about the sales performance of the product from the past 30 days, consisting of the unit sales and revenues. So those are all data points that you want to look for when conducting product and market research. When you do your research, you already have a specific product in mind most of the time. That&#8217;s why you use the product identifier for best results instead of simply search for a fitness tracker, for example. But obviously, there are situations where you don&#8217;t have a specific product in mind yet. For example, when you want to grow as market opportunities, and scout new niche products, you cannot search with product identifiers. Instead, you need to rely on keywords, discover your product, right. So that&#8217;s why that&#8217;s what we mean by keyword research. You use brother products, keywords for your research and then receive a comprehensive overview of relevant product listings based on your interests search them. And actually, we have recently launched a new tool called our boutiques product discovery that answers this particular situation.<\/p>\n<p>Michael Veazey 7:20<br \/>\nRight? Yeah. So I suppose to summarize from what you&#8217;re saying that if you are a product researching your universe by the very specific products, you looking at you PCs, or aliens or the sort of alphabet soup of barcodes that you get from Amazon, which is one of the things that takes a bit getting head around if you need to the space. And then the opposite thing. If you&#8217;re not specific, then you need to think about keywords, which makes sense. I think the other way I would put it is that there&#8217;s the kind of customer centric view of things versus the product centric, right? So customers use keywords, whereas was once you&#8217;ve got a premise in the marketplace, and people are looking for that particular product. It&#8217;s more about product names, right. So okay, insane. Now, obviously, you got tools that the couple of those different areas, which types of sellers, and do you think need to focus on keyword research, who particularly should be looking at keyword research, and whether they&#8217;re new or more established.<\/p>\n<p>Unknown Speaker 8:13<br \/>\nSo I think that first of all, a private seller, private label sellers, of course, because usually they maybe they have in mind a specific niche or category, but they usually don&#8217;t have a specific product in mind. So the best way to discover new products against new ideas, and perhaps see what&#8217;s going on today, that will be the best for them. In addition, when we&#8217;re talking about brand owners, so they would like to analyze their brand, and they will would like to be as generic as they can, so they won&#8217;t miss any relevant or related competition. And usually people who buy and sell like resellers or host resellers, no wholesalers, they have a specific product in mind, because they just got a price this from one of their suppliers. So they have a specific identifier, which they would like to analyze. That was the long answer. The short answer is anyone can do whatever he wants. Usually, we see we actually we, we analyze our users search patterns. And we see that sometimes wholesalers use the keywords as well. And vice versa. Because when RPX gives you unlimited search, such as some on a monthly basis, you don&#8217;t want to hold yourself, you don&#8217;t want to block yourself, and you want to get everything you can from our platform.<\/p>\n<p>Michael Veazey 9:46<br \/>\nRight? Okay, so what then it be being zoom back out to those who are just probably more likely to be the new private label sellers and anyone else. But if people are thinking about a new market, and you&#8217;re thinking about what factors are to decide on that market, what are the top two to three key factors in your experience, and the data shows are important to be aware of.<\/p>\n<p>Unknown Speaker 10:12<br \/>\nThis is going to be my subjective opinion. But I would say the three top factors are demand profitability and competition. First off, sufficient demand is obviously Christian for a successful lab business. Because at the end of the day, you&#8217;re not going to sell anything if nobody&#8217;s interested in buying your product. But sufficient does not mean that half of the country needs to be your buyer. So I would say that demand can be considered to be sufficient when you can operate your business profitably. This leads us to the second key factor, which is profitability. Of course, you will want to learn to earn money with your business, it&#8217;s important to consider all of your costs when calculating profitability. So this means you not only need to factor in the cost of purchasing the product, but also the cost for shipping their product or customer, the taxes you owe him depends how you price it needs to pay any marketplace fee, that main core and fees that you need to pay to providers such as PayPal, if you sell on eBay, for example, you can only accurately determine the profitability of your product with a complete and accurate picture of your costs. The third factor is competition. markets that are crowded with competition should be avoided in most cases, because you often you often end up in price was that us, I mean, usually use it to drive down profits for everyone. Competition is usually connected to demand because the higher the level of demand, the more sellers are attracted to enter the market or to sell this product, right. This is what you need to find the good balance. So you really want to market with medium to high demand and low to medium level of competition.<\/p>\n<p>Michael Veazey 12:08<br \/>\nAmen to that, I think it&#8217;s sounds like a funny thing to say, it&#8217;s really 19. I always feel because I&#8217;ve been doing this for years now that everyone knows this, but they don&#8217;t I mean, I continuously work with people who are new to the Amazon Marketplace, even people with a strong business background in other ways. They somehow get blinded by the dollar signs. And they they see a high demand market and they just assume that that means it&#8217;s a high value for them. And of course, it&#8217;s not about the total addressable market size. It&#8217;s how much you can get that. So I agree really wonderfully, simply put medium to high demand and low to medium competition. And also is not no competition, folks. There&#8217;s no real thing as such thing as a profitable market with no competition, at least as pretty incredibly rare. So let&#8217;s talk about analyzing demand, how do you actually go about determining demand? Let&#8217;s talk about Amazon first, but be interesting to touch on eBay, which gets neglected buyers and sellers. So think be interesting to take it that. So demand on Amazon first.<\/p>\n<p>Unknown Speaker 13:05<br \/>\nSo when they show that nobody knows what&#8217;s going to happen tomorrow, right? So the best you can do is redundant information in the past and combine it with your common sense to come up with a reasonable prediction for tomorrow&#8217;s demand. In our case, we have replaced common sense with our algorithms backed by using machine learning and artificial intelligence. Now, how important is analyzing the competition, it&#8217;s super important. It&#8217;s really good because you always step ahead of your competition. Even in a market with low competition, you should never neglect what your competitors are doing. And how do you even know who your competitors are? So one could argue that To answer this question, you first need a competitor analysis. So regardless of the amount of competition you&#8217;re facing, a competitive analysis lays the groundwork to becoming instinct, number one in your field or industry, how do other people go about competitor analysis. So if we take Amazon as an example, like us, there are several things you can look at. First of all, you want to look at the total number of sellers. So offering this product, this immediately gives you a better picture of how many competitors you&#8217;re facing. Right, you will also check if Amazon themselves this product, that you want to check whether the product is already being sold via Amazon FBA fulfilled by Amazon or not, if not, this is a good opportunity to provide better service for the customer, right. Another thing is the Bible spice. For those who are not familiar with the AMA was on by box. This is their permanent YX box on the right side of the Amazon political page, where customers begin the checkout process, when a customer puts the add to cart or buy now button in this box, they are buying from the Bible sooner. So actually, by booksellers, they get like 90% of the traffic. So it&#8217;s important to know the Bible express in order to be eligible to win, there are so many other indications, including the products bestseller ranking on Amazon&#8217;s catalog, the number of reviews the quality, and of course, the frequency and much more. And this gives you a better perspective on the competitive landscape by offering all those key pieces of data and much more as the products rank and Amazon&#8217;s catalog for all categories mapping,<\/p>\n<p>Michael Veazey 15:29<br \/>\nalso not so common sense things ever. So I think what you saying about never neglect to the competition, even when you&#8217;re considering a market is really important. In the end. What interests me is, is this question which you mentioned already about defining what competition is, and there&#8217;s a lot of metrics out there in different kinds of software that will say, Okay, you got 10,000 competitors for this particular keyword. So my question is defined competitive, because if you put the keyword into Amazon, for example, read, I don&#8217;t know, I&#8217;m trying to think of something obscure. I, there&#8217;s probably everything on Amazon. But if you put certain keywords in, I can&#8217;t think of where I&#8217;ll find red leather gloves with green polka dots, which will be a kind of unusual fashion choice, right? I mean, there&#8217;s probably somebody selling it, but then you&#8217;re going to get a load of other results, which aren&#8217;t particularly relevant to the query. So my question is, at what point do you cut off? and say, This is not actually our competition? And what how do you use machines for that, versus humans? It&#8217;s a big area. But let&#8217;s just get into it.<\/p>\n<p>Unknown Speaker 16:34<br \/>\nIt&#8217;s definitely be around this first, I know, we are the only one who does that. So let&#8217;s divide, I&#8217;m going to divide my mindset into two parts. So first, when you&#8217;re looking for a specific product, by using this identifier, so we know how to find this product in different markets to have the normalization, and to provide you only with the relevant products. So this is this is a I mean, it&#8217;s very hard. But when it comes to your question, it&#8217;s easier because the user enter the specific product. And they know that the providing information only about this specific product. However, what happens if someone if a user tries like to search for broader term, and then he gets a non relevant product. So from one hand, he knows how to differentiate between the relevant and non relevant product. So for example, if you want to look for a watch, will probably be one show you watch battery, on the road cherries and some other stuff that are not relevant for you, right? However, sometimes. So this is clear that we&#8217;re not going to show it to you. However, sometimes there are things that are like in between, and we you might be interested in or a new minute. So based on your query, based on the sometimes you can, you can also check, you can I mean, you can choose the market you&#8217;re interested in. And you can also check by using our main search engine, to, to check for a price range. So based on this input, the overall input, we give you the product that we think you&#8217;ll find interesting was now based on your behavior afterwards, I want to save this search are going to stay out of time and to analyze to to read it. Or maybe you wanted you after two seconds, you started searching for another product. So we learn new, we understand what results you find interesting and relevant for business and whatnot. And we improve our self every on database actually on on the search. percentage. So if you started your first day today, but you were in 15 different sets, the session under 15, probably would will be much more customers and titled for you rather than search number three.<\/p>\n<p>Michael Veazey 19:08<br \/>\nYes. So broadly speaking, your software and I guess this is probably you know, whatever software you use is could be the same. So if you use it a broad term, you want something that can differentiate between relevant, relevant products, and even say the word today, and there&#8217;s always going to be those edge cases where I think this is where a human being who understand the market is going to be critical. Because if you don&#8217;t understand the market, you&#8217;re going to be just being purely led by the numbers and you have no interest in any particular product, or more importantly, in my opinion, a particular type of customer, you want to help with a particular problem, then I think you&#8217;re going to be in trouble when it comes to making decisions about is this relevant to their query or not? Because you have no idea. So does it seem that a machine could go so far, and that&#8217;s not fair that I think there&#8217;s always a human input needed. The other thing is adjusting to Vegas that your machine actually learns. That&#8217;s really cool. Because it&#8217;s a bit like having a system whether it&#8217;s again, machine or an assistant, you need something that over time lens, I Mike doesn&#8217;t like massive long spreadsheets, he wants a very detailed version or you know, that&#8217;s not the kind of thing we should be spending too much time on. So that&#8217;s very interesting how you adjust that way. And that that&#8217;s very smart. I think that&#8217;s a fairly unique feature. That&#8217;s not something I know from other products, software products. I mean, product research software&#8217;s right, so bright. So we&#8217;ve looked at them, and we&#8217;ve looked at competition. So let&#8217;s look at profitability is always a difficult thing, because there are so many different factors to take into account. Right? So how does, how does that come into your market choice?<\/p>\n<p>Unknown Speaker 20:32<br \/>\nSo well, early mentioned previously, profitability is a crucial, it&#8217;s crucial to running a successful business. And to achieve profitability, you need to have the complete and accurate picture of all expenses related to selling your product online. Often the bulk of your cost is the product itself. But if you&#8217;re setting the lower medium priced product, other costs play a much bigger role as well. You need to consider fees for shipping the marketplace, PayPal and taxes of the market, you&#8217;re selling game. And only when you incorporate all of those posts in your calculations, you can determine your bottom line. And of course, I hope it helps you with that as well.<\/p>\n<p>Michael Veazey 21:17<br \/>\nthere any particular things that you think people tend to miss out on where they&#8217;re making these calculations? Or the was the biggest mistake you see people you have made, especially when you did your agency days in the past? I guess you&#8217;re more interactive with your customers directly. What would you say the big mistakes are the profitability side.<\/p>\n<p>Unknown Speaker 21:34<br \/>\nSo many times, people, they fell in love with new title. I&#8217;m an ecommerce seller. And they say, Hey, I just sold I don&#8217;t know, $10,000 or $20,000 this month, but in the end of the day, when they&#8217;re going to the bookkeeping, or the accountant, and they start analyzing what happens and what what&#8217;s margin is going to look like. So they get a different picture. And I totally can understand it. I mean, starting a new online business, it&#8217;s exciting. new opportunity, you say, Hey, I can continue the road, right? And when you have the first sale, I mean, it, it&#8217;s amazing. You&#8217;re so excited, you know, because I had we had in our previous company, big customers, we used to sell offline. And then they when they had their first online service, the CEO, which manages like 200 people called us and he was so excited. So all the cares about being able to say, Hey, we&#8217;re selling. And, of course, if it&#8217;s if it&#8217;s bigger companies, and they have board members and investors so so they usually are reflected to the investors and everybody are looking at the end result which which you said, but nobody&#8217;s taking a look at the profit, which by by the way we didn&#8217;t talk about but we have returns, which is a disaster for ecommerce business, so many different factors. So and as far as I see it, if you can improve your sourcing process, your procurement process, and to reduce your dead inventory from vivo take 20% this is what I&#8217;m sure that if you you&#8217;re an online seller, and you listen to what I say now 20% make sense for you. Just imagine you were able to reduce it to 7% then take the gap and see how it impacts your profit. So my advice for all sellers is okay, when you have your very first service or even afterwards is great. But don&#8217;t forget to KE to take everything into consideration, including customer service, including storage fees, including everything. So you see how important the sourcing process is. If you didn&#8217;t buy good you won&#8217;t be able to be successful ecommerce, ecommerce seller.<\/p>\n<p>Michael Veazey 24:12<br \/>\nYeah, great. That says what they say is that the profit profit is made when you buying it when you sell it. That&#8217;s the sassy classic thing. And I really like I really liked your story about the CEO he&#8217;s got 200 people that they&#8217;re managing and they&#8217;re obviously facing different business but their first online sale and we get an exciting phone call because it&#8217;s not just people who are new to the markets that forget to measure profitability when I was speaking some the other day who&#8217;s been selling an e commerce since 2003. And he&#8217;s doing he&#8217;s definitely seven figure seller may even be eight by now. And they had a bad year a few years ago because they just got so fed they read Miss descended and they got obsessed with sales, partly because they were looking at what the competition was doing. It was like venture back to that really huge capital behind them. And of course it&#8217;s very easy to get excited to go Why don&#8217;t we go ambitious and build 100 million dollar company in says revenue. But of course, it was not profitable. You got to go broke. So it sounds really really obvious and it kind of is but people forget it. So yeah, I think you&#8217;re right. It&#8217;s just so funny that even really experienced business people kind of think the internet is magic money machine and that they can partner with economics and I like that reality check that like No, that&#8217;s not true.<\/p>\n<h3><strong>Watch my full interview with Dani Avitz<\/strong><\/h3>\n<p>[video_page_section type=&#8221;youtube&#8221; position=&#8221;bottom&#8221; image=&#8221;&#8221; btn=&#8221;light&#8221; heading=&#8221;&#8221; subheading=&#8221;&#8221; cta=&#8221;&#8221; video_width=&#8221;1080&#8243; hide_related=&#8221;false&#8221; hide_logo=&#8221;false&#8221; hide_controls=&#8221;false&#8221; hide_title=&#8221;false&#8221; hide_fullscreen=&#8221;false&#8221;]https:\/\/www.youtube.com\/watch?v=_OYsdsPo2Z8&#038;feature=youtu.be[\/video_page_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F355.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fproduct-research%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/355.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=7068-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/355.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"355.mp3\">Download<\/a> (Duration: 26:10 &#8212; 21.3MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 26:10 &#8212; 21.3MB)Subscribe: Spotify | Email | RSSProduct research is very much intertwined with market research and keyword research. In essence, you need to analyse demand and profitability.<\/p>\n","protected":false},"author":1,"featured_media":7089,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1837],"tags":[1853,1589,1592,1595,1593,1594,1590,1591],"class_list":["post-7068","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-starting-an-ecommerce-business","tag-amazing-fba-podcast","tag-consumer-research","tag-market-research-firms","tag-market-research-process","tag-market-research-report","tag-marketing-research-process","tag-product-market-research","tag-research-companies","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Product Research with Dani Avitz of Algopix<\/title>\n<meta name=\"description\" content=\"Product research is very much intertwined with market research and keyword research. In essence you need to analyse demand and profitability.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/product-research\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Product Research with Dani Avitz of Algopix\" \/>\n<meta property=\"og:description\" content=\"Product research is very much intertwined with market research and keyword research. In essence you need to analyse demand and profitability.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/product-research\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-09-24T05:00:47+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-13T04:47:31+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/355.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"26 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/product-research\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/product-research\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Product Research with Dani Avitz of Algopix\",\"datePublished\":\"2019-09-24T05:00:47+00:00\",\"dateModified\":\"2020-05-13T04:47:31+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/product-research\/\"},\"wordCount\":5252,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/product-research\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/355.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"Amazing FBA Podcast\",\"consumer research\",\"market research firms\",\"market research process\",\"market research report\",\"marketing research process\",\"product market research\",\"research companies\"],\"articleSection\":[\"Starting An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/product-research\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/product-research\/\",\"url\":\"https:\/\/amazingfba.com\/product-research\/\",\"name\":\"Product Research with Dani Avitz of Algopix\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/product-research\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/product-research\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/355.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-09-24T05:00:47+00:00\",\"dateModified\":\"2020-05-13T04:47:31+00:00\",\"description\":\"Product research is very much intertwined with market research and keyword research. In essence you need to analyse demand and profitability.\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/product-research\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/product-research\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/product-research\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/355.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/355.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/product-research\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Product Research with Dani Avitz of Algopix\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Product Research with Dani Avitz of Algopix","description":"Product research is very much intertwined with market research and keyword research. In essence you need to analyse demand and profitability.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/product-research\/","og_locale":"en_GB","og_type":"article","og_title":"Product Research with Dani Avitz of Algopix","og_description":"Product research is very much intertwined with market research and keyword research. In essence you need to analyse demand and profitability.","og_url":"https:\/\/amazingfba.com\/product-research\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-09-24T05:00:47+00:00","article_modified_time":"2020-05-13T04:47:31+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/355.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"26 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/product-research\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/product-research\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Product Research with Dani Avitz of Algopix","datePublished":"2019-09-24T05:00:47+00:00","dateModified":"2020-05-13T04:47:31+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/product-research\/"},"wordCount":5252,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/product-research\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/355.png?fit=1280%2C720&ssl=1","keywords":["Amazing FBA Podcast","consumer research","market research firms","market research process","market research report","marketing research process","product market research","research companies"],"articleSection":["Starting An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/product-research\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/product-research\/","url":"https:\/\/amazingfba.com\/product-research\/","name":"Product Research with Dani Avitz of Algopix","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/product-research\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/product-research\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/355.png?fit=1280%2C720&ssl=1","datePublished":"2019-09-24T05:00:47+00:00","dateModified":"2020-05-13T04:47:31+00:00","description":"Product research is very much intertwined with market research and keyword research. In essence you need to analyse demand and profitability.","breadcrumb":{"@id":"https:\/\/amazingfba.com\/product-research\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/product-research\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/product-research\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/355.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/355.png?fit=1280%2C720&ssl=1","width":1280,"height":720},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/product-research\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Product Research with Dani Avitz of Algopix"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/355.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-1Q0","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/7068","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=7068"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/7068\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/7089"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=7068"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=7068"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=7068"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}