{"id":738,"date":"2016-08-08T06:00:25","date_gmt":"2016-08-08T06:00:25","guid":{"rendered":"http:\/\/amazingfba.com\/?p=738"},"modified":"2021-01-28T14:58:30","modified_gmt":"2021-01-28T13:58:30","slug":"78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/","title":{"rendered":"#78 Selling an ecommerce business with Coran Woodmass &#8211; Part 2"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F_78_Selling_your_Amazon_Business_with_Coran_Woodmass_Part_2-auphonic.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/_78_Selling_your_Amazon_Business_with_Coran_Woodmass_Part_2-auphonic.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=738-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/_78_Selling_your_Amazon_Business_with_Coran_Woodmass_Part_2-auphonic.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"_78_Selling_your_Amazon_Business_with_Coran_Woodmass_Part_2-auphonic.mp3\">Download<\/a> (Duration: 51:57 &#8212; 47.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><h3 class=\"p1\"><span class=\"s1\"><b>Who would buy my business?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">Typically, from about $20k to $2.5mil, you’re looking at individual investors. Above that, from $2.5 to $5 million there is a bit of a black hole because individual investors don’t have that kind of capital. Some do, but it’s rare. Above that $5 million mark your are looking at private equity firms and larger businesses.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">Let’s talk about the $20k to $2.5 million. These individual investors’<span class=\"Apple-converted-space\">  <\/span>primary driver is fear of loss. They don’t want to lose their investment. So they are looking for an ROI better that what they would get if they left it in a bank or mutual fund. Within this groups of investors, you have a few different types. <\/span><\/p>\n<h4 class=\"p1\"><span class=\"s1\"><b>Retirees<\/b><\/span><\/h4>\n<p class=\"p1\"><span class=\"s1\">Many of the buyers Coran worked with early this year, didn’t know anything about Amazon. They were former business people that have retired and got bored with brick-and-mortar businesses so they started buying up FBA businesses. This type of buyer has business experience, but may not be tech-savvy or have and understanding of online business. They will typically look for a business that have been around longer. <\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">You may need to educate them on how easy it is to run an FBA business compared to something with staff, overhead, or property. You can offer support and virtual hand-holding until they can run the business themselves. You will also want to upfront about everything, good and bad, about your business because if they find something down the road, they will bolt faster than other types of investors. Like we said, they have that fear of loss. <\/span><\/p>\n<p class=\"p1\"><span class=\"s1\"><br \/>\nAnother thing you’ll want to do is create procedures. Write them out as if it’s for your grandmother. Stuff like writing out how to log in to seller central. If you have staff or contractors that can transfer to the new owners, that would be awesome. Also, if there is opportunity for discounts from your suppliers for larger purchases, have that as well.<\/span><\/p>\n<h4 class=\"p1\"><span class=\"s1\"><b>Executives<\/b><\/span><\/h4>\n<p class=\"p1\"><span class=\"s1\">You also have high-paid executives make $100-200k a year and are looking to replace their income so they can live a life of leisure.<\/span><\/p>\n<h5 class=\"p1\"><span class=\"s1\"><b>Online Entrepreneurs <\/b><\/span><\/h5>\n<p class=\"p1\"><span class=\"s1\">Another is actual online entrepreneurs and other FBA businesses that may have rolled other businesses for profit. They have a large pool of capital and are looking for a competitive advantage. They will be looking for ways to boost the business’ profit. Not only are they looking to get a better return than the bank, but are also looking to add value.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>Should you have an idea of what kind of buyer you want when you start the business?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">Keep the buyer types in mind, but don’t build your business around it. You would limit your buyer pool to one particular type. However, it would be very difficult to build your business so narrow as to limit it to one buyer type unless you built a massive business to appeal to private equity.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>What are the main things that you would need across all buyers?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">Writing procedures will always be a big help. Have your spouse of a friend, that doesn’t know anything about selling on Amazon, follow your procedure and see if they can do it. Get your staff to write procedures about what their doing.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>Let’s say you have a business that’s a year old and you need to sell it, what is the best way to go about it? Should you sell to another Amazon business?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">We discussed the gold standard before and how you need to have so many products, be defensible, diverse traffic, and age. As you fall short in different categories, that narrows the pool of buyers as well as lowers the value of your business.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">As far as selling to another Amazon business, Coran hasn’t done that yet but it’s an interesting idea. Typically a strategic buyer will be willing to pay a premium because they will be looking to apply their expertise to the business and add value. However, most of the FBA businesses Coran deals with tend to struggle with cash-flow and have a hard time keeping up with inventory. So an Amazon business will have to be fairly large in order to have the capital need to make that purchase.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">Also, if you open your business up to your competitors, it will give them an inside look into your business with could hurt you in the long-run.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>How do you build a sensible barrier so you don’t give inside information to a competitor?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">Coran only works with a handful of qualified buyers and sellers at a time. The buyers are legitimate. They have the cash and have typically bought before and if he brings them the right business then he knows they are buying.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">The next level down depends on how you advertise your business. If you’re using a broker, you’ll need to talk to them. For Coran, if that initial buyer pool isn’t interested, but it’s still a good business, he go wider and tap into his network of classified sites and other brokers that may have buyers. In that case, they will talk among themselves trying to find buyers for that business. They keep the information out of the public space as much as possible.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>How do you make a product more defensible?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">One thing that’s helpful is to add more products to a packet. A recent sale he did was where they had twice the amount of items to package, their packaging was great. If you don’t skimp on the packaging and your brand is strong, it adds a layer of protection that someone will have to get past if they want to compete.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>Is brand strength important when trying to sell a business?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">Absolutely. Unless you can build out 50 or 100 products, which would take a ton of capital, you’ll need every advantage you can get.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>Is intellectual property valuable when trying to sell?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">Yes. Brand registry on Amazon is great. Having a patent or registered trademarks is very good. A patent is good because while expensive, and won’t increase the multiple that an investor is willing to go for, it will make it more attractive compared to other businesses. If a buyer is looking at three or four businesses they are trying to decide between, this may give you an edge to sway them towards your business.<\/span><\/p>\n<h5 class=\"p1\"><span class=\"s1\">Pro tip: <\/span><\/h5>\n<p class=\"p1\"><span class=\"s1\">Research existing patents on your private label items. Coran spoke of someone that is looking to expand their product line but is now caught up in a patent lawsuit over a very basic item. If you sell your business, the buyer will be liable for the history of every item so they will definitely be looking into any patent infringements prior to buying. Also, if there is a lawsuit while your selling, any possible sales will be over. If is shortly after a sale and there is an earn-out deal, it will complicate things.<\/span><\/p>\n<h4 class=\"p1\"><span class=\"s1\"><b>Earn-out deal: <\/b><\/span><\/h4>\n<p class=\"p1\"><span class=\"s1\">When your selling a business with ongoing income, the multiple they paid is linked to that income. Often, to reduce the risk for the buyer, they will offer you 70% or 80% of the purchase price upfront. Then there will be an earn-out, which could mean different things. It might include 90 days of support, in which you help them run the business until they get a handle on it. Sometimes it will be linked to income, which is something Coran tries to avoid. He has seen earn-outs of up to 12 months. They might leave 10% to you in equity in order to keep you involved in running it.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">Since you are, potentially, legally involved in the company for 3 to 12 months following the sale, you don’t want to sell something that violates patent laws.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>What are the best ways to protect yourself and avoid having patent issues?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">Considering the complexity of patents, and patent laws, the best thing you can do would be to hire an attorney that specializes in patents. It will cost money, but when it’s time to sell your business this is the best way to do it.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">As an ongoing business there are some tools that can help you do a quick patent search, but noting can compare to hiring an expert.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>How do I find a buyer?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">The important thing, if you find a buyer, hire a lawyer. You’ll want to protect yourself from any issues. <\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">You can use services like <a href=\"https:\/\/www.escrow.com\/\"><span class=\"s2\">escrow.com<\/span><\/a>. It’s a very popular service when dealing with these types of transactions. <\/span><\/p>\n<p class=\"p1\"><span class=\"s2\"><a href=\"https:\/\/flippa.com\/\">Flippa.com<\/a><\/span><span class=\"s1\"> – The downside is that all transactions are public. So you don’t want to use this with an indefensible private label business. Definitely not recommended. They do have a service called deal flow, which is semi-brokerage. The listings can be confidential and you have access to more buyers.<\/span><\/p>\n<p class=\"p1\"><span class=\"s2\"><a href=\"https:\/\/empireflippers.com\/\">Empireflippers.com<\/a><\/span><span class=\"s1\"> – Coran has worked with them in the past and is highly recommended.<\/span><\/p>\n<p>You can also learn about <a href=\"https:\/\/www.beyourmaverick.com\/website-flipping\/\">website flipping<\/a> where you can do purchasing, improving, and then selling websites.<\/p>\n<p class=\"p1\"><span class=\"s1\">There are individual brokers out there. There are websites that have websites listings, but only if you have a lot of time to invest in it.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">Coran, admits he may be biased, but he says the best way to go is with a broker. The deal structures can get complicated and you want someone who is going to be personally vested in achieving a successful sale.<\/span><\/p>\n<h4 class=\"p1\"><span class=\"s1\"><b>Let’s say I have a business that is doing $5000 in EBITDA profit, it’s got 5 customized products but not original design, and had been in business for two years. What kind of multiple will that get?<\/b><\/span><\/h4>\n<p class=\"p1\"><span class=\"s1\">As far as any FBA sales is concerned, they range from 1-3x EBITDA. With this situation, err on the lower side of things. Probably expect 2x, and you can move up or down from there. Let’s say the products are equal in revenue and you’re getting sales from somewhere other than Amazon. In this scenario you’re looking at 2-2.5x EBITDA; that would translate to about $120,000 &#8211; $150,000. In this. we’re talking about USD since most buyers use the US dollar.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>How does it work when selling a UK based company to someone in the US?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">We only deal in asset sales. So the company is on top of that and what we’re selling is everything underneath that. That would be your products, your brand, you website, your actual inventory, the central seller account, etc.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">A sidenote about the seller central account, you can’t sell it outright. What you can do is transfer it to a new owner. Amazon doesn’t like it if you claim to be selling the account. So you just transfer business information, addresses, in the US it would be the EIN etc.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">Things can get difficult if it’s a UK seller. Many in the US will be out automatically so it’s easier to just sell it to a buyer in the UK. However, since it’s an asset sell, you can definitely sell to someone in the US. The one thing that can be affected by selling to someone in another country are your suppliers and contractors. You will need to make sure they are comfortable working with someone in a different country. Some may have terms, like 60-90 day terms that might not be transferable. So you will need to work that out with your supplier. This is can be avoided if your selling within the same country. If your supplier is in China or other parts of Asian, they’re used to dealing with foreign companies.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>Since it’s more difficult to sell a UK based company, is it viable to build up a UK based business?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">Coran is currently speculating in the UK, he’s trying to build connections with buyers in the UK. In his experience, it is very limited since most buyers are in the US. If you want to build a UK business to sell, it will be difficult.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>If you have a business that sells in the US and the UK, can you sell all of it or would you need to split it and sell the US business to a US buyer and hang on to the UK wing?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">If you have a foothold in the US, even if it’s not the bulk of your sales, it will attract more US buyers so you would want to sell it all together.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>What&#8217;s working well right now with Amazon businesses that are selling well?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">Coran refers back to the gold standard. Being more defensible, have more products that are unique. People are becoming more familiar with the business model and are looking for where you are beyond Amazon.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>How do listeners get hold of you or find out more about you?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s2\"><a href=\"http:\/\/thefbabroker.com\/\">thefbabroker.com<\/a><\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">Make sure to get the toolbox Coran set up exclusively for Amazing FBA listeners at <a href=\"http:\/\/amazingfba.com\/thefbabroker\"><span class=\"s2\">thefbabroker.com\/amazing<\/span><\/a>. Also, take advantage of his off to have a one-on-one chat that is only available via this link.<\/span><\/p>\n<h3 class=\"p1\"><span class=\"s1\"><b>Do you have any parting words of advice for anyone who is considering selling their Amazon business or building one to sell?<\/b><\/span><\/h3>\n<p class=\"p1\"><span class=\"s1\">Read <a href=\"https:\/\/www.amazon.com\/Snowball-Warren-Buffett-Business-Life\/dp\/0553384619\/ref=sr_1_2?ie=UTF8&amp;qid=1470276579&amp;sr=8-2&amp;keywords=the+snowball\"><span class=\"s2\">The Snowball<\/span><\/a>. It’s about Warren Buffet and talks about business and who’s buying and how to be defensible.<\/span><\/p>\n<div class=\"_form_45\"><\/div>\n<p><script src=\"https:\/\/promusickit.activehosted.com\/f\/embed.php?id=45\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2F_78_Selling_your_Amazon_Business_with_Coran_Woodmass_Part_2-auphonic.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/_78_Selling_your_Amazon_Business_with_Coran_Woodmass_Part_2-auphonic.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=738-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/_78_Selling_your_Amazon_Business_with_Coran_Woodmass_Part_2-auphonic.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"_78_Selling_your_Amazon_Business_with_Coran_Woodmass_Part_2-auphonic.mp3\">Download<\/a> (Duration: 51:57 &#8212; 47.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 51:57 &#8212; 47.6MB)Subscribe: Spotify | Email | RSSWho would buy my business? Typically, from about $20k to $2.5mil, you’re looking at individual investors. Above that, from $2.5 to $5 million there is a bit of a black hole because individual investors don’t have that kind of capital. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":11153,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":true,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":true,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1842],"tags":[1853,472,468,474,476,477,470,471,473,623,475,624,469],"class_list":["post-738","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-selling-an-ecommerce-business","tag-amazing-fba-podcast","tag-business-broker","tag-coran-woodmass","tag-empire-flippers","tag-exit","tag-exit-strategy","tag-fba-broeker","tag-fba-broker","tag-online-broker","tag-selling-an-amazon-business","tag-selling-business","tag-selling-your-amazon-business","tag-the-fba-broker","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>#78 Selling an ecommerce business with Coran Woodmass - Part 2 - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"#78 Selling an ecommerce business with Coran Woodmass - Part 2 - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 51:57 &#8212; 47.6MB)Subscribe: Spotify | Email | RSSWho would buy my business? Typically, from about $20k to $2.5mil, you’re looking at individual investors. Above that, from $2.5 to $5 million there is a bit of a black hole because individual investors don’t have that kind of capital. [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2016-08-08T06:00:25+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-28T13:58:30+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/08\/49.png?fit=1200%2C400&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"400\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"#78 Selling an ecommerce business with Coran Woodmass &#8211; Part 2\",\"datePublished\":\"2016-08-08T06:00:25+00:00\",\"dateModified\":\"2021-01-28T13:58:30+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/\"},\"wordCount\":2240,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/08\/49.png?fit=1200%2C400&ssl=1\",\"keywords\":[\"Amazing FBA Podcast\",\"business broker\",\"coran woodmass\",\"empire flippers\",\"exit\",\"exit strategy\",\"fba broeker\",\"fba broker\",\"online broker\",\"selling an amazon business\",\"selling business\",\"selling your amazon business\",\"the fba broker\"],\"articleSection\":[\"Selling An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/\",\"url\":\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/\",\"name\":\"#78 Selling an ecommerce business with Coran Woodmass - Part 2 - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/08\/49.png?fit=1200%2C400&ssl=1\",\"datePublished\":\"2016-08-08T06:00:25+00:00\",\"dateModified\":\"2021-01-28T13:58:30+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/08\/49.png?fit=1200%2C400&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/08\/49.png?fit=1200%2C400&ssl=1\",\"width\":1200,\"height\":400},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"#78 Selling an ecommerce business with Coran Woodmass &#8211; Part 2\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"#78 Selling an ecommerce business with Coran Woodmass - Part 2 - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/","og_locale":"en_GB","og_type":"article","og_title":"#78 Selling an ecommerce business with Coran Woodmass - Part 2 - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 51:57 &#8212; 47.6MB)Subscribe: Spotify | Email | RSSWho would buy my business? Typically, from about $20k to $2.5mil, you’re looking at individual investors. Above that, from $2.5 to $5 million there is a bit of a black hole because individual investors don’t have that kind of capital. [&hellip;]","og_url":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2016-08-08T06:00:25+00:00","article_modified_time":"2021-01-28T13:58:30+00:00","og_image":[{"width":1200,"height":400,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/08\/49.png?fit=1200%2C400&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"#78 Selling an ecommerce business with Coran Woodmass &#8211; Part 2","datePublished":"2016-08-08T06:00:25+00:00","dateModified":"2021-01-28T13:58:30+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/"},"wordCount":2240,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/08\/49.png?fit=1200%2C400&ssl=1","keywords":["Amazing FBA Podcast","business broker","coran woodmass","empire flippers","exit","exit strategy","fba broeker","fba broker","online broker","selling an amazon business","selling business","selling your amazon business","the fba broker"],"articleSection":["Selling An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/","url":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/","name":"#78 Selling an ecommerce business with Coran Woodmass - Part 2 - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/08\/49.png?fit=1200%2C400&ssl=1","datePublished":"2016-08-08T06:00:25+00:00","dateModified":"2021-01-28T13:58:30+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/08\/49.png?fit=1200%2C400&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/08\/49.png?fit=1200%2C400&ssl=1","width":1200,"height":400},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/78-creating-a-sellable-amazon-business-with-coran-woodmass-part-2\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"#78 Selling an ecommerce business with Coran Woodmass &#8211; Part 2"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/08\/49.png?fit=1200%2C400&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-bU","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/738","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=738"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/738\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/11153"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=738"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=738"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=738"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}