{"id":81,"date":"2015-08-28T15:26:14","date_gmt":"2015-08-28T14:26:14","guid":{"rendered":"http:\/\/amazingfba.com\/?p=81"},"modified":"2020-06-17T06:29:02","modified_gmt":"2020-06-17T05:29:02","slug":"6-amazon-sourcing-from-china-14","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/","title":{"rendered":"#6 Amazon Sourcing from China 1\/4"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FAmazing_FBA_Podcast_6_Sourcing_Part_1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F6-amazon-sourcing-from-china-14%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Amazing_FBA_Podcast_6_Sourcing_Part_1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=81-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Amazing_FBA_Podcast_6_Sourcing_Part_1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Amazing_FBA_Podcast_6_Sourcing_Part_1.mp3\">Download<\/a> (Duration: 21:43 &#8212; 17.4MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>This Episode, #6, is the 1st of 3 parts dealing specifically with sourcing, i.e., finding suppliers, negotiating, getting samples, and getting product manufactured and sent to Amazon USA.<\/p>\n<p>It is also part 4 of 10 of the &#8220;Amazing FBA Startup System&#8221; series.<\/p>\n<blockquote><p><strong>**STOP PRESS** REVIEWS CONTEST!<\/strong><br \/>\n<script src=\"https:\/\/promusickit.activehosted.com\/f\/embed.php?id=67\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\n<p><strong>The first 25 people to review the show on iTunes will be entered into a draw. The winner will receive a £50 Amazon Voucher from Amazing FBA! <\/strong><br \/>\n<strong><a href=\"http:\/\/itunes.apple.com\/ug\/podcast\/amazing-fba\/id1030237683\">Head over to iTunes<\/a> now and leave your review! If you haven&#8217;t  already, you can also <a href=\"http:\/\/itunes.apple.com\/ug\/podcast\/amazing-fba\/id1030237683\">subscribe<\/a> through iTunes to get all the info you need to start your own successful Amazon business!<\/strong><\/p><\/blockquote>\n<p><strong>Resources mentioned<\/strong><\/p>\n<p><strong>Supplier sites<\/strong><\/p>\n<p>Sourcing from China<strong> &#8211; <a href=\"http:\/\/www.alibaba.com\/\">alibaba.com<\/a>. <\/strong>This is where nearly all  private labellers shop.<\/p>\n<p><strong>What filters to use on Suppliers on Alibaba<\/strong>:<\/p>\n<p><strong>Gold Supplier &#8211; <\/strong>Supplier pays $2500 odd to list on Alibaba.com. Not in itself a great safety check, but check how long supplier has been listed. The longer, the better.<\/p>\n<p><strong>Assessed Supplier &#8211; <\/strong>Which I called &#8220;Verified Supplier&#8221; in the Podcast. <a href=\"http:\/\/www.alibaba.com\/help\/trustworthy_faq_what_assessed.html\">Here <\/a>is Alibaba&#8217;s explanation. Basically, a 3rd party inspection company has been in to check their claims are true and that it looks like a legitimate business. Of course, this being China, we can&#8217;t be absolutely certain of the integrity the 3rd party, but it&#8217;s another level of check.<\/p>\n<p><strong>Onsite Check &#8211; <\/strong>on a laptop\/desktop, this only seems to show in the sidebar on the Alibaba site. This means they physically check the factory, which is obviously a lot better than just checking the paperwork.<\/p>\n<p><strong>Certificates &#8211; <\/strong>again, in the sidebar. For certain products, you&#8217;ll need certification for the product. E.g. 1, silicone spatula touches food so it will need FDA (Food &amp; Drug Administration) approval in USA.<br \/>\nE.g. 2, electric lamp as an electrical item will possibly need certification (More in<a href=\"http:\/\/amazingfba.com\/8\"> episode #8<\/a>  how to find out what certification is needed).<\/p>\n<p>&nbsp;<\/p>\n<div class=\"_form_69\"><\/div>\n<p><script src=\"https:\/\/promusickit.activehosted.com\/f\/embed.php?id=69\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><br \/>\n<strong>ALTERNATIVES TO ALIBABA.COM<\/strong><\/p>\n<p><a href=\"http:\/\/HKDTC.com\">HKTDC.com<\/a> (Hong Kong Trade Development Corporation). These companies are more likely to be Hong Kong based, which has a stricter regulatory environment, a legacy of its days as part of the British Empire. You&#8217;ll find slightly higher prices, somewhat less choice but hopefully more consistent quality and business practices<\/p>\n<p>Recommended by a friend of mine who is chief Procurement Officer for Europe for a huge company, so worth taking seriously if you&#8217;re concerned about supplier reliability\/product quality\/potential fraud. I found my supplier of my first product here.<\/p>\n<p>To filter out riskier suppliers, use these filters:<\/p>\n<p><strong>Company Verified &#8211; (<\/strong>Checkbox just below the search bar)<\/p>\n<p>All the major company information has been checked by <a href=\"http:\/\/www.dnb.com\/company.html\">Dun &amp; Bradstreet,<\/a> a very established (nearly 200 years old!) and respected auditing company based in the USA.   About as safe as it gets in China\/Asia generally.<\/p>\n<p><strong>Certificates Verified<\/strong> (Checkbox just below the search bar)<\/p>\n<p><strong>Quality Compliance  <\/strong>(Checkbox just below the search bar for some searches) &#8211; a check that the supplier at least on paper has<\/p>\n<p><strong>Information on how to deal with Chinese Suppliers<\/strong><\/p>\n<p><a href=\"http:\/\/www.chinaimportal.com\/blog\/china-company-verification-how-to-vet-suppliers-in-4-steps\/\">China Importal<\/a> &#8211; This company will try to sell you into a quick pricey service where they will find and assess suppliers for you. I don&#8217;t recommend that, but their blog (linked above) and their free email series are useful guides.<\/p>\n<p><a href=\"http:\/\/provenchinasourcing.com\/\">Proven China Sourcing<\/a> (eBook) by Walter Hay &amp; Jim Cockrum. This site is a sales page for &#8220;Proven China Sourcing&#8221;. It costs $97 USD. I bought it and I must say it is no B.S. precise information. But there is a lot to absorb and implement so I only recommend it if you are going to have time to do things thoroughly. If you try to implement everything in this eBook, and can only work it very part-time, you will possibly delay things by months &#8211; more or less the trap I fell into.<\/p>\n<p><strong>Glossary of Technical Terms<\/strong><\/p>\n<p><strong>MOQ &#8211; <\/strong>Minimum Order Quantity &#8211; the lowest number of units that a supplier is prepared to produce in one order.<\/p>\n<p><strong>Pieces- <\/strong>this is simply the Chinese preferred word for &#8220;Units&#8221;, i.e., the number of &#8220;copies&#8221; of a given product line to be produced.  Abbreviated to &#8220;pcs&#8221;.<\/p>\n<p><strong>Private Label Product &#8211; <\/strong>A product produced by a manufacturer who will put your logo on the product and\/or your design on the packaging. The same as &#8220;White Label Product&#8221;.<\/p>\n<p>This is the essence of the business model that I use and that for example Amazing Selling Machine promotes. That&#8217;s because it is technically a &#8220;new&#8221; product so you can use a new UPC (product code) on Amazon and have a unique product so nobody else can compete for the &#8220;Buy Box&#8221; (more on this in future episodes). Also you are building your brand every time you sell a unit.<\/p>\n<p><strong>OEM &#8211;<\/strong>In normal usage with Chinese suppliers, it means the same as &#8220;Private Labelled&#8221;, ie with your own logo and\/or packaging design.<\/p>\n<p>In theory, OEM stands for &#8220;Original Equipment Manufacturer&#8221;. Also in theory, it refers to your own design being produced by a factory. Technically the alternative term for Private Labelling should be &#8220;ODM&#8221; but I&#8217;ve yet to find a Chinese supplier who uses that term.<\/p>\n<p><strong>FREIGHT INCOTERMS<\/strong><\/p>\n<p>Freight is dealt with in more detail in <a href=\"http:\/\/amazingfba.com\/9\/\">Episode #9<\/a>, but I thought it worth putting this in here as you&#8217;ll need to understand what prices you&#8217;re being quoted during the phase of looking for suppliers and negotiating.<\/p>\n<p><a href=\"https:\/\/logisticsmgepsupv.files.wordpress.com\/2015\/05\/incoterms-1.jpg\">&#8220;Incoterms&#8221; <\/a>are internationally agreed freight terms<b>. <\/b>Chinese Suppliers are familiar with some of these, although as ever, they tend to use them in their own way.<\/p>\n<p>There are 11 incoterms, each with a unique 3-letter abbreviation. The most important thing each does is: to define precisely when the responsibility for the shipment passes from the Seller to the Buyer. You can further split that into Risks, Responsibility and Costs but I don&#8217;t believe you should overthink this at this stage of knowledge!<\/p>\n<p><a href=\"https:\/\/logisticsmgepsupv.files.wordpress.com\/2015\/05\/incoterms-1.jpg\">Here&#8217;s a chart <\/a>showing the detail. The good news is that there are only 3 incoterms you&#8217;ll probably need to discuss or understand:<\/p>\n<p><strong>EXW<\/strong> &#8211; &#8220;Ex Works&#8221; &#8211; this is the price straight from the Factory Gates. I would never advise you buying on these terms because it means you would have to engage a Freight Forwarder to get the product through all the hoops (clear Chinese customs, get put on board plane, get freight plane over to USA, clear USA customs, etc. etc). But as it involves basically no Freight, it means you have a like-for-like comparison for price between different suppliers if you want to be extra thorough.<\/p>\n<p><strong>FOB &#8211; &#8220;Free on Board&#8221; &#8211; <\/strong>The Seller will pay for Land transport to the port, export customs, and loading on board the ship. This technically can only be used with Sea Freight but the Chinese use it all the time for sea or air freight.<\/p>\n<p>This is a very common way of quoting price but I still think this leaves way too much for you to organise (international freight, clearing US customs, unloading in US Port,  organising freight within the USA to your warehouse etc.)<\/p>\n<p><strong>DAP &#8211; &#8220;Delivered At Place&#8221; <\/strong>&#8211; sometimes (incorrectly) called &#8220;DDU&#8221; &#8211; Delivered Duty Unpaid (I am guilty of using this term too, possibly influenced by one of my suppliers!).<\/p>\n<p>This means the supplier undertakes to do everything necessary to deliver your products from their factory door directly to your warehouse, EXCEPT for clearing U.S. customs and paying U.S. import duty.<\/p>\n<p>This is the method I have used so far with both of my current suppliers and all my imports (6 to date). I like it because it takes care of most of the issues, but it still can leave you holding the baby with the U.S. customs.<\/p>\n<p>If you use this method, you will almost certainly get a better freight rate than if you asked for it yourself. That&#8217;s because your supplier ships probably 100X more volume per month than you are importing. However, you can check this by opening an account yourself with DHL or whoever they use for freight, and getting a quote for air freight to your warehouse address.<\/p>\n<p><strong>DHL\/Fedex or UPS only, folks!<\/strong><\/p>\n<p>It&#8217;s really important if you use this method to only work with a supplier who will work with one of the standard courier companies: DHL, Fedex or UPS. That&#8217;s because of customs clearance in the USA. If you set up your own (company&#8217;s) account with DHL, they can pay for duty and customs charges upfront and will invoice you or charge you directly for it. This means you don&#8217;t need a customs broker to clear U.S. customs.<\/p>\n<p>If you allow your supplier to use any courier company that uses a normal airline, you will  need to use a customs broker, meaning more costs and more complications for you. SPELL OUT to them that they are not to do this! Guess how I learnt about this!<\/p>\n<p><strong>DDP- &#8220;Delivered Duty Paid&#8221; &#8211; <\/strong>This is the De luxe and simplest of all Freight terms &#8211; your supplier will pay for and be responsible for everything from their factory gates up to your warehouse gates. I haven&#8217;t yet found a supplier who is willing to supply on this basis, but if you can find one, I totally recommend this unless the price is outrageous. It means that you effectively don&#8217;t have to think about the Freight part of your supply chain and avoid any potential complications with the U.S. Customs.<\/p>\n<p><strong>Checking Customs quotes<\/strong><\/p>\n<p>To check the price is reasonable,  get a  quote, then go and check all the customs costs. Even if it ends up being somewhat more, I&#8217;d still be inclined to take it, just to simplify my first purchase.<\/p>\n<p><strong>Subscribe to the Podcast<\/strong> to get the complete 10-part Amazon Startup System delivered to your favourite device!<\/p>\n<p><strong>INSPECTION IN CHINA<\/strong><\/p>\n<p>Again we get into this more in <a href=\"http:\/\/amazingfba.com\/8\">Episode #8<\/a>, but it is important to try your best to get independent (3rd party) inspection and testing of your goods in China before they get shipped if you possibly can.<\/p>\n<p>Since one of the keys to quality inspection is the integrity of the inspection person or company, it&#8217;s by far the best to get a recommendation via trusted friends or colleagues. This is when being a member of a community of fellow Amazon Sellers is most useful. Also look among your friends with corporate jobs &#8211; you may well find someone who deals with international buying, in which case, they&#8217;re very likely to deal with China frequently, since China exports pretty much every type of product in huge quantities. If you&#8217;re using a freight forwarder or Customs Broker (about which more in Episode #8), ask them if they have such contacts &#8211; that&#8217;s how I first found my first inspector in China.<\/p>\n<p>However, if you don&#8217;t yet have such contacts , Alibaba.com has now started offering a service to find you a quality inspection company &#8211; click <a href=\"http:\/\/inspection.alibaba.com\/?tracelog=new_ma_inspection\">here<\/a> to use this service.<\/p>\n<p>I have yet to use these but am considering doing so for a new shipment. I&#8217;ll keep you posted as to how it works.<\/p>\n<p>I&#8217;ve paid about $80 a day to an individual.<\/p>\n<p>Bearing in mind that a day was enough to inspect and test 80\/500 units and thus pass Quality Control for 500 units, that&#8217;s a cost of  16 cents or 10 pence per unit for QC &#8211; totally and utterly worth it for a crucial part of the supply chain.<\/p>\n<p>The only company I&#8217;ve foundvia Alibaba.com  potentially suitable for my next shipment (that covers my type of product and in the right location) , charges $198 USD a day for full inspection.<\/p>\n<p>You&#8217;ll need to have your chosen supplier&#8217;s  factory location to find inspectors of course &#8211; at least, the City and Province.<\/p>\n<p>If you don&#8217;t have products tested in China, then at the very least get them tested in the USA when they land. You will pay a lot more for it and it gives you less control over your supplier. But at least it minimises the number of defective units going to Amazon.<\/p>\n<p>That is the absolute must in this business to prevent a. Your account with Amazon being put into bad standing (remember, they want under 1% defect rate), b. lots of 1-2 star reviews and reputation damage.<\/p>\n<div class=\"_form_69\"><\/div>\n<p><script src=\"https:\/\/promusickit.activehosted.com\/f\/embed.php?id=69\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\n<p><strong>HOW TO SUBSCRIBE TO THIS PODCAST<\/strong><\/p>\n<p><strong>A podcast is a free downloadable audio show that enables you to learn while you’re on the go.  To subscribe to my podcast for free, you’ll need an app to listen to the show from.<\/strong><\/p>\n<p><strong>For iPhone\/iPad\/iPod listeners<\/strong> – Grab your phone or device and go to the<a href=\"https:\/\/itunes.apple.com\/us\/podcast\/improve-photography-podcast\/id575358022\" target=\"_blank\" rel=\"noopener noreferrer\"> <\/a>iTunes store and search “Amazing FBA”.<\/p>\n<p>This will help you to download the free Podcasts App (produced by Apple) and then subscribe to the show from within that app.  Every time I produce a new episode, you’ll get it downloaded right on your iDevice.<\/p>\n<p><strong>For Android listeners<\/strong> – Download the Stitcher Radio app (free) and search for “Amazing FBA Podcast.”  Or, if you have already downloaded a podcasting client, follow the directions in the next sentence.<\/p>\n<p><strong>For podcast enthusiasts<\/strong> – If you already listen to podcasts and have a podcatcher that you prefer, the feed you’ll need to add is: <a href=\"http:\/\/amazingfba.com\/feed\/podcast\">http:\/\/ amazingfba.com\/feed\/podcast<\/a>.<\/p>\n<p><strong>For those who don’t have a mobile device<\/strong> – You can always listen to the show by clicking the audio file at the top of this page.<\/p>\n<p>If you have any queries, just go to <a href=\"http:\/\/amazingfba.com\/ask\">www.amazingfba.com\/ask<\/a>.<\/p>\n<h3><strong>Watch How to Source Private Label Products from China without getting Ripped Off!<\/strong><\/h3>\n<p>[video_page_section type=&#8221;youtube&#8221; position=&#8221;bottom&#8221; image=&#8221;&#8221; btn=&#8221;light&#8221; heading=&#8221;&#8221; subheading=&#8221;&#8221; cta=&#8221;&#8221; video_width=&#8221;1080&#8243; hide_related=&#8221;false&#8221; hide_logo=&#8221;false&#8221; hide_controls=&#8221;false&#8221; hide_title=&#8221;false&#8221; hide_fullscreen=&#8221;false&#8221;]https:\/\/www.youtube.com\/watch?v=mAPaLf3rio8&#038;feature=youtu.be[\/video_page_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fcontent.blubrry.com%2Famazingfba%2FAmazing_FBA_Podcast_6_Sourcing_Part_1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2F6-amazon-sourcing-from-china-14%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Amazing_FBA_Podcast_6_Sourcing_Part_1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=81-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/content.blubrry.com\/amazingfba\/Amazing_FBA_Podcast_6_Sourcing_Part_1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"Amazing_FBA_Podcast_6_Sourcing_Part_1.mp3\">Download<\/a> (Duration: 21:43 &#8212; 17.4MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 21:43 &#8212; 17.4MB)Subscribe: Spotify | Email | RSSThis Episode, #6, is the 1st of 3 parts dealing specifically with sourcing, i.e., finding suppliers, negotiating, getting samples, and getting product manufactured and sent to Amazon USA. It is also part 4 of 10 of the &#8220;Amazing FBA Startup [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":10011,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":true,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[4,1837],"tags":[1853],"class_list":["post-81","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-amazon-fba","category-starting-an-ecommerce-business","tag-amazing-fba-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>#6 Amazon Sourcing from China 1\/4 - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"#6 Amazon Sourcing from China 1\/4 - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 21:43 &#8212; 17.4MB)Subscribe: Spotify | Email | RSSThis Episode, #6, is the 1st of 3 parts dealing specifically with sourcing, i.e., finding suppliers, negotiating, getting samples, and getting product manufactured and sent to Amazon USA. It is also part 4 of 10 of the &#8220;Amazing FBA Startup [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2015-08-28T14:26:14+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-17T05:29:02+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/Logo-YT-TN.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"#6 Amazon Sourcing from China 1\/4\",\"datePublished\":\"2015-08-28T14:26:14+00:00\",\"dateModified\":\"2020-06-17T05:29:02+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/\"},\"wordCount\":2326,\"commentCount\":4,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/Logo-YT-TN.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"Amazing FBA Podcast\"],\"articleSection\":[\"Amazon FBA Private Label\",\"Starting An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/\",\"url\":\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/\",\"name\":\"#6 Amazon Sourcing from China 1\/4 - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/Logo-YT-TN.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2015-08-28T14:26:14+00:00\",\"dateModified\":\"2020-06-17T05:29:02+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/Logo-YT-TN.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/Logo-YT-TN.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"#6 Amazon Sourcing from China 1\/4\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"#6 Amazon Sourcing from China 1\/4 - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/","og_locale":"en_GB","og_type":"article","og_title":"#6 Amazon Sourcing from China 1\/4 - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 21:43 &#8212; 17.4MB)Subscribe: Spotify | Email | RSSThis Episode, #6, is the 1st of 3 parts dealing specifically with sourcing, i.e., finding suppliers, negotiating, getting samples, and getting product manufactured and sent to Amazon USA. It is also part 4 of 10 of the &#8220;Amazing FBA Startup [&hellip;]","og_url":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2015-08-28T14:26:14+00:00","article_modified_time":"2020-06-17T05:29:02+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/Logo-YT-TN.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"#6 Amazon Sourcing from China 1\/4","datePublished":"2015-08-28T14:26:14+00:00","dateModified":"2020-06-17T05:29:02+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/"},"wordCount":2326,"commentCount":4,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/Logo-YT-TN.png?fit=1280%2C720&ssl=1","keywords":["Amazing FBA Podcast"],"articleSection":["Amazon FBA Private Label","Starting An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/","url":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/","name":"#6 Amazon Sourcing from China 1\/4 - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/Logo-YT-TN.png?fit=1280%2C720&ssl=1","datePublished":"2015-08-28T14:26:14+00:00","dateModified":"2020-06-17T05:29:02+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/Logo-YT-TN.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/Logo-YT-TN.png?fit=1280%2C720&ssl=1","width":1280,"height":720},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/6-amazon-sourcing-from-china-14\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"#6 Amazon Sourcing from China 1\/4"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/Logo-YT-TN.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-1j","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/81","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=81"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/81\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/10011"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=81"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=81"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=81"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}