{"id":9642,"date":"2019-09-12T06:00:56","date_gmt":"2019-09-12T05:00:56","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6697"},"modified":"2020-06-29T13:37:34","modified_gmt":"2020-06-29T12:37:34","slug":"how-handmade-products-can-make-amazon-sellers-cash","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/","title":{"rendered":"How handmade products can make Amazon sellers cash"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fhow-handmade-products-can-make-amazon-sellers-cash%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9642-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\">Download<\/a> (Duration: 30:04 &#8212; 24.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fhow-handmade-products-can-make-amazon-sellers-cash%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9642-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\">Download<\/a> (Duration: 30:04 &#8212; 24.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Handmade products from developing countries are a massive trend. They give Amazon sellers several huge business advantages while doing good. Find out what!<\/p>\n<p><!--more--><\/p>\n<h1>Handmade Products &#8211; a Golden Opportunity for Amazon Sellers<\/h1>\n<h3><b>What is Rural Handmade about?<br \/>\n<\/b><\/h3>\n<p>It’s about connecting rural hand-makers (makers of handmade products from South-East Asia, Africa and Latin America) with global markets.<br \/>\nAlso to help Amazon sellers and ecommerce entrepreneurs to convert their ideas into an actual product.<\/p>\n<h3><b>Sustainability is a growing market<\/b><\/h3>\n<p>There is a growing awareness of the need for sustainable products among consumers.<br \/>\nThe issue is that sustainability as it stands is quite expensive. It’s almost a luxury.<br \/>\nOn the other hand,<span class=\"Apple-converted-space\">  <\/span>if you look at the supply potential across the developing world &#8211; including handmade products from India- they’ve been working sustainably for 4000 years, It’s a huge industry. So we can make sustainability affordable for consumers if done correctly.<br \/>\nThe hand-makers lack two things:<\/p>\n<ol class=\"ol1\">\n<li class=\"li2\">Design excellence &#8211; not making the right types of products. Africa and South America makers of handmade products,  for example,  make a lot of products without really understanding the needs and wants of the consumers.<span class=\"Apple-converted-space\">  <\/span>The need to get in sync with global consumer market.<\/li>\n<li class=\"li2\">They lack the reach to consumer markets. Makers of handmade products from India especially,  for example, struggle to reach international markets due to the size and distribution of the maker population.<\/li>\n<\/ol>\n<h3><b>What’s the business case\/ upside for resellers\/retailers of importing handmade products?<\/b><\/h3>\n<p>Retailers have been using very complex\/unwieldy tools and ways to do sourcing, eg Alibaba.<br \/>\nIf you already see the product on Alibaba, you’re trying to make slight variations to existing products. This isn’t going to benefit you as much as having<br \/>\nRural Handmade focusses on a suite of tools to help connect sellers better to makers.<br \/>\nKonark’s company also marries data and design.<br \/>\nThey look at the exact needs of the entrepreneur, then develop a design and get a low cost prototype made.<br \/>\nEssentially a B2B company &#8211; want More businesses to work with them.<\/p>\n<h3><b>How does importing handmade products  work in practice?<\/b><\/h3>\n<p>Example: leather product to put passports laptop in for avid traveller.<br \/>\nCome to them, NDA agreement, it’s your private property. You keep IP.<br \/>\nDesign team creates a very simple design &#8211; dimensions, angles, material.<br \/>\nThen makers make the prototype &#8211; this a benchmark product.<br \/>\nThat gets shipped to entrepreneur, they then make modifications.<br \/>\nThen finalise.<br \/>\nThen make batches in say 100s, 500s, 1000<br \/>\nIt’s a fast and frugal process.<\/p>\n<h3><b>What sort of upsides would be retailers get from working with a rural handmade maker?<\/b><\/h3>\n<p>If you have a few things customers are looking for now, they have fastest turnaround time.<br \/>\nThey have an internal design team &#8211; convert ideas into 3D designs.<br \/>\nThese go to the artisanal communities &#8211; work into real product.<br \/>\n15-45 days &#8211; this is fast for handmade!<br \/>\nThis is a big USP.<\/p>\n<h3><b>Mass produced products vs. Handmade <\/b><\/h3>\n<p>The scope for making mistakes and correcting them is expensive.<br \/>\nA new die could cost you $5-15K<br \/>\nHandmade can give you great freedom to innovate without big downsides.<\/p>\n<h3><b>How do you reduce variability with handmade goods\/get consistency?<\/b><\/h3>\n<p>They use industry standard SOPs including tolerances etc.<br \/>\nThe key is to communicate it to the makers.<br \/>\nThere will be slight variations but that makes it unique and that is a USP, not a problem.<br \/>\nThese are often products that will be given to consumers as a gift.<br \/>\nIt’s not going to be in an industrial context -so the tolerances of for example dimensions are not usually critical.<\/p>\n<h2><b>Quality Control processes<\/b><\/h2>\n<p>There is a “lead artisan” in each team who is there to keep an eye on QC.<br \/>\nAt the end of a production cycle, they put in a third-party quality control party.<br \/>\nSo it’s people who help manage the quality.<\/p>\n<h3><b>How do you choose which artisans to work with?<\/b><\/h3>\n<p>The Handmade industry is 2nd biggest employer in world (after agriculture).<br \/>\nA lot of governments know this. A lot have on a soft randomised control trial.<\/p>\n<h3><b>Local government<\/b><\/h3>\n<p>Rural handmade partner with local government.<br \/>\nLocal governments<span class=\"Apple-converted-space\">  <\/span>have identified communities that have the potential to go outside their regions.<br \/>\nRH Work with someone on a very small order.<br \/>\nThey ask: How well do these makers adhere to principles and guidelines?<br \/>\nIf they match up, they become part of the ecosystem.<\/p>\n<h3><b>Mobile<\/b><\/h3>\n<p>Also reach out to communities themselves outside government systems.<br \/>\nThey stay in touch via mobile phone\/Whatsapp.<\/p>\n<h2><b>Background<\/b><\/h2>\n<h3><b>Konark Ogra<\/b><\/h3>\n<p>Engineering background &#8211; engineering consulting &#8211; main role was technology solutions to a large organisation. Clients were SE Asia, Middle East, Research in USA.<br \/>\nWanted to have an impact, focus on agriculture and agri tech across developing world.<br \/>\nBut handmade is very under supported.<\/p>\n<h3><b>Rural Handmade<\/b><\/h3>\n<p>Konark was born and raised in India &#8211; handmade industry is 2nd largest employer in world.<br \/>\nHe asked himself: “Why are such amazing craftsmen\/women not getting their due?”<br \/>\nInvestigated for 2 months &#8211; concluded: issue was lack of innovation.<br \/>\nThat is how Rural Handmade started. They have helped 300 people in 18 months.<\/p>\n<h3><b>Which things needed innovation?<\/b><\/h3>\n<p>They were great craftspeople. But had no imagination about going outside local market<br \/>\nEg local village would only go to nearest town.<br \/>\nEg remote village in Mozambique &#8211; go into London or NYC. And then become a stakeholder.<br \/>\nCommunication used to be expensive.<br \/>\nNow with ICT penetration, it’s free.<br \/>\nSo how can we seamlessly transfer things?<br \/>\nFinally: overproduction of products for years that nobody needs &#8211; eg esp things from Africa or Latin America<\/p>\n<h3><b>The world is going sustainable<\/b><\/h3>\n<p>Handmade and sustainable go hand in hand. So it works for that way.<br \/>\nIt’s like the “Agritech revolution” which will change the demographics of small villages.<\/p>\n<h3><b>How is ICT enabling communication?<\/b><\/h3>\n<p>Recent UN report on ICT penetration &#8211; by 2023 literally everyone (8 billion people!) will be connected via mobile and internet.<br \/>\nThat’s surprising because a lot of governments have not given<br \/>\nICT penetration in Africa and developing world is in 3 digits (Over 100% growth?)<br \/>\nWhatsApp really helps that. Some places only have electricity 3 hours a day.<\/p>\n<h3><b>How do you deal with inconsistent comms?<\/b><\/h3>\n<p>It’s not just about tech.<br \/>\nYou need to build a tribe &#8211; find a person who leads and understands &#8211; then they lead the team.<br \/>\nElectricity generally speaking isn’t needed for most handmade practices.<br \/>\nWood may need some electricity for polishing for example, but not the majority of the work.<br \/>\nLeather working doesn’t need electricity.<br \/>\nIt is not that hard &#8211; TK max, John Lewis do this as well &#8211; Ikea does it.<br \/>\nThe selling point\/USP is changing lives and connecting human lives together!<\/p>\n<h3><b>How do Amazon or ecommerce sellers explore working with Rural Handmade?<\/b><\/h3>\n<p>Check out the website<br \/>\n<a href=\"http:\/\/ruralhandmade.com\">ruralhandmade.com<\/a><\/p>\n<hr \/>\n<h3>TRANSCRIPT:<\/h3>\n<p>Michael Veazey 0:56<br \/>\nLadies and gentlemen, welcome back to the 10 k collective pockets the place to be for six, seven and eight figure Amazon sellers delighted today to introduce a very different guests with a very big vision that&#8217;s Canuck Agha of rural handmade, all handmade is there to increase shared prosperity across the entire globe by bringing makers closer to the market. So that&#8217;s quite the vision that Welcome to the show.<\/p>\n<p>Konark Ograot 1:18<br \/>\nThank you very much, Michael, for having us.<\/p>\n<p>Michael Veazey 1:21<br \/>\nMy pleasure, sir, I spoke to you at a conference recently, I was really struck by your vision and your enthusiasm for your vision, it&#8217;s quite different. And I think it&#8217;s got a long term potential, which I always like we always like on the tank a collective. So first of all, handmade overall handmade goods, how on earth does that work for Amazon sellers? And what is this all about?<\/p>\n<p>Konark Ograot 1:40<br \/>\nYeah, so briefly, what this business is about, it&#8217;s about trying to connect the rural artists know communities, which actually live across the world, to the global consumer market. And we do this with the help of data and design. So that&#8217;s what the business is all about. How does it benefit Amazon sellers? Uh, well, you know, every so increasingly, we keep hearing about how do you build a brand? How do you build a defensible brand? How do you build a brand with impact, and all these three things are deeply knitted into the DNA of rural handmade, we essentially help entrepreneurs realize their dreams, and convert their ideas into a natural product. And this basically happens in a very fast and frugal manner, for the system that we have adopted in the business that we run.<\/p>\n<p>Michael Veazey 2:30<br \/>\nNice. Okay, that&#8217;s a great summary of what you do. So connecting roll hand makers with global markets, and the entrepreneurs are part of that chain, I guess, adding value with the ideas that initiative, that capital and that sort of thing. You were mentioning to me when we were talking about this before that sustainability is a big piece. And obviously that&#8217;s a real buzzword. So tell me a bit more about that. How does that tie in with this?<\/p>\n<p>Konark Ograot 2:51<br \/>\nAbsolutely. So So let&#8217;s look at the big problem that all of us as consumers face, you know, living the world we live in right now, which is sustainability. You know, people do talk about how do we get rid of plastic? How do we actually birches a more informed decision that predict to buy new things? And how can we, you know, kind of optimize our consumption. And so this one problem that everybody faces that I do want to be sustainable, I do not want to buy mass produce products. And I also want to make sure that I actually have an impact with my buying decisions. But the only problem is that sustainability is expensive, it actually is a luxury to have a sustainable lifestyle. On the other hand, what we have is we have these millions and millions of makers across the developing countries, who are very skilled craftsperson, and they&#8217;ve been preaching sustainability for many hundreds and thousands of years. So the only problem they have now is that they lack two specific things, which is number one, they lack Design Excellence, which means they&#8217;re making wrong designs, are they making the old producing designs that not many need, and number two, is that they lack the reached the global consumer market, because if you live in a remote area, for you to actually make a business case, by shipping your product to, to the US or the Western European region, does not make a business case. So what we&#8217;re seeing essentially is there is an inversion of huge demand of sustainable products, and a potential supply opportunity. But they had all these millions and millions of makers across the world. And so all we&#8217;re trying to do is just connect these two dots.<\/p>\n<p>Michael Veazey 4:31<br \/>\nAmazing minds. Fantastic. So you&#8217;re a middle ground, I guess, like a lot of marketplaces have some kind of either that you&#8217;re connecting two sides of an equation. What I like about your vision is the sustainability piece, which is not only feels better to be involved with but i think is, is the big, big trend, I was gonna say for the new millennium. That&#8217;s a very outdated phrase now, but for the next, say 10 2050 years or more, was Amazon&#8217;s managed to connect to the Chinese factories who are famous degraded, working out things in plastic by the 10s of thousands. So they&#8217;ve connected Western consumers, essentially to China. So you&#8217;re offering to do the same with a rather more cuddly and sustainable people. So that&#8217;s lovely. What&#8217;s the sort of more business upside for resellers? retailers? What&#8217;s the business case for doing this?<\/p>\n<p>Konark Ograot 5:14<br \/>\nWell, the business case is actually pretty straightforward. So number one is that we aren&#8217;t, we don&#8217;t typically work like how you would do it in Alibaba. So if you if you wanted, if you want to build a brand, or build a product, you go on Alibaba, and you search for the product. Now, essentially, if you already see the product on Alibaba basically means that this product already exists. So you&#8217;re not trying to actually build a new product, but you actually trying to make slight variations to existing ones, which in the long term, possibly is not going to benefit you as much. Now what we do is we talked to entrepreneurs on a one to one basis, understand what they need some exact design requirements that they have the kind of raw materials they want to use to make the product. And then we commissioned this design, into a product in a low cost make to order model is the entrepreneurs can actually literally start from scratch and draft their ideas and a piece of paper with view sketches, and Reagan then, but the head of the design team, we have internally, commissioned this design into, you know, whatever brought it that would eventually come out.<\/p>\n<p>Michael Veazey 6:20<br \/>\nAmazing. I really, really liked this for several reasons. First of all, as you said, Alibaba own news on Alibaba, it&#8217;s on Amazon, pretty much. So it&#8217;s getting very, very difficult, pure private label as such, I think he&#8217;s dying off, which is understandable. But then you&#8217;ve got to look at Okay, how do I affordably find a way to get unique designs, we&#8217;ve already had Ryan traffic come on to talk about creating custom designs in China, which is very important for certain types of products. But this is another alternative route, to getting something that is unique, which I think is the key thing. And I really like the fact that you have an in house design team, because the idea of industrial design for most of us is pretty daunting, I certainly have no feel for that. And hiring a design in the West, while you know, it can be very effective in terms of the quality can quickly become pretty expensive. So tell us a bit more about the I was going to keep this I&#8217;m going to do a bigger picture thing and come to this later on. But I can&#8217;t resist the question of how do I make money which I think any real entrepreneurs gotta have at their top of their mind? How does that actual process where it took us through that a little bit more in detail?<\/p>\n<p>Konark Ograot 7:22<br \/>\nAbsolutely. So it&#8217;s a very simple process, what we have is, if you&#8217;re an entrepreneur, and you&#8217;ve had a deep passion about, you know, making a product or building a brand around the product, what you would do essentially is identify the niche you want to specialize in. So let&#8217;s let&#8217;s pick up the case of letters, just give an example. And you have this design, which I think fits in very well with the with these avid travelers and it can do multiple things to this product, you can put your passport and your beer, your files and your laptops. And you know, this design is going to sell very well. Now, what do you do after this is you actually come to us and share your ideas, we sign an NDA, which is a non disclosure agreement in terms of we will not be sharing this outside between you and me. And its private property of you because you hold all the IPS and stuff. Now this design then goes to our design team, where they actually break it down in a very simplistic manner. The so the makers who eventually will be looking at the design can understand what this product is all about. So all the dimensions would be formalized all the angles, know what kind of materials we will be using, and and stuff like that. And now these makers then start making the first product, which is the prototype. Now this prototype, essentially is is the benchmark product that we would be making. So once we make the prototype, it gets shipped to the to the entrepreneur, he approves it, or he probably gives us further modifications, and then we keep recreating it, and we actually finalize on the product, once the product is finalized, we then start making multiple orders can be the same use of hundreds, and 507, hundred and thousand to 2000, depending on how the how the same speaker picks up for the entrepreneurs. And and so simply put, if I simply put this, it&#8217;s a very fast and frugal process you bring with us you will bring an idea to us. We have the design dividend transforms the idea into an actual image can be an AutoCAD major and Adobe imagined that the makers make it and then it gets shipped to you all to Amazon variable, you want it to be<\/p>\n<p>Michael Veazey 9:29<br \/>\nnice, okay, I&#8217;m going what I&#8217;m really liking about this. And, and I have to give it a try for myself. But it is that it feels a bit less daunting than the process of manufacturing. Because obviously, that&#8217;s very led by mechanical thinking mechanical processes, which if you&#8217;ve got an engineering or very analytical background works well. And a lot of the people I know who are doing best in the Amazon space, have got that kind of brain and that kind of background. But for a lot of people who are new to the space, I think the idea of very simple design and simple processes is probably something that&#8217;s easy to grasp and get your head around to get right. Because obviously, when you must produce a plastic widget, if you&#8217;ve got something slightly wrong, that you need the chemical lab to test, that&#8217;s quite a tricky thing to get. Right. So is that been your experiences the new people are trying this out? Or is it very established entrepreneurs who have been the people that that have tended to use this process so far?<\/p>\n<p>Konark Ograot 10:17<br \/>\nWell, I think the funny thing is, was just to add to the previous conversation, that the problem with mass produced products is that obviously the the scope of you making mistakes is minimum, because you got to you know, stop the the factory said, we gotta change the die, you know, to make a new die would possibly cost you 510 1520 grand. But if you actually look at the handmade industry, because the prime focuses is hands and basic tools. So you can make mistakes, and it will not cost you a lot. So that&#8217;s the key. That&#8217;s the key difference between how does handmade have the ability to actually experiment to a level that you could never imagine before. And still, the cost of a mistake is probably marginal, as compared to a cost that you would incur if you probably go to you know, China or these mass manufacturing companies. And so that&#8217;s one big advantage we have in terms of the innovation and the creativity we can put in place with the handmade industry.<\/p>\n<p>Michael Veazey 11:20<br \/>\nYeah, I really like that. So in other words, the cost of innovation is very, very low. Whereas normally with a manufactured type product, I said, normally, I guess what I&#8217;m used to, is that you put batch number one out into the market, maybe it&#8217;s a few hundred, if you&#8217;re just starting out, testing it, you get some feedback, you can go back and do batch number two, you can innovate, but then you got 1000 products out there that may have some dreadful hidden floor that you didn&#8217;t catch it, you&#8217;ll appreciate when inspection. So I really like the fact that you can, it&#8217;s just on a human scale, I guess which I guess for me, I mean, I suppose I have a sort of I never thought of it this way. But I have to sort of hand making background in the sense that I hand make music or piano or you know, used with conducting back in the day. And I suppose that for me, it feels kind of right thing, because the idea of mass producing feels a bit scary that it&#8217;s a bit like the Sorcerer&#8217;s Apprentice of you know that that tradition that you know, basically, you wave your magic wand and stuff happens very quickly, which is great, but then it&#8217;s all out of control as well. So I really like that and and then maybe other people resonate with that as well. So let me flip that on its head then. Because obviously, the point of having machines and manufacturing type processes that are very rigid, is that you get very consistent quality. And obviously, if it&#8217;s consistently bad, that&#8217;s very bad. But if it&#8217;s consistent, if it&#8217;s set up well, and it&#8217;s consistently good quality, then you can see why a machine is going to generally produce exactly the same which of these time, how do you account for the variability with handmade things? How do you reduce variability in that? And how do you sort of handle that situation?<\/p>\n<p>Konark Ograot 12:45<br \/>\nThat&#8217;s it? That&#8217;s a very good question actually get keep, I get asked this a lot of times, and how do we ensure this? And the simple answer is, is we have standard operating procedures. And and these are not just our procedures, but these are these are industry standards, you know, and they&#8217;re like guidelines on what the tolerance could be, what the standard deviation would be. And for us, the most important thing is to is to convey the message to the makers, that you have to maintain the quality that the entrepreneurs are demanding for. And because it is handmade, it doesn&#8217;t mean that we will have huge variations in in production, it just basically means that there will be slight variations, and which actually makes it even unique in in every possible sense. And also keeping in mind that handmade products are essentially products that you buy as an individual or you want to give to somebody these are not products that get into a manufacturing unit, where a tolerance of 5% can make or break things. So it&#8217;s a mix and match of both, you know, it&#8217;s made by hand, its uniqueness is the USP, the sustainability is a USP, at the same time, we have these industry practices that we follow deeply inside the company in which the variations of minimum, you know, as minimum as long what<\/p>\n<p>Michael Veazey 14:00<br \/>\nmakes total sense. Yeah, it&#8217;s not going to be an industrial context. It doesn&#8217;t make sense money. If you give somebody a leather Hand me back for putting their passport and laptop in when they&#8217;re doing globe trotting, then yeah, it doesn&#8217;t really matter if if the dimensions are out by a few millimeters or something here there, because it&#8217;s not going to blow up a machine. So that&#8217;s a very good point. And yeah, and the fact that it&#8217;s unique, and that&#8217;s a USP is I am a very good point. So yeah, interesting. Yeah. And I guess like anything else, it comes down to, not the discipline of machines, but the discipline of communication, right, and, and having some kind of checks and balances, so, so tell me about that. Obviously, in any system, you gotta have quality control processes, obviously, having a clear, SAP or clear sets of regulations, guidelines, acceptable quality limits, etc. is upfront is good. So how do you consistently check that those being followed and deal with it? If it isn&#8217;t? Right, so what we have<\/p>\n<p>Konark Ograot 14:51<br \/>\nin a process is we have few team members who are a part of the quality control. So starting off with somebody callers, a rural economy champion, who actually is, is a lead artist, and whose responsibilities are a little bit different than just, you know, making sure the products are made. But also, to look at the quality aspect of it. At the end of the cycle of production, we have a third party contractor, for example, you know, companies like Intertek and quality control companies that will actually go and have a look at the quality and see if all the QC, you know, points of check if all the deliverables are made, according to the SPS that were defined. And hence, we&#8217;re able to keep this fine balance of quality. And also, you know, make sure the quantities is there as well. So, so it&#8217;s basically, you know, people in the team that help us, you know, manage the total quality, and keep the variations as minimal as possible.<\/p>\n<p>Michael Veazey 15:47<br \/>\nYeah, that makes sense. So, so another way to get you have an internal quality control sort of lead person, and then you have external checks as well. So, in the end, I guess it comes down to a lot of things. It&#8217;s just the quality of the artists it paid for I was just thinking about August, amen. If I have, I can have all the prices in the world. But if I pick people with bad training or bad attitude, it&#8217;s going to be bad result. Whereas I guess the art is in picking good people and getting rid of people who prove unreliable over time. So I suppose in the end, that&#8217;s probably how it works. So tell me a little bit more about that side of things. So how do you pick which artisans to work with? And which ones to stop working with?<\/p>\n<p>Konark Ograot 16:22<br \/>\nWith a very good point you made so so just to give you a small brief about the handmade industry, which will eventually answer the question we have so so handmade industry is the second largest employer in the world, which basically means a lot of people in the developing nations, if they&#8217;re not doing agriculture in the rural areas actually do handmade stuff. Now, a lot of governments have this deep understanding that this is huge human capital that hasn&#8217;t been tapped properly. And so they&#8217;re trying to promote and teach them new skills, and they&#8217;re going to semi mechanized, they&#8217;re making processes. And they have all of them have actually done something called a soft randomized controlled trial, in a which they have done is they want us to that everybody in every cluster, and every community will have a different skill, as well as the handmade industry is concerned. And they&#8217;ve actually been able to identify the right set of partners and writer of communities, which have the potential to go outside the cluster outside the region outside the country&#8217;s. So what we do is we have a two way process, we partner with the local government, and we have the access of the database of all the makers they have across the remoteness of the places or in in smaller villages or towns, and then we work with them on a very small order. So we probably will make them get them a prototype to be made. And then we look at how to do how well do they adhere to the rural handmade principles and guidelines. And if they actually match to the expectations that we have, they become a part of the ecosystem we have. And so so this is like an ongoing process. Now the other thing we do is we obviously go out in our local community partners and employees reach out to these different different regions and identify these communities, which possibly are not in touch with the government&#8217;s and then with the help of a low cost technology device, which is a mobile phone, and cheap internet, we remain in touch with them. And we transfer this this knowledge of new designs and new ideas, and then quickly, you know, work on the prototype part of it. So it&#8217;s a two way strategy. So one is partnership with the government&#8217;s which have the database. And the second is, you know, using technology, you know, basic ICT, you know, internet and, and mobile phones and WhatsApp do to reach out and build the community at our end. Right? It makes a lot of sense. And the same<\/p>\n<p>Michael Veazey 18:39<br \/>\nthing that I&#8217;ve been reading recently in the economist is why don&#8217;t we get my news from my turn avoid newspapers, because they just go on about things to depress me about that. The Economist quite it&#8217;s quite a broad view, global view. And it&#8217;s it&#8217;s amazing how much developments been going on in in rural India, specifically, in the last few years, apparently, that it&#8217;s gone from a totally non connected to traditional bank accounts to suddenly ever using WhatsApp. So very interesting, fast moving development there. So look, what one question I haven&#8217;t asked you is to give a bit of background about yourself, obviously, you got a very structured approach to these things, which is highly reassuring, for those of us who&#8217;ve dealt with sort of random variability in our sourcing in the past. So tell us a bit more about your personal background Connect?<\/p>\n<p>Konark Ograot 19:19<br \/>\nYeah, absolutely. Funny enough, actually, I was not doing any of this before. So I actually am an engineer with qualification. And I used to work as a technology consultant for a very large organization. And our clients and in my jobs were located in the Middle East and North Africa. And then I went to the US, I was continuing a research project there. And and basically, what happened was I, it just struck me that, you know, why is there poverty? And why do you know, very skilled people have issues in 2019, you know, I mean, it&#8217;s a seamless now reaching out to the market. And I wanted to do something different, which can actually create a massive impact to the society we live in. And then I looked at the this industry, which doesn&#8217;t really get talked about, you know, right now is in the focus with most governments across the developing nations is agriculture. And so agri tech is pretty big. But But handmade, you know, Believe, believe it or not, it&#8217;s a very interesting industry, it&#8217;s a very creative industry. The only problem with these people is what we want to fight is the lack of innovation. And we could just see a clear business case, you know, people love handmade people love sustainability, these guys deliver exactly, or they have the potential to deliver exactly what they need. And so we saw this is a brilliant business case. And and this is not just a profit, business business profit for the book was kind of a business, and I want to develop and outcomes is clearly about engagement, you know, how many people can we get into the community? How many people can we give employment to how many people can we, you know, make make a part of this inclusive global market. And, and all this basically drove me to do this full time now. And you know, my my biggest drivers, that in this for 18 months, we&#8217;ve been able to impact 300 lives, or 300 people, and then they had their families of probably four or five each. So that&#8217;s a big number. And we haven&#8217;t even just started, you know, our appetite is massive. And and, and all this put together was clearly the reason why we thought we could actually, you know, disrupt the VD handmade industry exist, and the future of handmade industry, as well.<\/p>\n<p>Michael Veazey 21:27<br \/>\nWow. So that&#8217;s quite the vision. As I said, I warn people when you&#8217;re starting off that you have this very, very big vision. But I mean, what you&#8217;re seeing is that, as you said, there&#8217;s a solid business case, which I think what is nice about that is that there&#8217;s just huge potential for several years, two decades, which is that there&#8217;s an untapped source of supply. And then there&#8217;s massive demand. And as you were saying that sustainability is the huge thing. And that goes hand together hand in hand. No pun intended with handmade stuff. So amazing stuff. Let&#8217;s talk about ICT, what you just mentioned the ICT presentation, education in the areas where all handmade stuff is made, is helping Tell us a bit more about that side of things, because I noticed developing fast.<\/p>\n<p>Konark Ograot 22:07<br \/>\nYeah, so I&#8217;ll just give you a brief, you know, idea. So United Nations gave me the report last year, which they I think said that by 2023, or all 8 billion people on earth will be connected to the internet. Now that&#8217;s a surprising because I think a lot of governments have not been able to provide electricity to everybody, but internet is going to be there everywhere. And so is the the low cost mobile device. Now ICT penetration in Africa and and in Southeast Asia, is in triple and four digits, which basically means there&#8217;s this massive, massive number of people joining internet and becoming a part of the global internet world, which basically makes a very strong case for our business because our business, the core of the businesses, how do we get to communities? And how do we transfer knowledge. And, you know, just like WhatsApp really helps us do that, you know, we&#8217;ve been taught we&#8217;ve actually, you know, connected to the places where they don&#8217;t have electricity for more than three hours a day. But they receive our, you know, messages and we see our design ideas, they help us make the prototype and stuff like that. And and we think that there&#8217;s a much bigger kind of an opportunity in terms of, you know, how do we actually develop and promote this untapped human capital, which essentially does not exist right now? in the market? Okay,<\/p>\n<p>Michael Veazey 23:30<br \/>\nso one obvious question that I get, for example, the just, I suppose I&#8217;m looking for the problems in supply chains, having had experience like anyone else hold on line for one, five minutes that when you say places only have three hours a day, and they can manage to connect to the that&#8217;s kind of great to flip it on its head, that sounds like a bit of a risk to my supply chain. So I know that even if, for example, put a meeting at midday today with somebody over in the Philippines and and this time of year and a half monsoons half the time the internet is down and they can&#8217;t get online. So how do you deal with that sort of potentially inconsistent ability to contact based on the infrastructure, for example, electricity generation, if that goes out for several days or something like that?<\/p>\n<p>Konark Ograot 24:11<br \/>\nWell, I think it&#8217;s good. To me, I think what we&#8217;ve basically done is we were able to build a tribe and tribe is not necessarily just relying on technology, but it&#8217;s also a lot of people. So what we do is we we try to find this one rural handmade, cluster champion or domain champion, or like in subject matter expert who&#8217;s educated, understands what we&#8217;re trying to do. And then he helps us convey the message and helps us with the entire process of, you know, making the takes. Now, electricity, generally speaking, isn&#8217;t really needed for all the handmade practices. For example, if you probably do vote to clean the vote and ship it up, you need grinders, that needs electricity. But for example, leather, leather doesn&#8217;t necessarily need a lot of electricity, it&#8217;s just basic tools, hands and leather, and you can make whatever you want to make. So what we&#8217;ve seen is that it obviously does not, you know, hamper as much. But having said that, I was just giving you an extreme gauge of how well, Internet has been able to penetrate across the world, we don&#8217;t necessarily work with communities that have that don&#8217;t have the ability to perform at the stage we are in right now. But as we going to move forward, we will try to be more inclusive and get, you know, some of the mediocre, you know, level artists is to understand the bigger picture. And then then helping them grow from where they stand, which is basically, in the DNA of rural handmade, we want to make this not just in a few hundred member company, but we want to do make this a community of makers who are skilled and have the right attitude to, to understand and make things that are more relevant for for everybody, basically.<\/p>\n<p>Michael Veazey 25:55<br \/>\nSo in the end, you&#8217;re not just relying on the technology to communicate, but you got to find local leaders, we&#8217;re going to keep the leadership and the vision going. Whether or not the Alex just happens to be working. And as you said, a lot of the time that it&#8217;s not so critical for handmade goods. So yeah, I guess it comes down to trying to marry up the issues and produce they have with the their abilities as well. So that&#8217;s quite an interesting process to try and manage. So if you suddenly have electricity going out in a village, but I guess maybe it&#8217;s something I&#8217;m bit too paranoid about here. But in practice, I guess they&#8217;ve been working around this for a long time. Right, they know how to handle this. Have you found that it&#8217;s actually had any particular impact? Or is this just something that I&#8217;m worrying about needlessly, here?<\/p>\n<p>Konark Ograot 26:39<br \/>\nNo, I mean, I think the fact that because I think we probably understand the system and the way this works better than if you&#8217;ve probably never been to India, if you don&#8217;t understand how it works in, in in China or Indonesia. But I think the bigger factor is that it&#8217;s a general problem, there are issues, I&#8217;m not saying there are no issues, but at the end of the day, we&#8217;re trying to, you know, have a very strong story, and you as a seller can can leverage on the way, you know, your your purchasing decisions have transformed lives. And I think that probably is one of the biggest USPS you would have as a seller. And you know, we in the future want to, you know, build a relationship between you and the makers. And then and then kind of, you know, move on to different entrepreneurs. So, so, it&#8217;s all about, you know, how do we connect human lives to each other, and make this world a much better place? It does sound quite visionary and difficult, but trust me, it is not. Because we have seen personally, you know, big companies like TK Maxx and Walmart and john lewis, a lot of them, you know, genuinely work with, you know, smaller communities, IKEA does it all the time as well. And if they can, if they can do it at such a high scale, I&#8217;m very sure we can do it at the level of you know, Amazon sellers as well. Absolutely. Let&#8217;s I feel a<\/p>\n<p>Michael Veazey 27:55<br \/>\nbit of a sort of a chill for being sort of questioning of something with visionary. But I&#8217;d like what you&#8217;re saying, I&#8217;m actually it is scalable, it is something that people are doing, I guess, I&#8217;m trying to sort of put the awkward questions that somebody listening will that has been around the block, you know, has been a cool experience with supply chain issues. But as you say, I mean, the The main thing is that from the marketing perspective, I mean, without nevermind actually being a nice person and helping people, which is also a good thing to be, but from a marketing perspective, it&#8217;s got a very clear us point, USP and selling point. And that&#8217;s the main thing, it&#8217;s going to outweigh any little sort of wobbles. Besides which The truth is that if you&#8217;ve got a relationship with the Chinese factory, you for one, five minutes, you&#8217;ll know that there&#8217;s all sorts of issues that come up there as well. So it&#8217;s not like any supply chains going to be free of issues. So they just happened to be somewhat different in in say, rural India to what they would be in Shenzhen or something like that. Right. Absolutely. Cool. All right. Well, look, that&#8217;s amazing stuff. I think in the next episode, then we&#8217;re going to talk about how to make money now and get a bit more into more actionable steps for that&#8217;s a fantastic introduction to handmade stuff. So thank you.<\/p>\n<p>Konark Ograot 29:02<br \/>\nNo problem. pleasure is all mine.<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fhow-handmade-products-can-make-amazon-sellers-cash%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-5\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9642-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\">Download<\/a> (Duration: 30:04 &#8212; 24.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fhow-handmade-products-can-make-amazon-sellers-cash%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-6\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9642-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_035-konark-ograot-how-handmade-products-can-make-amazon-sellers-cash.mp3\">Download<\/a> (Duration: 30:04 &#8212; 24.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 30:04 &#8212; 24.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 30:04 &#8212; 24.6MB)Subscribe: Spotify | Email | TuneIn | RSSHandmade products from developing countries are a massive trend. They give Amazon sellers several huge business advantages while doing good. Find out [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":7083,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1550],"class_list":["post-9642","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How handmade products can make Amazon sellers cash - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How handmade products can make Amazon sellers cash - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 30:04 &#8212; 24.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 30:04 &#8212; 24.6MB)Subscribe: Spotify | Email | TuneIn | RSSHandmade products from developing countries are a massive trend. They give Amazon sellers several huge business advantages while doing good. Find out [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-09-12T05:00:56+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-29T12:37:34+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/10k035-konark-ogra-how-handmade-products-can-make-amazon-seller-cash.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"34 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"How handmade products can make Amazon sellers cash\",\"datePublished\":\"2019-09-12T05:00:56+00:00\",\"dateModified\":\"2020-06-29T12:37:34+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/\"},\"wordCount\":6986,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/10k035-konark-ogra-how-handmade-products-can-make-amazon-seller-cash.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/\",\"url\":\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/\",\"name\":\"How handmade products can make Amazon sellers cash - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/10k035-konark-ogra-how-handmade-products-can-make-amazon-seller-cash.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-09-12T05:00:56+00:00\",\"dateModified\":\"2020-06-29T12:37:34+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/10k035-konark-ogra-how-handmade-products-can-make-amazon-seller-cash.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/10k035-konark-ogra-how-handmade-products-can-make-amazon-seller-cash.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"Handmade Products\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How handmade products can make Amazon sellers cash\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How handmade products can make Amazon sellers cash - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/","og_locale":"en_GB","og_type":"article","og_title":"How handmade products can make Amazon sellers cash - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 30:04 &#8212; 24.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 30:04 &#8212; 24.6MB)Subscribe: Spotify | Email | TuneIn | RSSHandmade products from developing countries are a massive trend. They give Amazon sellers several huge business advantages while doing good. Find out [&hellip;]","og_url":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-09-12T05:00:56+00:00","article_modified_time":"2020-06-29T12:37:34+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/10k035-konark-ogra-how-handmade-products-can-make-amazon-seller-cash.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"34 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"How handmade products can make Amazon sellers cash","datePublished":"2019-09-12T05:00:56+00:00","dateModified":"2020-06-29T12:37:34+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/"},"wordCount":6986,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/10k035-konark-ogra-how-handmade-products-can-make-amazon-seller-cash.png?fit=1280%2C720&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/","url":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/","name":"How handmade products can make Amazon sellers cash - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/10k035-konark-ogra-how-handmade-products-can-make-amazon-seller-cash.png?fit=1280%2C720&ssl=1","datePublished":"2019-09-12T05:00:56+00:00","dateModified":"2020-06-29T12:37:34+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/10k035-konark-ogra-how-handmade-products-can-make-amazon-seller-cash.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/10k035-konark-ogra-how-handmade-products-can-make-amazon-seller-cash.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"Handmade Products"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/how-handmade-products-can-make-amazon-sellers-cash\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"How handmade products can make Amazon sellers cash"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/09\/10k035-konark-ogra-how-handmade-products-can-make-amazon-seller-cash.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2vw","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9642","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9642"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9642\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/7083"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9642"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9642"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9642"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}