{"id":9653,"date":"2019-08-06T06:00:57","date_gmt":"2019-08-06T05:00:57","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6849"},"modified":"2020-06-28T17:13:48","modified_gmt":"2020-06-28T16:13:48","slug":"sales-tax-for-shopify-with-paul-rafelson","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/","title":{"rendered":"Sales tax for Shopify with Paul Rafelson"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_024.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fsales-tax-for-shopify-with-paul-rafelson%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_024.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9653-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_024.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_024.mp3\">Download<\/a> (Duration: 37:50 &#8212; 30.9MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_024.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fsales-tax-for-shopify-with-paul-rafelson%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_024.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9653-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_024.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_024.mp3\">Download<\/a> (Duration: 37:50 &#8212; 30.9MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><!--more--><\/p>\n<h1>Sales tax and Shopify\/ non Amazon e-commerce with Paul Rafelson<\/h1>\n<h3>What about sales tax for Shopify or other e-commerce business owners?<\/h3>\n<h3>The Amazon marketplace vs. Shopify<\/h3>\n<p>Sales tax for Shopify business owners (or any similar system) is a different situation to that for sellers on marketplaces.<\/p>\n<p>Amazon tries to play both sides of the fence with &#8211; they want to avoid bad things like sales tax by saying “sold by Joe Seller”,  but they want to keep the customer relationship and branding.<\/p>\n<p>Otherwise, you could claim your shop in New York City, for example, is “just a marketplace” for Chinese goods. This wouldn’t fly with NYC tax authorities.<\/p>\n<h3>Apple’s App Store is NOT a “marketplace” from a legal perspective<\/h3>\n<p>A recent legal ruling found that Apple’s App Store is NOT a “marketplace” but effectively Apple was using it as a retailer.<\/p>\n<p>“Markup” or “commission” is the same thing according to the court. <i>If a company acts as a retailer, it will be treated as a retailer. <\/i><\/p>\n<h3>Selling direct to consumer<\/h3>\n<p>Sales tax for Shopify or similar stores DOES become an issue for you. Because you&#8217;re selling direct you to the consumer,  you don’t have The marketplace agreement with Amazon kicking in.<\/p>\n<p>The only defence against sales tax for Shopify business owners then is “it’s too burdensome”.<\/p>\n<p>Eg 200 items sold in South Dakota &#8211; $20 about $4000 sales per state x 40 states &#8211; maybe $180,000 sales totally.<\/p>\n<p>If you’re doing $100K in South Dakota, it might be fairer &#8211; but you’re probably doing some pretty big numbers anyway if you manage to achieve that.<\/p>\n<h3>Example: If you’re doing $50,000 sales total in Shopify<\/h3>\n<p>20% of states probably make up 80% of sales<\/p>\n<p>Probably: CA, FL, TX, NY, MA.<\/p>\n<p>So most of your sales tax liability from your Shopify store can probably be dealt with in a few states.<\/p>\n<p><i>If it costs you more to register than you have to pay, you may well be able to use the “burdensome” defence. <\/i><\/p>\n<p>Jeff Schick is a multi-million dollar seller AND a lawyer shared his Taxjar bill for filing in Washington state.<\/p>\n<p>Washington (State) has another tax “business and occupation tax” &#8211; is a small % tax that you pay not the consumer.  He owed the state $30 but his Taxjar bill was $500.<\/p>\n<h3>If you take a position under the constitution that it’s burdensome, you’re not breaking the law.<\/h3>\n<h3>200 unit test<\/h3>\n<p>States are starting to get rid of this test.  Many tax law specialists find it absurd.<\/p>\n<p>It’s problematic when states are unclear whether Amazon sales count towards overall sales thresholds.<\/p>\n<p>Eg $200K Amazon sales in a state plus $500 of your own bills.<\/p>\n<p>You can fight a state or pay a bill IF you get a bill. Plus penalty and interest. Say $100.<\/p>\n<p><i>Paul’s very general position on this is that you may be better off waiting to actually get a bill before you worry about paying it or registering. <\/i><\/p>\n<h3>Is this tax evasion to not pay sales tax for shopify slales?<\/h3>\n<p>In 2016, a state passed a law saying they should pay sales taxes. Wayfair took a position they weren’t going to pay it.  They lost &#8211; but, importantly,<i>  it wasn’t tax evasion, because they had a legal defence. <\/i><\/p>\n<p>Anything which happens at the Supreme Court is normally a constitutional issue and thus a legally defensible position.<\/p>\n<p>States passing laws that affect interstate commerce are basically unconstitutional. The laws have to be reasonable.<\/p>\n<p>Normally the companies who take these positions are huge companies.  When a Shopify seller can click one button and comply with all laws, there’s no reasonable defence. But that’s not the case at the moment. [In other words, for a small business to have to comply with expensive and difficult tax process is “burdensome”].<\/p>\n<h2>SIDENOTE: “Small business” defined<\/h2>\n<h3>(relevance: “Too Burdensome” defence against sales tax)<\/h3>\n<h3>US Definitions of a “Small Business”<\/h3>\n<p>The US doesn’t have a clear federal definition of “small businesses”. The Small Business Administration (SBA) <i>does <\/i>define them, but by industry. In the retail trade, the average definition of a small business is one with $7.5 million in average annual receipts.<\/p>\n<p><a href=\"https:\/\/www.fundera.com\/blog\/sba-definition-of-small-business\">https:\/\/www.fundera.com\/blog\/sba-definition-of-small-business<\/a><\/p>\n<p>In practical terms, this means that most “7-figure”  Amazon sellers definitely count as “small businesses” for most classification purposes.   This implies they might consider the &#8220;too burdensome&#8221; defence against sales tax if the adminstrative burden is too great.<\/p>\n<h3>Off-Amazon sellers (outside the USA)<\/h3>\n<p>Basically, it’s the same advice. Nobody wants to deal with having the government sending you letters, putting liens on Amazon inventory or taking money from their US bank accounts.<\/p>\n<p>If you have an LLC, it’s the same set of issues as for US-based sellers.<\/p>\n<h3>The biggest issue for Outside US owners:<\/h3>\n<ol>\n<li>They can end up paying federal tax &#8211; there’s a way to report it so you don’t get fined.<\/li>\n<li>Sometimes the fine can be worse! $25,000 penalties can come up because accountants don’t know how to do it.<\/li>\n<\/ol>\n<p>“A safe bet these days [that you <i>do <\/i>have sales tax nexus] is $100,000 in a state between Amazon and your own site combined. ”<\/p>\n<p>The grey area is, say,  $100K in Amazon and $10K on Shopify in a particular state.<\/p>\n<p>The key difference between Shopify business owners who personally live outside the USA  is that the government will find it harder to come after you for your personal assets.  If you store inventory in the USA, esp. in the state in question, it becomes easier for them to take action. l<\/p>\n<p>Litigating a tax case would involve $100Ks and a team of lawyers. Paul is upfront with his clients. The goal is not going to court. It’s trying to avoid going near it!<\/p>\n<h3>It’s getting better<\/h3>\n<p>States are dropping 200 unit sales test<\/p>\n<p>Amazon is becoming liable\/responsible<\/p>\n<h2>Listener Questions<\/h2>\n<h3>1)” Even if Amazon is collecting and remitting tax on your behalf, that doesn&#8217;t absolve you of your sales tax reporting responsibility. “ Is that right?<\/h3>\n<p>No. That WAS the case in Washington with  the “B &amp; O” (Business and occupancy) tax. But not in other states. Even if it is true:<\/p>\n<ol>\n<li>States CAN’T make you do it<\/li>\n<li>States already have the money from Amazon. Or are about to get it! What are they going to do? If they took a $2m seller to court, the court would come down hard on the state! It might put the Wayfair decision at risk!<\/li>\n<\/ol>\n<h3>2) When you say “I advise UK sellers not to register for sales tax”, do you mean any sellers outside the US?<\/h3>\n<p>Yes and no &#8211; there are tax treaties between the US Federal government and most countries.<\/p>\n<p>However states are not bound by those tax treaties &#8211; so they could come after you for state taxes in theory.<\/p>\n<p>However, when states say you’re personally liable for tax taxes, it’s hard for them to come after you in the UK.  So the risk is inherently lower whatever you decide to do.<\/p>\n<p>&nbsp;<\/p>\n<p>But if you have a US LLC under a state’s jurisdiction; a bank, like Bank of America,  which has branches in every state could be more vulnerable.<\/p>\n<h3>3)What if your business has an EIN number? (as I think a lot of Shopify businesses might because there was a period where you needed an EIN number to have a store in USD). Does that make you more of a target or is it unrelated to sales tax because it&#8217;s at the federal level?<\/h3>\n<p>Unrelated &#8211; and it doesn’t make you more of a target. EIN doesn’t automatically get reported to each state and getting an EIN doesn’t usually raise a flag with any states.<\/p>\n<h3>Parting thoughts?<\/h3>\n<p>Don’t let tax be the main thing.<\/p>\n<p>Don’t let tax dictate business eg pulling out of FBA.<\/p>\n<p>Amazon sellers have a lot to focus on: protecting IP, incorporating properly.<\/p>\n<p>Tax right now &#8211; take a common sense look at eg Iowa might come after me &#8211; what would I owe? $17 maybe?<\/p>\n<p>Be pragmatic and materiality based approach. The laws are still being figured out.<\/p>\n<p>Still do FBA, and still sell in the USA.<\/p>\n<p>Consider: What are the risks?<\/p>\n<p>If you’re doing 7-8 figures on Shopify, well done but if you’re under that, you probably aren’t running many serious risks.<\/p>\n<h3>How do people contact you?<\/h3>\n<p>Paul@ecomattorneys.com<\/p>\n<p>They have a couple of seller lawyers; patent lawyers (design patents are a great layer of protection).<\/p>\n<h3>Other interviews on the 10K Collective Podcast about sales tax with Paul Rafelson:<\/h3>\n<p><a href=\"https:\/\/10kcollective.com\/sales-tax-law\/\">Sales tax law<\/a> with Paul Rafelson<\/p>\n<p><a href=\"https:\/\/10kcollective.com\/tax-nexus\/\">Tax Nexus<\/a> with Paul Rafelson of eCommerce Attorneys<\/p>\n<p>_______________________________________________<\/p>\n<h2>Transcript<\/h2>\n<p>Michael Veazey 0:04<\/p>\n<p>Ladies and gentlemen welcome back to the show. I am talking to Paul Rafelson, of ecomattorneys.com, blowing up a load of really important myths, I guess the blowing up is important rather than the myths, but around sales tax in the USA, which has been an infamous topic of concern, quite rightly. Today, we&#8217;re going to talk about e-commerce and sales tax, because we&#8217;ve dealt with the fact that my simple non lawyer non binding non suitable understanding is that, broadly speaking, if you&#8217;re just saying on Amazon, the smart place to not register for sales tax, I think that was a very clear message we got from our previous episode. So Paul, let&#8217;s talk about people who sell off Amazon, but are based in the USA, presumably they&#8217;re the most sort of vulnerable people. What sort of thing? What should they do broadly about sales tax? What&#8217;s your generalized advice?<\/p>\n<p>Paul Rafelson 1:46<br \/>\nSure. So if you&#8217;re selling in the US, and you have a Shopify business, sales tax, obviously becomes an issue. Because when you&#8217;re dealing with Amazon, we, you know, one of the problems the state&#8217;s, you know, one of the reasons the argument fails is because selling on Amazon, under the state law, tax laws, you&#8217;re not a retailer, right? Amazon actually acts as a retailer. And it&#8217;s such an important point, because the way Amazon gets out of sales tax is they claim that they&#8217;re just merely a marketplace. But we know with the level of control that Amazon has, you don&#8217;t have really even have a customer that you can market to right? You have nothing, right? It&#8217;s Amazon&#8217;s branding, that&#8217;s really all over the listing, you know, in terms of the store, right? Like you might have your brand, that&#8217;s your product. But it&#8217;s the Samuel from the consumers perspective. I&#8217;m not buying from Joe seller, I&#8217;m buying it from Amazon, right? In fact, I don&#8217;t even know Joe sellers website, and I&#8217;m an Amazon goes out of their way to minimize Joe solid presence on that listing. And the only reason why Amazon probably even says sold and shipped by is for things like avoiding sales tax and liability for counterfeit or product liability. I mean, these are all things Amazon does to try to, like, play both sides of the fence, you know, just say, Oh, yeah, we&#8217;re not a retailer, when it comes to all the bad stuff. But we want to be the retailer from the customers perspective, because we don&#8217;t want the customer going directly to you. Because then they would circumvent us. So there&#8217;s there&#8217;s that sort of two sides of it. So when it comes to Amazon, you know, we have these constitutional law defences. And then you also have the defence of I&#8217;m not the retailer under state law. And logically it makes sense, you cannot retailer, because really, at the end of the day, if I could circumvent my obligation to collect sales tax by claiming I&#8217;m not a retailer, simply by saying sold and shipped by Joe seller. Well, I mean, that&#8217;s a powerful tax cheat. I mean, I could open up a shop in the middle of London, right? I mean, one is a bad example, although you can do this, they said the same thing about the VAP, it&#8217;s the same problem. But let&#8217;s say I can open up a shop in the middle of New York City. And just say my physical store in Time Square is actually a marketplace, the seller of these products is somewhere in China. And I&#8217;m just operating a physical marketplace for those sellers. I&#8217;m, I&#8217;m holding their inventory and displaying it in my store. But you&#8217;ll see very clearly it says right under the price tags are sold and shipped by you know, Joe seller in China. Okay, the New York tax authorities are not going to take too kindly if I try to dodge sales tax that way, right? It&#8217;s a bit of a substance over foreign problem, right, that you&#8217;re trying to create these like distinctions that are nonsense. And in fact, there was a Supreme Court case just a few weeks ago with involving apple and an antitrust context, where Apple tried to say that they&#8217;re not the seller of their apps, that they&#8217;re just a marketplace for their apps. And the court found that to be rather silly, in fact that the judge in who gave the majority opinion, just the new judge cabinet, you know, this is just I don&#8217;t want to go there. I know it&#8217;s controversial character, just having to give the opinion, made this distinction. He said that, or, or sort of chopped down this distinction. He said, you know, whether you call it markup or commission, it&#8217;s the same thing, right? So you can say, our marketplace and we make a commission or retailer in charge of markup, he&#8217;s basing this thing, right, you&#8217;re acting a retailer, and everybody. And so it was really great to see the Supreme Court come to that conclusion, because that&#8217;s actually gonna be a powerful tool for Amazon sellers and for going forward. But when you sell on Shopify, that goes away, right, because now there is no Amazon, there&#8217;s no marketplace between you and the consumer, you&#8217;re selling direct to the consumer. So now, we&#8217;re no longer retailers. Now our only defense is the constitutional question of is it too burdensome? Right? And the more you sell on Shopify, the less of a constitutional defense you have. So for example, if you do 200 transactions in South Dakota, you probably have a pretty good defense that it might be too much of a burden for South Dakota and other states to make you like sales tax. Because if you&#8217;re doing 200 transactions, and your item is $20. Well, that&#8217;s, you know, about $4,000 of sales times the 45 states that have sales tax, and we&#8217;re talking about 200 and 185,000. Let me do my math, right,<\/p>\n<p>Michael Veazey 6:06<br \/>\nto get $20 times 40, sales 200 items at $25.<\/p>\n<p>Paul Rafelson 6:12<br \/>\nso that&#8217;s $4,000 just states, I&#8217;m just 40 states, that would be hundred 60,000 plus another five years. So you do $180,000 in sales, because that&#8217;s how you have to analyze you have this you have to extrapolate the state laws that every state adopted it, you had to do it, you know, in every state. So yeah, it would be pretty ridiculous if you had to collect sales tax on underneath that sunset. So 200 transactions is pretty ridiculous. But if you&#8217;re doing $100,000 in Shopify sales on South Dakota, and now you&#8217;re making, you know, decent profit, is it fair for them to require you to collect sales tax, maybe? It might actually be okay. At that point. I don&#8217;t know that many people who do $100,000 in sales in South Dakota, I think if somebody can do $100,000 in sales in South Dakota, they&#8217;re probably doing 10 million in California at the same time, unless they&#8217;re selling Mount Rushmore tickets or something. I mean, that really, in the end, the day it&#8217;s in so you can see in that scenario, yeah, the government actually might be able to make you collect sales tax, depending on how big really are. But now we&#8217;re entering a new area of grey. And so if you&#8217;re that person, and you&#8217;re doing, you know, a few million dollars in sales and states and a number of states, you&#8217;re cracking this $100,000 threshold. Right? The question of whether it&#8217;s unduly burdensome for you to have to comply with the state tax laws is a little bit riskier. And so you do have to consider whether or not you want to register in those instances. And how you register is also a big issue. So you know, if you decide you want to register, you know, there&#8217;s a way to go about it. That that&#8217;s the fundamental problem is that there&#8217;s a distinction between being an Amazon seller and being Shopify seller and that you lose that that extra layer of protection in the law that says, hey, I&#8217;m not even a retailer here, let alone is this going to the constitution? Not only is this unconstitutional, but I&#8217;m also not even a retailer under state law. And that&#8217;s where, if you look at the California treasurer&#8217;s letter, regulation 1569. And the top which talks about how Amazon is a retailer because they do X, Y, Z, you know, and makes you wonder, why is California going after you? And then you realize it&#8217;s political, but that that issue doesn&#8217;t exist in a shop.<\/p>\n<p>Michael Veazey 8:08<br \/>\nOkay, so broadly speaking, what you&#8217;re saying is you don&#8217;t have that much protection, you&#8217;ve got the what you call the constitutional defence. So this is all about the fact that it is burdensome, it&#8217;s not really constitutional. But if it isn&#8217;t burdensome, then basically you got to pay which doesn&#8217;t at some point seem unreasonable. And depending on your view of taxes as a whole, I know some Americans have a sort of religious belief that all tax is evil, but I guess it normally exists in most countries. So there is a sales tax, and you&#8217;re able to reasonably comply with it without ridiculous cost-benefit relative to your revenue. I guess it sounds like you&#8217;re gonna have to pay it. But let&#8217;s take a couple of examples. And let&#8217;s say a Shopify store. And I&#8217;m not really one Shopify store. So I work with businesses you have, but it&#8217;s not my specialist subject for sure. So let&#8217;s say that somebody manages to crack $50,000 a year with the Shopify store in America, their product not being conscious until this point, possibly until they&#8217;ve been listening to this, of exactly which states they made their sales in. I mean, what&#8217;s the starting point for figuring out what you should do next?<\/p>\n<p>Paul Rafelson 9:11<br \/>\nWell, it&#8217;s like you said, the key was, it&#8217;s like you said, Yes, taxes are all evil. I heard that too. But as long as not reasonably cost burdensome to do. So that&#8217;s the burden, right? That&#8217;s the burden we care about here. How expensive is it to comply, and it&#8217;s expensive. If you&#8217;re doing $50,000 a year in Shopify Sales Total across the United States. I mean, first of all, we&#8217;re talking about a potential liability of $3,000 a year, if every state were to go after you, now, a majority of those states of that 50,000, I would say probably 80% of that states probably makes up 20% of the total sales, right? You&#8217;re probably hitting mainly California, Florida, Texas, New York, Massachusetts, right. Like these are probably your top states where you&#8217;re experiencing those sales because it tends to be away of everything e-commerce since the kind of fly in that direction unless you&#8217;re selling something very specific to that region. So right then and there, you know, you might find that most of the liability can be covered by registering in a few states, let alone you&#8217;re as opposed to all of them. I mean, there&#8217;s no point in registering and collecting tax. It doesn&#8217;t cost you know, way more than the amount of tax you have to report perfect example, this my law partner, Jeff Scheck, he&#8217;s a member of the million dollars, you know, he&#8217;s one of these multi-million dollar sellers. And a lawyer was a great, great asset for our firm, because he knows everything there is to know about Amazon, from a legal perspective, because he&#8217;s up to speed. He was sharing with me his tax jar bill, because he uses the software called tax jar, to file taxes in Washington State. Well, Washington State was the first state to do marketplace facilitator. Well, not turning off his tax jar adjusting settings or filing. Washington has another tax called the business and occupation tax. And that tax is a very small percentage of sales that you have to pay. It&#8217;s a gross sales tax, that you have to pay another consumer. And on his millions in sales. I think he owed the state over the course of the year $30. But his tax dollar bill was $500. So my point being is that you know, in instances where there are states where, you know, you&#8217;re going to owe very little tax, I mean, is it even point what&#8217;s the point of being registered and incurring those costs? I mean, I think you have to kind of come to a threshold. So<\/p>\n<p>Michael Veazey 11:26<br \/>\nI think so. So how does that work? from a legal point of view, sorry to interrupt, but this sounds like an extremely important point to get to. So I understand, okay, the cost of compliance of $500, the actual amount owed was $50. I mean, is it really an option to just kind of break the law in theory, and to say, I&#8217;m not going to register with you. And what happens then<\/p>\n<p>Paul Rafelson 11:46<br \/>\nreverse I mean, not breaking the law, you&#8217;re taking a position that constitutional under the Constitution, that it&#8217;s inappropriate for me to be a tax collector, with $30 a tax and having to spend that you know, that the burden is so massive relative to the amount of money, then you&#8217;re not breaking the law, you&#8217;re taking a legal position. Second of all, most of the states have passed $100,000 thresholds, right, California threshold is 500,000. So right, and, and they&#8217;re going back to our case of the $50,000. seller, we don&#8217;t have any, you&#8217;re not doing 100,000 a state now a number of these states have done the 200 transaction test. But we&#8217;re already seeing states on wine that and we&#8217;ve already plenty of legal scholars, and me because I don&#8217;t like to call myself, I don&#8217;t think I&#8217;m a legal scholar, I just, you know, study this stuff. I don&#8217;t know, whatever I do. But you know, plenty of people in the who&#8217;ve been following this issue, who are qualified to comment on it and have found the 200 transactions has to be ridiculously absurd. So really, at the end of the day, if you&#8217;re doing 100,000 in sales, you shouldn&#8217;t be collecting sales tax, if you&#8217;re not doing $100,000 in sales means that you shouldn&#8217;t be fighting anyway. But where it becomes problematic is in states where it&#8217;s not clear whether or not Amazon counts towards that threshold. Some states will say Amazon counts that threshold, someone, so you can be doing $200,000 in Amazon sales, where Amazon&#8217;s  sales tax because it&#8217;s a marketplace facilitator state. And then, in addition to that, 200,000, you might have $500 in sales, right? On your own Shopify account. And so the question that you&#8217;re going to really register it collects for $500 of sales. Right? There&#8217;s a constitutional law position to say that you shouldn&#8217;t you&#8217;re taking a legal position that you can&#8217;t know what could happen if you take a position, and the state disagrees with you? Well, they can send you a bill for the tax, and you can fight it or pay it. And it&#8217;s probably cheaper to pay it. So you can make a decision. At the time the bill comes in the mail to say, Hey, you know, what, out of administrative convenience, because I don&#8217;t want to deal with the cost of fighting it, I&#8217;m going to pay your bill for $50, I&#8217;m just going to pay it plus penalty and interest, which will total $100. And I will have saved, you know, hundreds if not thousands of compliance costs for doing that.<\/p>\n<p>Michael Veazey 13:51<br \/>\nDoes that mean? It does I guess it&#8217;s just a new way of thinking for a lot of us. I mean, I suppose there&#8217;s evading laws in the sense that you just nobody&#8217;s ever going to catch me. And that&#8217;s one way of doing things. And it&#8217;s illegal. But there&#8217;s a lot of business people that have done that for hundreds of years or files. And so that&#8217;s one option on advocating it. Just to be clear, but I&#8217;m not saying that it doesn&#8217;t happen. But the other thing is, it sounds like you&#8217;re not advocating evading tax, but you&#8217;re just saying, I&#8217;m not going to do anything about it either way. And if the state comes off to me, I&#8217;ll pay it because it makes sense financially. But if they don&#8217;t come after me, then I&#8217;m not going to proactively comply with what seems to be the law. Is that more or less this situation?<\/p>\n<p>Paul Rafelson 14:34<br \/>\nWell, is it the law? And is the law right? valid? Right, so so let&#8217;s call it tax evasion for a sec, let&#8217;s say let&#8217;s let&#8217;s say this is a tax evasion perspective position, which is not but let&#8217;s just go down that road, is this tax evasion? Well, in 2000, was it 16, South Dakota passed a law that said that if you do $100,000 of sales, 200 transactions, you&#8217;re required to put sales tax, okay. At that point, a company called welfare should have started collecting sales tax, but they did it. They took a legal position, that they&#8217;re not accountable for that tax, and they went to court. And they lost which they, everyone knew they were going to lose. I mean, it was it was an absurd position. But the point is, it&#8217;s not an Asian if you&#8217;re taking a legal position, right? If you have if there&#8217;s a salad legal there&#8217;s a solid legal basis for why you choose to do or not do something. It&#8217;s not evasion. Okay? Who evade taxes Wesley Snipes of age taxes when Wesley Snipes hired a tax firm that told him that under the Constitution, the United States, he doesn&#8217;t have to pay income tax because Congress never authorized income tax or some nonsense we call tax protesting. He should have known as a US citizen, he has an obligation to pay tax, just like every other US isn&#8217;t ago that that is ridiculous. Okay. state local tax actually is founded in the Constitution. I heard our whole body of law is us constitutional. And so when we say something under the Constitution, we actually have a basis for saying that because I mean, wayfarers a constitutional law case. Well, well, the Constitution Walker&#8217;s every state tax case, that has a Supreme Court case, is this is a constitutional law case. Right? I mean, that&#8217;s, that&#8217;s what we do. So we&#8217;re allowed to take tax positions, if we don&#8217;t think something is legal, we can take a position that it&#8217;s not complicated. Now, who typically takes these positions, huge companies, like GA, Microsoft&#8217;s Google Apple, right? Because the world of state tax in a multi-state context is meant for those companies. Right? The problem is a lot of small businesses are now playing and upon that they really shouldn&#8217;t be playing in or that hasn&#8217;t been adapted to them. The state governments are treating, you know, small sellers and small can be even an eight-figure seller, I consider 8-figure sellers small businesses, right? They&#8217;re treating them like Google. And the promise they don&#8217;t know how to treat they don&#8217;t states haven&#8217;t learned how to distinguish an out of state eight-figure salary from Google, because historically, the only two company types of taxpayers are our taxpayers actually doing business in the state, which then they treat us any other taxpayer, they have the right to do so. And big companies do business everywhere in different ways. And the states this is there&#8217;s this new breed of taxpayers, which are the e-commerce businesses that have now come into play here. And the states don&#8217;t know how to adapt their way of doing business to that, you know, they just, they just don&#8217;t so, yeah, I mean, it&#8217;s some extent we do have to take tax positions. Now what tax was doing, would you be taking if you&#8217;re a $5,000 seller in Shopify, by you, you might be taking the position that 200 transactions is invalid, or that Amazon sales should not, you know, count towards the threshold, because there&#8217;s the burden of that incremental difference of you know, $5,000 in sales, even though I do a million in sales, and California, Amazon, the fact that I only do 5000, on my Shopify, that that that&#8217;s, that&#8217;s highly burdensome for me to have to pay tax on that. And if you make me collect tax on that, I might actually stop doing business, I might actually want to shut down my business. And that&#8217;s a burden on interstate commerce. And as such, should not be allowed. I mean, it&#8217;s like we don&#8217;t want us<\/p>\n<p>Michael Veazey 18:02<br \/>\nin 16. Constitutional<\/p>\n<p>Paul Rafelson 18:04<br \/>\nright, because we don&#8217;t want the is that the right because we don&#8217;t the whole idea Burnham there&#8217;s a commerce, we don&#8217;t want the governments of the states basically make it hard to do business we, our nation is like, the whole point of our nation is like we want business, we want people to do business, we want to encourage growth and business, right? We don&#8217;t want states passing archaic laws that are going to make it possible to do business. Right. Now, I know California probably doesn&#8217;t know that yet. But it&#8217;s true, right? We&#8217;re not supposed to be passing these massive laws that are just like making it possible to do business, they have to be reasonable. And, you know, unless there&#8217;s a reason other than there just has to be a good reason for it. And that goes back to the wayfarer court&#8217;s decision right there saying that you know, listen, when the states make it easy, okay, when a Shopify seller can click one button, and comply with all sales tax laws at once. There&#8217;s no excuse for not complying with sales tax. Right. Or when it&#8217;s $1,000 a year to comply with 50 states worth of sales tax and Shopify, then maybe there&#8217;s no minimum threshold at that time. But that&#8217;s not the case where today Today is a very complicated and very murky to do business in 50 states. And so what I sort of say is, it&#8217;s the states have their own burden here on the constitution to make things easier for small sellers. And until they do that, it may not be your obligation to collect. And again, this is very broad advice, everybody&#8217;s situation is different. Everybody&#8217;s risk tolerance is different, I have to give that disclaimer that we&#8217;re not I&#8217;m not telling you what to or not to do. On this, I&#8217;m just trying to give people perspective to think about it&#8217;s not as black and white, as you know, software companies would like to make you think it is because it&#8217;s in their interest to get you signed up. And then surprise, you get all these letters and things in the mail that you weren&#8217;t expecting because they didn&#8217;t even tell you that there was an income tax or being no tax or franchise tax, or an obligation to collect to register the secretary of state as a foreign business. Right. So yeah,<\/p>\n<p>Michael Veazey 19:55<br \/>\nabsolutely. And just want to give a sense of perspective on what&#8217;s a small business, because I think in the Amazon sort of pond that where the Amazon echo chamber that we can end up, you know, believing a bit too much foreign hype, I mean, under the European Union definitions, which isn&#8217;t to say that it&#8217;s the same in the States. But this gives you a perspective, a micro business is one with a turnover in under 2 million euros. So there are about 2 million US dollars, roughly speaking a year, small businesses under 10 million, and up to $50 million, is called a medium-sized business. So really, it&#8217;s not actually into the breaking the $15 million, you know, threshold, according to the EU&#8217;s, you know, the legal definition of it may not be the same in the US. But it gives you a perspective on, you know, eight figures is not a big business; it&#8217;s a small business, and below that some basically going to be close to a micro business. So it&#8217;s Yeah, when you&#8217;re looking at companies that do billions and billions a year in sales, that suddenly gives a very big perspective. And you&#8217;re right, it&#8217;s it&#8217;s, it sounds like what you&#8217;re saying is the burden is basically on the states to prove that they are able to deal elegantly with the difference in sizes of business, and that they&#8217;re not doing so at the moment. But I guess, as you said, dose content down to individual risk tolerance, talking about let&#8217;s move on to who is the people outside the USA, and then I&#8217;ve got a few questions that have come from a couple of members of the mastermind, which are probably quite practical ones based around, you know, the micro business owners, the one to $2 million a year mark. But first of all, if you&#8217;re outside of the USA, which is to say you have a company limited in the UK, or France, or Germany, or maybe Australia or somewhere like that, what should we do? Is it any different to the advice you&#8217;d give, say, Shopify business owners in the USA? Or is it the same thing?<\/p>\n<p>Paul Rafelson 21:35<br \/>\nI mean, it&#8217;s an essence the same thing. I mean, even if the nobody wants to deal with the government, I&#8217;m going to deal with the whole, you know, the having the government, you know, sending you letters and potentially putting liens on your Amazon inventory or siphoning money out of the US bank account. So, surely the more you know, you&#8217;re operating, if you&#8217;re a foreign owned amazon seller, but you have a US LLC and Us Bank Account. I mean, it&#8217;s it&#8217;s the same considerations, it&#8217;s like, at me, the biggest mistake I see with for businesses is that, you know, especially their Amazon only, or depending on what they&#8217;re doing these days is oftentimes they get wrong, bad advice. And and that bad advice can be costly in two ways. One is they cannot pay federal taxes to the IRS when they don&#8217;t have to, because we have these things for the tax trees, which are agreements between your country in our country and how things will be taxed. And oftentimes, with Amazon businesses, there is no tax if you&#8217;re only doing FBA, but there&#8217;s a way you have to go about reporting that so you don&#8217;t get fined. And then even if you think you&#8217;re doing the right thing, you know, you think, Okay, well, somebody says, okay, you know, file a tax return, like every other US business, even then sometimes the fine can be worse, because if you don&#8217;t file certain foreign disclosure forms, there&#8217;s these like, $25,000 penalties now that that can come up. Because, you know, accountants don&#8217;t know what you&#8217;re supposed to do as a foreign business. You know, I used to do, you know, major international tax restructurings for like Walmart, and GE, you know, it&#8217;s like, it&#8217;s, it&#8217;s not something that, you know, small business accountants simply know about, you know, I just think that while you&#8217;re operating as us LLC, you should file a tax return and do this. And then it&#8217;s like, now you have to do it differently. So I mean, that there&#8217;s those risks, but as far as the sales tax, I mean, it&#8217;s, I think it&#8217;s the same analysis. I mean, I think you just want to be smart about, you know, what your obligations are in the various states, and I think a safe bed these days is $100,000. And I think really 100,000 You know, you&#8217;re not doing $100,000 in a state in between Amazon and your Shopify combined. I think where it gets murky is if you&#8217;re doing, you know, nine, you know, 100,000 on Amazon and 10,000. On Shopify, whether or not you should, you know, file that point, if you&#8217;re doing 100,000, Amazon and 50,000 on Shopify in in a particular state, not total, you know, then, you know, questions come up as to whether or not you should maybe start considering collecting sales tax, specially if the state doesn&#8217;t have a clear separation of marketplace thresholds versus non marketplace thresholds. So that that&#8217;s where it gets murky. So I think the considerations the same again, the key difference is that when it comes to the government coming after you for personal assets, if they try to hold you personally liable for unpaid taxes, it&#8217;s a lot harder for them to come after you in a foreign country than it is for us seller. But to the extent you have assets located in the United States, especially if it&#8217;s in the state that&#8217;s going after you like, for example, if you store inventory, California, in which case, you probably should be cooking anyway, if you&#8217;re actually storing your own inventory in California, then, you know, it becomes a little bit easier for them to potentially take action, but you know, it&#8217;s it&#8217;s just a bloody mess at the moment, isn&#8217;t it? I wish there was clarity, but it&#8217;s it&#8217;s unfortunate, you know, but again, I think the defenses are there. I do want to clarify something management made a spare my on the other pockets, you said, you know, it&#8217;s so easy for me to say, Okay, well just don&#8217;t comply. And then, you know, the other side of this wall is they Well, of course, he&#8217;s a lawyer, and I just want to take you to court and then I&#8217;m going to build you for fees all day long. Well, actually, that&#8217;s not true. litigate a tax case, probably costs in the woods of hundreds of thousands of dollars. And you know, wouldn&#8217;t just be me, Kim Trial Lawyers needed it&#8217;s not easy cases to know, the complex. And you may see some come online that I&#8217;m involved in soon that involve a team of lawyers and through our volunteer efforts around my mercy still be we&#8217;re trying to take some some stands for sellers are trying to get clarity for sellers through our volunteer project, the online merchants Guild, but, you know, for my clients, when they&#8217;re engaging me, it&#8217;s like, I&#8217;m right up front with them, like, like, the goal here is not to take you to the court, because that&#8217;s that would be the last thing that would, that a seller would benefit from, is being in a textbook case. So you know, we&#8217;re trying to keep them out of trouble. And it&#8217;s sort of the keys, like, let&#8217;s just keep you out of trouble and get out of the mess, right, that that we&#8217;re in right now sounds reassuring, changing, things are happening for the better states are adopting marketplace facilitated for Amazon sales, the dropping the 200 transaction tests, I mean, we&#8217;re seeing I think we&#8217;ll get there. I just, you know, feel bad when I meet a new ecommerce seller who&#8217;s like, you know, barely doing a million a year in sales, and they&#8217;ve registered in all 50 states right off the bat, because they read some stupid blog posts. And so that&#8217;s what they should do. And I just, I just get so angry, you know, it&#8217;s just like, it&#8217;s, you know, way to shoot yourself in the foot before you even get out the door.<\/p>\n<p>Unknown Speaker 26:24<br \/>\nAbsolutely.<\/p>\n<p>Michael Veazey 26:25<br \/>\nGot a couple of questions from a couple of members of the mastermind, who have put a couple of questions that have come up in response to discussions we&#8217;ve had recently about this in the mastermind. So let&#8217;s just back these rounds, real quick quickfire ones. First one is even if Amazon&#8217;s collecting a remitting tax on your behalf, that doesn&#8217;t absolve you of your sales tax reporting responsibility. That was something that I believe one of them got from their lawyer. Is that right? In your opinion?<\/p>\n<p>Paul Rafelson 26:50<br \/>\nNo, that&#8217;s not true. In the state of Washington, that was the case. Because the because of that other tax that be, you know, business and occupation tax, so you have to be no tax, which kind of flows off of the sales tax. But actually, in most states, that&#8217;s not true. Most states are not requiring you to file your own tax returns. And second of all, even if that is the case, play it out, logically, one unconstitutional, because states can&#8217;t make you file tax returns for no reason, like they can make Amazon do the work to what are they going to do for not filing a tax return, they already have the money from Amazon, they&#8217;re going to go after you for not filing a piece of paper. Give me a break. I mean, if you if they were to take a $2 million seller to court for not filing a piece of paper, the court would come down so hard on the state for that, that it would be an embarrassment, I mean, that and that&#8217;s sort of the thing you have to keep in mind. Like it&#8217;s an absolute embarrassment, to think of like the scenarios where some of these sellers would end up in a courtroom in front of a judge. And, and the state&#8217;s coming down on, you know, Joe sellers that away fair saying that they should have been XYZ. I mean, that&#8217;s they know, I mean, literally make them look ridiculous, in fact, would probably put they&#8217;re way fair decision at risk. And I&#8217;ve talked to states about this. So you guys really need to dial back. Because if we end up in a courtroom with you, and it&#8217;s not wayfarer, on the other side, but Joe seller, and you&#8217;re playing the same shenanigans, you&#8217;re going to look ridiculous. And you&#8217;re going to make the court think that maybe they didn&#8217;t make the right decision wait there, they might need to dial back your rights and your abilities to do what you need to do. So if the states want to preserve their freedoms, they really need to just chill out. Reno for legal technical term, and stop this nonsense of you have to file tax returns, even though you&#8217;re not recording a tax? Yes, there are. I believe there are a few states Washington that has Minnesota may but certainly not California, New York. I mean, most of the states, when they pass the marketplace laws, they&#8217;re getting their money, and they can move on, there&#8217;s no need to put an administrative burden mean that the ultimate burden on interstate commerce is to make a small seller have to comply with all these complex tax return laws. Just a file a piece of paper, give me a break, they get they can get all that information from Amazon and because of there&#8217;s no right but I&#8217;m to go after you. But that&#8217;s stupid, right? That that that really bothers me when people when the states had the few states, but again, Washington has it for a reason. There&#8217;s another tax, there&#8217;s the be no tax on.<\/p>\n<p>Michael Veazey 29:14<br \/>\nIt&#8217;s not about sales tax. Okay. Cool. All right. So, so just unconscious that I want to get these questions answered before your valuable time gets used up. So the second one, what if your business has an e i n number? So a lot of Shopify businesses might because there&#8217;s a period where you need to want to have a store in US dollars. Does that make you more of a target? Or is that unrelated to sales tax? Because it&#8217;s a federal level?<\/p>\n<p>Paul Rafelson 29:38<br \/>\nIt&#8217;s unrelated. Okay.<\/p>\n<p>Michael Veazey 29:40<br \/>\nAlright. So basically, it doesn&#8217;t make you more of a target.<\/p>\n<p>Paul Rafelson 29:43<br \/>\nknow, having any number doesn&#8217;t automatically get reported to every state. I mean, there&#8217;s, I couldn&#8217;t even imagine I mean, I and numbers are out there. And that&#8217;s not going to be a trigger for the target. Okay.<\/p>\n<p>Michael Veazey 29:55<br \/>\nOkay. That&#8217;s pretty straightforward. And then you&#8217;re talking about so presumably, device for basic people based outside the US, just to clarify, this is going to be pretty similar, whether you&#8217;re based in the UK or Australia, or wherever the other places other people. Listen, Germany and Canada seem to be the classic places where people listen, is that about, right?<\/p>\n<p>Paul Rafelson 30:16<br \/>\nYes, no, I mean, again, the advice for US dollars me a little bit different, because, well,<\/p>\n<p>Michael Veazey 30:23<br \/>\nso just to clarify the question, sorry, I what I mean is, let&#8217;s talk we&#8217;re talking about everyone outside of the US and not about that the one people on one set of people I&#8217;m definitely not talking about now is us base sellers. But for everybody else is it more or less about the same, or the different countries have different sort of agreements with the US that put some certain countries more risk than others, or people in those countries?<\/p>\n<p>Paul Rafelson 30:45<br \/>\nKnow, so there are tax treaties between the federal government and the United States and your country, your home country, wherever it is, those The problem is, is that in a old Supreme Court decision, call it container court, the courts have said that states are not bound by those tax treaties. So that&#8217;s why states could theoretically try to come after you for income tax. At the state level, even though you&#8217;re not required to pay in taxes the federal level. So there is a distinction there. However, in terms of, like, for example, four states that say that you&#8217;re personally liable for unpaid taxes, I mean, there becomes a limitation to what they might be able to do. I, for example, if you live in China, or even if you live in the UK, it&#8217;s a lot harder for the state of Indiana to come after you for back taxes, personally in the UK, then that would be in Illinois, right? Or even in, you know, or any other state because the full faith and credit clause does not apply to UK. So there&#8217;s that component. So I would say that the risk is inherently lower. When you&#8217;re a foreign seller, no matter what you decide to do, it just says you&#8217;re at a lower risk. But it doesn&#8217;t mean you&#8217;re operating us LLC, and you know, states will let us LLC is doing business in the US states as a US company. Okay, its operating under certain states jurisdiction may be Wyoming, hopefully, Delaware, you know, who knows, whatever state, you may have a bank account, that bank might be Bank of America, and Bank of America has branches in every state? Well, you&#8217;ve just made it very easy for California to come and siphon money out of your bank account, if they get a judgment against you. those assets that are in the United States are definitely equally at risk. It&#8217;s just what can they do to you beyond that, you know, if it were really to go to if you were to have a tax arm again, I think that you&#8217;re better off as a foreign seller. I mean, you&#8217;re slightly more protected as a foreign seller than yours US dollar.<\/p>\n<p>Michael Veazey 32:35<br \/>\nYeah, that makes sense. I mean, it sounds like it was almost a dumb question. But it&#8217;s, it&#8217;s worth asking the dumb questions, because I&#8217;m actually the answers you get from the experts are quite often very different. But listen, Paul, this has been incredibly enlightening and helpful. If you haven&#8217;t listened to the other episode, where we dealt with more specifically, Amazon only taxes all taxes in for a company, that is, you know, pretty much only or solely selling on Amazon, there&#8217;s there&#8217;s a lot of important stuff, you need to listen to the other episodes. So you can get there&#8217;s quite a lot of detailed notes I&#8217;ve taken here. So you can get those at 10 K, collective calm, Paul, very grateful for you bring some clarity to a murky area. Have you got any sort of simple parting thoughts for people who are selling into the states, whether they be on Amazon or off Amazon? And whether they&#8217;re US based? Or outside of the US? What are their sort of simple guidelines or simple thoughts you&#8217;ve got?<\/p>\n<p>Paul Rafelson 33:30<br \/>\nYeah, I think, you know, don&#8217;t let tax be the biggest distraction to your business. I mean, it is a it is an absolute mess. Don&#8217;t make bad business decisions, because attacks like I&#8217;m going to pull out of it. People told me don&#8217;t plot a VA because attacks like, like, don&#8217;t do that. make as much money as you possibly can, you know, Amazon sellers have so much to focus on between, you know, protecting your IP incorporating properly. I mean, there&#8217;s so many, you know, random issues that pop up, but attacks. Right now, you just take a take a common sense, look at a materiality approach to it, right, like, what if the state of Iowa were to come after me for back taxes? Because I didn&#8217;t collect on Shopify? Right? How much would I owe $17 plus penalties and interest? So I&#8217;m I don&#8217;t, you know, keep that just keep that in mind before you go reading a blog posts and jumping in and registering every stage. It&#8217;s just try to keep it pragmatic, and, and material materiality based approach, because it&#8217;s all we can do right now. I mean, the laws are still being developed and figured out, it&#8217;s still very murky. So I encourage people to still do business in the United States, still make as much money as you can in the United States still do FBA and United States, especially now, it&#8217;s great, but, you know, when it comes to things like sales tax, or any other means, just just take the material, take a materiality approach to it, especially with respect to Shopify, you know, what, what are the risks, you know, if I&#8217;m wrong, and I think you&#8217;ll find that oftentimes that will guide you in your decision making process and and, you know, for the few sellers out there who are doing seven, eight figures on Shopify, I mean, God bless you, you&#8217;re you&#8217;re, I can tell you from my client makes your you&#8217;ve done something really great and amazing, because it&#8217;s a very hard thing to do. And we can certainly help you with that. But for a lot of sellers, you know, if you&#8217;re just experimenting with Shopify, or trying to get it to grow, I don&#8217;t want to discourage you from having a Shopify account. You know, certainly it is there&#8217;s benefit of having it but you know, before you before you just sort of have a Shopify account second, well now I need to register in every state because I&#8217;m hitting you know, just take a programmatic and material materiality based approach and look into Okay, well what&#8217;s really going to happen in a year the government you know, the state of Iowa working after me for backpacks and I think you&#8217;ll find that most of the time that&#8217;ll probably help you in your decision making process.<\/p>\n<p>Michael Veazey 35:41<br \/>\nThank you That&#8217;s really helpful and just if there are people who still feel that they need legal advice because we can only give very general advice of course on any kind of podcast like this, how do people contact you what&#8217;s the best way that they can get in touch?<\/p>\n<p>Paul Rafelson 35:55<br \/>\nSo we have a very easy website to remember he calm attorneys, e commerce EC Oh, Ma, TT o r e s polity calm attorneys calm. And yeah, come and talk to us. We&#8217;re, you know, a law firm. We&#8217;ve got a couple seller lawyers on our team. We&#8217;ve got great IP lawyers, patent lawyers, design patents, which is my new thing. Right now. I think sellers have no idea what sign pads are and to learn about it, because it&#8217;s a great level layer protection even I think we can we really are a you know, we call ourselves Earth&#8217;s most seller centric offer. We are very focused on helping sellers, e commerce succeed and to you know, using the law to their advantage. And basically, I would love to help anyone who can use our help. And if you want to do business United States and kind of get over you help you with that, too. And<\/p>\n<p>yeah, look forward to hopefully meeting some of your folks.<\/p>\n<p>Michael Veazey 36:46<br \/>\nThat&#8217;s great. Paul, thank you so so much for coming on and sharing your expertise. incredibly helpful. Thanks for listening to the 10 k collected podcast. I really hope you found this show helpful. I mentioned the London based masterminds we&#8217;ve been running since September 2017. Members of the 10 k collective mastermind making minimum about 480,000 pounds a year, whatever. 600,000 euros or dollars. To find out more about that mastermind. Get to amazing fba.com forward slash 10 k si k for keynote. See for Charlie, million pound mastermind members make a minimum 4.2 million pounds a year that&#8217;s about 1.5 million US dollars for years. To find out more about that mastermind. Go to amazing fba.com forward slash MP endless em from other people.<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_024.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fsales-tax-for-shopify-with-paul-rafelson%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-5\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_024.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9653-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_024.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_024.mp3\">Download<\/a> (Duration: 37:50 &#8212; 30.9MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_024.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fsales-tax-for-shopify-with-paul-rafelson%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-6\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_024.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9653-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_024.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_024.mp3\">Download<\/a> (Duration: 37:50 &#8212; 30.9MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 37:50 &#8212; 30.9MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 37:50 &#8212; 30.9MB)Subscribe: Spotify | Email | TuneIn | RSS<\/p>\n","protected":false},"author":1,"featured_media":6850,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1550],"class_list":["post-9653","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Sales tax for Shopify with Paul Rafelson - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Sales tax for Shopify with Paul Rafelson - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 37:50 &#8212; 30.9MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 37:50 &#8212; 30.9MB)Subscribe: Spotify | Email | TuneIn | RSS\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-08-06T05:00:57+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-28T16:13:48+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K024-paul-rafelson-sales-tax-law-for-ecommerce-sellers.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"45 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Sales tax for Shopify with Paul Rafelson\",\"datePublished\":\"2019-08-06T05:00:57+00:00\",\"dateModified\":\"2020-06-28T16:13:48+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/\"},\"wordCount\":9385,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K024-paul-rafelson-sales-tax-law-for-ecommerce-sellers.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/\",\"url\":\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/\",\"name\":\"Sales tax for Shopify with Paul Rafelson - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K024-paul-rafelson-sales-tax-law-for-ecommerce-sellers.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-08-06T05:00:57+00:00\",\"dateModified\":\"2020-06-28T16:13:48+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K024-paul-rafelson-sales-tax-law-for-ecommerce-sellers.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K024-paul-rafelson-sales-tax-law-for-ecommerce-sellers.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"Sales tax for Shopify with Paul Rafelson on the Amazing FBA with 10K Collective Podcast\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Sales tax for Shopify with Paul Rafelson\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Sales tax for Shopify with Paul Rafelson - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/","og_locale":"en_GB","og_type":"article","og_title":"Sales tax for Shopify with Paul Rafelson - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 37:50 &#8212; 30.9MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 37:50 &#8212; 30.9MB)Subscribe: Spotify | Email | TuneIn | RSS","og_url":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-08-06T05:00:57+00:00","article_modified_time":"2020-06-28T16:13:48+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K024-paul-rafelson-sales-tax-law-for-ecommerce-sellers.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"45 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Sales tax for Shopify with Paul Rafelson","datePublished":"2019-08-06T05:00:57+00:00","dateModified":"2020-06-28T16:13:48+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/"},"wordCount":9385,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K024-paul-rafelson-sales-tax-law-for-ecommerce-sellers.png?fit=1280%2C720&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/","url":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/","name":"Sales tax for Shopify with Paul Rafelson - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K024-paul-rafelson-sales-tax-law-for-ecommerce-sellers.png?fit=1280%2C720&ssl=1","datePublished":"2019-08-06T05:00:57+00:00","dateModified":"2020-06-28T16:13:48+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K024-paul-rafelson-sales-tax-law-for-ecommerce-sellers.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K024-paul-rafelson-sales-tax-law-for-ecommerce-sellers.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"Sales tax for Shopify with Paul Rafelson on the Amazing FBA with 10K Collective Podcast"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/sales-tax-for-shopify-with-paul-rafelson\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Sales tax for Shopify with Paul Rafelson"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K024-paul-rafelson-sales-tax-law-for-ecommerce-sellers.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2vH","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9653","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9653"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9653\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6850"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9653"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9653"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9653"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}