{"id":9654,"date":"2019-08-01T06:00:23","date_gmt":"2019-08-01T05:00:23","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6827"},"modified":"2020-06-29T13:44:10","modified_gmt":"2020-06-29T12:44:10","slug":"tax-nexus-with-paul-rafelson-of-ecommerce-attorneys","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/","title":{"rendered":"Tax Nexus with Paul Rafelson of eCommerce Attorneys"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_023.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Ftax-nexus-with-paul-rafelson-of-ecommerce-attorneys%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_023.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9654-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_023.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_023.mp3\">Download<\/a> (Duration: 27:31 &#8212; 22.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_023.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Ftax-nexus-with-paul-rafelson-of-ecommerce-attorneys%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_023.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9654-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_023.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_023.mp3\">Download<\/a> (Duration: 27:31 &#8212; 22.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><!--more--><\/p>\n<h1>Tax Nexus with Paul Rafelson<\/h1>\n<h3><b>What is “Tax nexus”? And is this relevant?<\/b><\/h3>\n<p>Tax Nexus is a question of whether a government has jurisdiction over you, ie, can they make you do things?<\/p>\n<p>Eg The State of Alabama has little jurisdiction over you if you live in UK.<\/p>\n<p>If you engage in certain activities, you may get “nexus”.<\/p>\n<h3><b>Does Tax nexus matter?<\/b><\/h3>\n<p>It depends! States that don’t have “marketplace facilitator laws” including Maine, Vermont, Louisiana, Mississippi, Florida might chase up individual Amazon sellers, or their companies.<\/p>\n<p>There are 2 types of Tax Nexus<\/p>\n<p><b>“Tax Nexus under existing laws”<\/b><\/p>\n<p>In order to have tax nexus &#8211; pre wayfarer law required physical presence.<\/p>\n<p><b>Tax Nexus under “due process”<\/b><\/p>\n<p>This might happen, for example, if the business is not present in the state, but is availing itself of that state’s jurisdiction, and is attempting to capture the Alabama market (as distinct from US market)<\/p>\n<p>If you don’t have due process nexus, tax nexus should not even come into play!<\/p>\n<p>Eg your company didn’t put a product in Alabama &#8211; Amazon put it there.<\/p>\n<p>You didn’t put it there for a strategic reason eg to get into the Alabama state.<\/p>\n<p>This removes the due process nexus!<\/p>\n<p><b>Tax Nexus Case 2011 J Macintyre <\/b><\/p>\n<p>J Macintyre had consigned inventory in a state (NJ). The supreme court found that wasn’t enough to create tax nexus. Company inventory was placed there by another company. It was put into the “stream of commerce”.<\/p>\n<p><b>Wayfair decision &#8211; what was it, what did it mean for Amazon sellers?<\/b><\/p>\n<p>This was a landmark case of summer 2018. The upshot was that Physical presence was no longer a requirement for sales tax.  Physical presence was a “bright line” law 1992-2018. There was a previous history.<\/p>\n<p>The wayfarer decision said: In today’s economy,  we are no longer going to require physical presence. However&#8230;There is a 4-part test to see if a state has the right to tax a company:<\/p>\n<ol>\n<li style=\"list-style-type: none;\">\n<ol>\n<li>Complete nexus<\/li>\n<li>Fairly divided<\/li>\n<li>Not overly burdensome (shouldn’t favour one state over another)<\/li>\n<li>Rationally related to services and benefits you receive from the state.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<p>Wayfair only gets to ONE of the 4 tests.<\/p>\n<p>Wayfair is also a massive company &#8211; which is why when the company claimed it was an “undue burden”, the court didn’t believe them!<\/p>\n<p>However, this was a case about a big company.<\/p>\n<p>The court was clear that if there will be a physical nexus case, the jury is still out.<\/p>\n<p>Its decision does NOT mean that small businesses don’t have the right to challenge it as overly burdensome.<\/p>\n<p><b>Undue burden defence<\/b><\/p>\n<p>The court did say “<i>in dicto<\/i>” (i.e., it’s not setting a precedent) &#8211; the way it’s going: the states are going to have to make it easy for small businesses to comply with the law.<\/p>\n<p>A small business can bring a case and challenge the law; however, IF there is software out there that makes tax compliance easy,  then it’s unlikely that small business can overcome it (eg the streamlined business software). However, it’s unlikely to be solved soon!<\/p>\n<p>The question is: How do you find a company that can do the 50 states compliance for a small business?<\/p>\n<p>The big 4 KPMG, Deloitte, EY, PWG &#8211; too expensive!<\/p>\n<p>A local accountant cannot do this!<\/p>\n<p><b>Does tax nexus matter?<\/b><\/p>\n<p>No! If you just sell on Amazon, Amazon will collect most of the tax.<\/p>\n<p><b>Summary for US Amazon sellers<\/b><\/p>\n<p>Why would now be the time to get registered for sales tax? In a few months, it won’t be your responsibility in the majority of states because Amazon will not<\/p>\n<p>Yes, the government can try to make you miserable &#8211; California has been trying for years! But that’s not a good enough reason to register.<\/p>\n<p><b>What about back taxes?<\/b><\/p>\n<p>If in theory, you are already on the hook for 5 years’ worth of sales tax, why start now?<\/p>\n<p>If you’re already liable for 10X life savings, why change now?<\/p>\n<p>If you register now for sales tax and give in to the government, they’re not offering great deals.<\/p>\n<ul>\n<li>you still need to pay it or fight it.<\/li>\n<\/ul>\n<p>A lot of Paul’s clients are those who registered with California back in October. They realised<\/p>\n<ol>\n<li>They can’t afford to pay<\/li>\n<li>Registering didn’t save anything! Now California knows they are a willing participant!<\/li>\n<\/ol>\n<p>Another client got a bill for $300K from Massachusetts &#8211; but actual tax should be about $ 10K; now he’s got to fight it in court.<\/p>\n<p>If you need to register, there are better ways to deal with it.<\/p>\n<p><b>Summary for outside US Amazon sellers<\/b><\/p>\n<p>This is even truer outside the USA&#8230;<\/p>\n<p><b>Does it make a difference where you’re based?<\/b><\/p>\n<p>It makes it harder for states to come after individuals for liability.<\/p>\n<p>“Faith and Credits clause” doesn’t apply to the UK; nor China.<\/p>\n<p>If you use US companies, there are things that can happen. But they are MORE likely to come after you if you register.<\/p>\n<p>Eg if you’ve just registered an LLC, you’re more vulnerable.<\/p>\n<p>&nbsp;<\/p>\n<p><b>How do people contact you?<\/b><\/p>\n<p>Paul@ecomattorneys.com  or <a href=\"https:\/\/ecomattorneys.com\/practice-tax\/\">check out the blog here. <\/a><\/p>\n<p>They have a couple of seller lawyers; patent lawyers (design patents are a great layer of protection).<\/p>\n<hr \/>\n<h2>Transcript<\/h2>\n<p>Michael Veazey 0:56<br \/>\nLet&#8217;s get back to some of the basics of words that knock around their first time. I guess a lot of this is moot really. But let&#8217;s let&#8217;s dig into this because a lot of people discussing this in the Amazon seller community that I personally know anyway, first of all, what is tax Nexus? And is that even relevant<\/p>\n<p>Paul Rafelson 1:11<br \/>\nnow? Right. So it isn&#8217;t it&#8217;s not it&#8217;s interesting. So it depends on what you do. And just to give you an idea of states that haven&#8217;t, you know, before we get into it, just just pull up a map. states that don&#8217;t have marketplace facilitator laws, as far as I can tell, looks like Maine, Vermont, Michigan, Wisconsin, Montana, Montana sales tax Kansas, Missouri, Louisiana, Mississippi, Georgia, Florida. I mean, if I&#8217;m looking at this map of the United States, and it&#8217;s pretty much all filled in states that have of our facilitator law coming online. So to get to your question to what is next isn&#8217;t doesn&#8217;t matter Nexus is about whether or not the government has jurisdiction over you. Right? That&#8217;s the concept of Nexus is really about whether the government can exercise jurisdiction over you, can they can they make you do things right? are you connected to the government? So like, for example, can the state of Alabama tell you that you need to make your bed every morning, right? Well, you live in the UK, you&#8217;ve no connection to Alabama, clearly, it would be pretty ridiculous. Obviously, the law itself is ridiculous. But just to sort of make the point, the state of Alabama would have a pretty difficult time trying to make you make your bed every morning. Because you don&#8217;t have a connection to Alabama, right? You know, live in Alabama, you don&#8217;t do business in Alabama, theoretically, right? You&#8217;re, you&#8217;re in the UK, then all of a sudden, you start engaging in certain activities in Alabama. Now, the question comes, could they then, you know, are you now subject to the jurisdiction? Can they make you do things right, that that&#8217;s what Nexus is that you have a tie to that state to where the state can then actually exercise jurisdiction and hold you accountable under their laws, when it comes to Nexus, and you&#8217;ll never hear this from the sales tax software companies. Because one, if you&#8217;re interested tell you into that probably aren&#8217;t too not lawyers, and they&#8217;re not very good at what they do. There&#8217;s two types of Nexus there&#8217;s Nexus under what we call the due process clause. And then there&#8217;s Nexus under the Commerce Clause. Nexus under the Commerce Clause is what you guys commonly referred to as physical presence Nexus. It&#8217;s a very special type of Nexus that&#8217;s specific to tax. And it says that you in order to have a tax Nexus in a state, in other words, in order to be subject to the tax regime of another state, you have to have a physical presence in the state that was the old, you know, pre way fair sales tax case law. And so the idea is, if you have some physical presence in the state, then you you&#8217;re deemed to have enough of a connection to the state to where they can exercise tax jurisdiction. However, what they don&#8217;t tell you is that there are scenarios where you can have a physical presence in the state of some type, and not actually had, the ability to state can still not be allowed to exert jurisdiction over you, because they don&#8217;t have what&#8217;s called due process Nexus, meaning your ties to the state, you&#8217;re not actively doing business in the state, you&#8217;re not directing your activities towards the state, you&#8217;re not purposely availing yourself of that state&#8217;s jurisdiction, you know, there&#8217;s no, there&#8217;s no intent to go into Alabama, to do business there. Or to capture the Alabama market. Specifically, there&#8217;s a distinction between trying to capture the US market broadly and trying to capture the Alabama market. And that&#8217;s what the process Nexus is about. So if you don&#8217;t have the process Nexus, then the question of physical presence Nexus isn&#8217;t even come into play, we don&#8217;t even go there. And that&#8217;s something that you don&#8217;t hear about very often. So there&#8217;s this idea that you know, okay, well, let&#8217;s assume for a second that having your products in a warehouse constitutes physical presence, fine, but you didn&#8217;t put your product in Alabama, or wherever, Amazon put it there. You didn&#8217;t decide, hey, I want to have a warehouse in Texas, and I want to store my inventory there. Because strategically, this is going to help me capture the market or this is going to help me, you know, do X, Y, Z, I need to be in taxes. Amazon set up its own network of distribution centers. And it decides where things go, not you. And so that distinction is is is important, because that actually removes the due process Nexus component from the analysis. So sellers who&#8217;ve been told that they have physical presence Nexus have actually not had the complete story told to them. In fact, we have a case from 2011 called J. McIntyre VENA Castro, which talks about a scenario where a company has inventory in the state consigned inventory, which is in essence, what FBA could be called a consignment inventory, right, Amazon&#8217;s holding your inventory and said, in essence, on consignment, the court found that that wasn&#8217;t enough, that the company inventory sort of being placed into that state by another. And having sat there on consignment isn&#8217;t enough, because the company wasn&#8217;t targeting in this case, this the state in this scenario, the case was about New Jersey, it was a Supreme Court case. But the inventory wasn&#8217;t, you know, it wasn&#8217;t that the company was trying to target New Jersey, they were just trying to target the US market. So they, they put the product in what we call the stream of commerce is sort of washed up into New Jersey. And the court found that that was not enough to subject that company to the jurisdiction of New Jersey. And so it&#8217;s sort of the same thing here. It&#8217;s like you didn&#8217;t put your stuff in Texas, you should have dropped it into the stream of commerce by sending it off to Amazon. And Amazon decided it&#8217;s going to go here, they&#8217;re anywhere,<\/p>\n<p>Michael Veazey 6:19<br \/>\nright. It&#8217;s amazing how this actually sounds like common sense. And I remember speaking to a lawyer A few years ago, and like, you know, quite often people have a very, very dark view of the law and lawyers like there is no common sense involved. But actually, what people forget, is that in England and I say England, I&#8217;m not being anti if you&#8217;re Welsh or Scottish listening, then I&#8217;m not being anti you. But there&#8217;s no such thing as UK law. There&#8217;s only English law, right? There&#8217;s the Scottish legal systems always been separate. A small bugbear of mine. But anyway, so the point is that we have a common law system in English law and American law. It&#8217;s not just written in a book, and that&#8217;s it fixed, there is a judge who makes judgments, and then he or she will create a precedent for other people to follow. So there there&#8217;s a degree of common sense that comes in and it sounds like the common sense is coming in. So that&#8217;s very reassuring. Now, you&#8217;ve mentioned wayfarer a couple of times we can&#8217;t bypass that, because obviously that&#8217;s becoming sort of famous thing. What is it? What was it and what does it mean for Amazon sellers? Because we keep hearing about this,<\/p>\n<p>Paul Rafelson 7:20<br \/>\nthose good, and I saw it as the question whether or not sellers should care. So it&#8217;s good, good segue into that. So wayfarer was the landmark Supreme Court case from last summer. It was a year ago, Wednesday or Thursday, last Thursday, I think was the one year anniversary of wayfarer. That said that physical presence is no longer a requirement for sales tax. So of course, whatever we do, all the software companies jumped on it and said, Okay, now you&#8217;re really you&#8217;re really in trouble because they just said digital presence is not a requirement. So what wayfarer did was it took that&#8217;s it said basically, in today&#8217;s economy. physical presence has been such a,<\/p>\n<p>you know, it was it was sort of a,<\/p>\n<p>what we call a bright line rule that the court adopted, because I didn&#8217;t know what else to do, you know, the court that I can go through the long history of a fair of the prior decision, which was quill vs. North Dakota. But I&#8217;ll spare you that. But there&#8217;s a long story to how we ended up at physical presence, still be the norm from 1982 to 2018. But basically, wayfarer was the moment where the courts are just like this law is a working company states are losing a lot of money, we need to change it. So wayfarer came along. And the courts basically said, we&#8217;re no longer going to require physical presence as a requirement for jurisdiction attacks. Now, couple things about that. One, there are four parts to a state tax case analysis, right? If you want to determine whether state taxes valid, there&#8217;s actually a four part test, the test comes from a case called complete auto transit, the Brady, basically what it means is you have to have substantial Nexus has to be fairly divided among the states, which really isn&#8217;t relevant sales tax, the tax has to be non discriminatory, meaning you can&#8217;t be overly burdensome in interstate commerce, it can&#8217;t be that, you know, attacks that basically favors one state over another. So like, you know, attacks on out of state milk would be a discriminatory tax, because you&#8217;re basically trying to, you know, you know, tax the out of state milk, so people buy in state, things like that. And then it has to be rationally related to the services and benefits that you receive from the state because it&#8217;s a four part test. Next, this is one part of that test. Basically, there&#8217;s still the three other parts that have to be analyzed. So for one way, fare only gets to one part of a four part test, which would go into play if we were to determine whether or not sellers were were accountable for taxes in the state to the court was very clear and laissez faire, that this was a case about a huge company called a fair, multibillion dollar multinational company. If you&#8217;ve ever been to Boston, Massachusetts, and you get out at this Government Center, you look up, there&#8217;s a ginormous building when the most expensive cities in the world. laissez faire right there. Okay. That&#8217;s who we&#8217;re talking about. We&#8217;re talking about why is this company claiming it&#8217;s an undue burden to collect packs, their companies a lot smaller than wait there that can deal with 50? state taxation, right. They&#8217;re claiming it&#8217;s an unfair burden. Right. And the court found that just to be I think they just had enough of that argument. But the court was very clear that this was a case about a large company. In fact, again, the the article is referring to earlier that my professor at NYU that just wrote for tax journal made that point to it was I was really glad to see that he acknowledged that to that, you know, the court was very clear that, you know, if there&#8217;s going to be a physical presence Nexus case, or whether or not, you know, small business has an access issue, that that&#8217;s still out there. Right. The jury&#8217;s still out for it was very clear in the wayfarer decision that its decision, as far as whether or not wayfarer has to collect sales tax does not mean that small businesses don&#8217;t have a challenge to bring court was very clear they do. The court just didn&#8217;t have the record to make that decision. Right. They didn&#8217;t have anything on the record that came up through the lower courts to say, this is overly burdensome. So what the court did say and sort of dictate, which is sort of the courts kind of going off and saying what they think, you know, the answer is sort of, you know, without almost like speculating, it&#8217;s like, it&#8217;s like, it&#8217;s not precedent, it&#8217;s just sort of the courts, you know, interpretation of things, but it&#8217;s not bound to anything. So it&#8217;s not like it&#8217;s precedential. But what the court was saying is, in their view, the way things are going is that the the states are going to have to make it easy, right, that the court felt that if a small business were to challenge a fair and say, Hey, I don&#8217;t have this, I don&#8217;t have a physical presence, but I shouldn&#8217;t have to pay tax.<\/p>\n<p>If the states haven&#8217;t made it easy to comply with all these laws, then that company has a probably a pretty good case. The way the court said though, is sort of in the contrary, what they said was that they said you can bring case a small business could bring a case and challenge to the law and numerous number of theories. However, if the trend holds to where there actually is software, right, because that they were saying, as we expect in the next few years, there will be software out there that will make Tax Compliance a breeze, right. And they were pointing to things like the Streamlined Sales Tax project, which they didn&#8217;t evaluate. They&#8217;re just saying that they that there are these projects out there. And if that is true, so you know, if you can if there&#8217;s a one-click solution to sales tax, we just have to click a button, then it&#8217;s unlikely that small business would have would be able to prevail. But we know in reality that there is no one solution, there is no easy solution to sales tax, even though the Streamlined Sales Tax program, which has only been adopted by 20 odd states hasn&#8217;t isn&#8217;t easy. So there&#8217;s, there&#8217;s there&#8217;s an open challenge that remains for small businesses to challenge wait there and say, Hey, I can&#8217;t do this. I&#8217;m a, you know, $5 million company, I can&#8217;t deal with all 50 states, I&#8217;d have to hire, you know, an accounting team, or I&#8217;d have to hire Price Waterhouse Coopers I mean, if you just think about it logically right? mean, where does a person go in their home state to find a tax accountant or advisor that&#8217;s familiar with 50 states worth the tax law, the only companies out there that really can do that are the sort of big four accounting firms, or sort of second-tier and only secretaries and less good, I just mean, like, after the top four, because they&#8217;re known as the Big Four, you know, Price Waterhouse, KPMG, the Lloyd NY right, companies that typically don&#8217;t help small businesses, because they&#8217;re prohibitively expensive, right? And then, but the point is, your local accountant isn&#8217;t going to know how to do it, right? Like the to the accountant that small businesses are meant to go to, doesn&#8217;t know how to do 50 states worth of tax stuff, right. And if they do, it&#8217;s still expensive. But most out, you know, a New York account probably is not going to know the nuances of the Mississippi tax returns, right? It&#8217;s just not going to be so it&#8217;s really on the states at this point, to make the process easier for sellers for businesses, if they want their taxes of any kind, and can tax sale tags, anything I mean, the states have to you know, it&#8217;s been 25 years, since the last digital presence decision 26 now, and 27, excuse me, and they&#8217;ve done nothing. I mean, the states have done nothing to really, you know, sort of make it easy to comply with all their laws, and what the courts essentially saying wayfarer as well until they do Tough luck. And that&#8217;s what people have to understand. But going back to original point, sort of looking at this map of marketplace facilitate a law for most Amazon sellers, it&#8217;s really not going to matter. By the end of this year, Amazon&#8217;s been collecting the tax, it&#8217;s going to matter if you have a Shopify account, that&#8217;s where it&#8217;s still going to matter. And for most Amazon sellers, I know the Shopify business is like, not even 5% of their total sales, you know, it&#8217;s a lot harder to have a successful Shopify business than it is to have a success. Amazon business, right. And so, you know, unless you&#8217;re one of the few sellers who really has the potential amount of Shopify sales, I mean, it&#8217;s really not going to be an issue for you as far as whether or not you should register. Now, if you&#8217;re doing, you know, $30,000 a year of sales on Shopify, it will cost you more money to deal with these states than it is to actually sell I mean, a lot of people, you know, they really are faced with the decision of, you know, do I register and collect sales tax and every state, just so I can continue to make Shopify sales, I think a lot of sellers would rather just, you know, call it the drop of fire effect, you know, just drop your Shopify, because what&#8217;s the point? You know, it&#8217;s, you don&#8217;t make it. But on the flip side, is, if you&#8217;re doing 30,000, Shopify, and even 20% of that was in California, at $6,000. In California sales, time seven and a quarter percent, we&#8217;re talking about, like 450 bucks, roughly, we&#8217;re not talking about a substantial amount of money, right? It&#8217;s not like you&#8217;re not collecting on a million dollars in sales, we&#8217;re talking about 40, $50 on collect the tax. You know, it doesn&#8217;t sound silly, but it&#8217;s like, kind of like, you know, jokingly, I&#8217;m like, well let the state come after you. But the state come after you for $450 Let me send you a bill for the uncollected tax if they want it. And then you can pay it then. And you know, what, it&#8217;s probably still cheaper than having to hire accountant for the year, and just have them send you a bill at $450 a year. You know, and again, I&#8217;m being facetious here. But the point is, is that, you know, unless you have just a little Shopify sales, really, I mean, you shouldn&#8217;t be jumping in right now. You know, in fact, most sellers want to get out. Okay, so that&#8217;s,<\/p>\n<p>Michael Veazey 16:36<br \/>\nthat&#8217;s pretty clear summary. So just just get because we&#8217;re going to, let&#8217;s do a separate episode about the whole question of ecommerce off Amazon, because I think we&#8217;ve got some questions from from a couple of listeners and people in the mastermind groups and put a couple of questions for me for you. So let&#8217;s just summarize. And if you&#8217;re only on Amazon, if you US based seller, and then let&#8217;s talk about it for anyone who&#8217;s outside of the US. So what&#8217;s the summary of your advice? If you&#8217;re a US based Amazon seller? Simple, simple there.<\/p>\n<p>Paul Rafelson 17:02<br \/>\nYeah. I mean, I think if you&#8217;re a USPS, Amazon seller, you have to consider,<\/p>\n<p>you know, why would now be the time to get involved? I really don&#8217;t see why you would want to start registering states when in the next few months, it&#8217;s not gonna be your responsibility anymore. You know, that? That&#8217;s really the question. I mean, that&#8217;s, I guess, the question. I mean, that&#8217;s really I mean, again, I this is a for informational type of podcast, right? I&#8217;m not giving legal advice. Everyone has their own risk tolerance, I have to do the disclaimer, right. Everyone has their own just, you know, risk tolerances. And, and, you know, just because I&#8217;m saying you&#8217;re not accountable for that, as many as the government can try to make your life miserable. God knows California has been doing this to a lot of people for years. Yeah. I mean, why? Why are we registering? Now when, you know, by the end of the year, all the states are going to be requiring Amazon to do it? And well, I don&#8217;t want to incur back taxes for the next six months? Well, again, it&#8217;s the laws on your side, on many levels, and two, if you&#8217;ve been selling for four or five years, years, and you&#8217;re already on the hook, the government in theory, again, in theory, I&#8217;m not saying you are, but just let&#8217;s just, you know, play out your mindset. I can cut off liability. If I register now that I&#8217;m not accountable for the next six months, where the tax Well, if you&#8217;re already accountable for an amount of tax, that would equate to 10 times your life savings. What&#8217;s the next six months gonna matter? You know, you&#8217;re already in the hole. And that&#8217;s the case with a lot of California sellers. And that&#8217;s what I found disingenuous with a lot of these tax software companies is they&#8217;re like, Oh, you know that you need to register now. Because the government&#8217;s coming after you Well, what does that matter? If you register now and you, you you give in to the government? And they say, Okay, well, I&#8217;m ready to take that they&#8217;re not, they&#8217;re not offering any great deals, they still want their tax, you still have to either fight it or pay it? You know, and for a lot of people, the amount of money that they owe California alone is enough to bankrupt them 10 times over. So I&#8217;m sort of saying, well, what&#8217;s the difference between four years of back taxes of California in four years and four months? I mean, at this point, it&#8217;s just a matter of, you know, you&#8217;re better off fighting it. And and we are fighting it. But<\/p>\n<p>Michael Veazey 18:58<br \/>\nso not only just as trying to summarize this in like the simplest possible terms, and again, not only my not a lawyer, this is not only not legal advice, but I&#8217;m not qualified to give legal advice. This is my understanding of a lawyer giving generalized advice. Right. But it seems to me what you&#8217;re saying is, it&#8217;s once you register with the government, it&#8217;s harder to fight it said don&#8217;t even register. Is that is that an accurate summary<\/p>\n<p>Paul Rafelson 19:21<br \/>\nnow is once you register with the government, you sort of you know, you&#8217;ve opened up the inquiry, right? You put yourself out there. So now you&#8217;re going to, you know, some a lot of my clients come to me because somebody else advised them to do some things. You talked about objective advice, best thing I could have done, like I said, if I was financially motivated, in the sense of like, that&#8217;s truly the reason why I was doing this was just because I wanted to make as much money as I could and cash in on sales tax, I would have told everybody registered in California, which I did not write, and then every other state, and then all those people would get these letters from the government saying they owe all this back tax, or they did this wrong. And then I would help them get out of that mess, right? Because that&#8217;s who my clients are. A lot of my client are people who registered in California when they got a letter from California back in October, you know, because they listened to somebody else who said, you need to register now it&#8217;s over, right? They&#8217;re telling you, they&#8217;re coming after you? Well, again, if they&#8217;re coming after you for four years, what&#8217;s the difference? I mean, you&#8217;re already dead. But they listen to those people. And then they come to me, because now they realize when they can&#8217;t afford to pay California. And to they start to realize that Yeah, registering didn&#8217;t save any just, you know, now they&#8217;re collecting tax don&#8217;t forward. But now, California knows that there are willing participants and they&#8217;re on California&#8217;s radar. And California is going after them. And then that tends to happen. A lot of other states, right, Massachusetts, I&#8217;ve got a client who got a bill for $300,000, the actual tax he probably would owe if if he even owed it would be 10,000. But he registered Massachusetts, Massachusetts just made up a number, send them a bill. Now he&#8217;s got to fight it in court. I mean, that&#8217;s what&#8217;s happening to the people who register. So yeah. Now if you do need to register, and I will say we should, you know, definitely talk about off of Amazon. But I will just say quickly, there are strategies, and we go with it, you know, to how to register, if you do need to register, there&#8217;s a way to do it. That&#8217;s better than just blindly registering in your current state. Okay, good.<\/p>\n<p>Michael Veazey 21:17<br \/>\nThat&#8217;s something for most people, I think most people that have a serious size, Amazon business have some kind of Shopify presence, not all but it is not always better and more is not better. This is just another example. I will definitely do that in in the next episode. But just just to quickly summarize when this episode is getting bit long, but I want to just kind of wrap this up with a bow bit for with a pure Amazon play. So if you are a outside us amazon seller, I presume that all these the summary of the advice that you&#8217;ve been given was not legally binding advice. But you know, generalized advice is even more true. If you&#8217;re outside the US, is that true? And you&#8217;re talking about, basically, if you register, you&#8217;re going to be on the state&#8217;s radar, and then you&#8217;re going to get hit for it. You can&#8217;t afford to pay anyway, in some cases. So what about people who are based outside of the US, such as in the UK or Australia? And does it make a difference where you&#8217;re based? That&#8217;s another question.<\/p>\n<p>Paul Rafelson 22:09<br \/>\nIt makes it different in terms of personal liability. It&#8217;s harder to go after you for personal assets and things like that if you don&#8217;t live in the United States, because the full faith and credit clause, which basically would allow the government to come in and basically collect their debt in another state, for anyone to come in and collect the debt in another state, doesn&#8217;t apply to UK does not believe in that, you know, is not subscribed to the full faith and credits clause of the United States. Right. So, you know, that&#8217;s why that&#8217;s why, you know, how do you have any clients? I haven&#8217;t we&#8217;re based in China, on tax. We have a lot of we have a lot of sellers. We have a lot of China clients for other reasons. But for tax for sales tax, zero. Nobody, nobody in China cares about this issue. You know, like I said, I fully suspect that some sellers in China probably stealing sales tax because they&#8217;re there, they&#8217;re recognizing that they&#8217;re not even tracking the tax that&#8217;s being collected. Here. You&#8217;re a foreign seller. I mean, it&#8217;s it&#8217;s the same thing. And you&#8217;re putting yourself out there, a lot of foreign sellers use us businesses, obviously, there&#8217;s a risk to potential collection actions going against those businesses, I guess Amazon payments against, you know, potential inventory liens. I mean, there&#8217;s there&#8217;s things that can happen. But they just seem that the more likely to happen. The more you participate, the more you sort of blend in the register, and put yourself out there. You know, the state basically will say, Okay, well, you just registered your LLC, but your LLC isn&#8217;t doing business for years, where have you been for four years, and so on. And it just leads to more inquiries, more bills, more notices, more fines, more stuff, that you have to hire people, like you need to, then try to get, you know, get you out of it. And as much as it would be in my own personal interest to tell you that everyone to go and register everywhere and then get all messed up and then hire me to help you get out of it. I&#8217;m, you know, generally tell you to stay out of it. I mean, it really isn&#8217;t the best idea.<\/p>\n<p>Michael Veazey 23:56<br \/>\nI don&#8217;t think there&#8217;s a problem with that. Because there&#8217;s plenty of people that I&#8217;ve come across in a couple of conferences read recently spouting the gospel of register everywhere now. So you&#8217;ve got plenty of people that other people are creating for that. So let that&#8217;s useful summary, someone my understanding of what you&#8217;re just saying is just basically, it doesn&#8217;t remove all risk. But actually the most risky move, it seems really is actually to register say, Is that a fair summary of that one?<\/p>\n<p>Paul Rafelson 24:24<br \/>\nIt is I really don&#8217;t don&#8217;t go running into this trap. And this is nothing new. I mean, I&#8217;ve been going again, very generalized advice. Very, you know, everyone&#8217;s situations are different than most considerations are different. But you know, if it were my Amazon business, I wouldn&#8217;t be registering anywhere. Yeah, that&#8217;s, that&#8217;s, that&#8217;s the reality, if I were selling my own products on Amazon, if I was, I would not be running into register right now. Because of my Amazon business. I&#8217;ll say that. So if the only person can rely on this advice is me, because I&#8217;m talking about my own Amazon business. But yeah, if I were running my own Amazon business, I would not register in any states, especially now that all these states are going to marketplace facilitator anyway. So I mean, the issue is, is a dying issue, at least sales taxes, I mean, income tax, and all these other nonsense, things are still going to have to get sorted out. But I think that&#8217;s happening. I mean, states are starting to recognize that this is unrealistic, and even a 200 transaction test, you know, people while the state&#8217;s pass these 200 transactional laws, and we&#8217;re starting to see those getting bounced back people, right, you know, states start recognize that 200 transactions is not fair. If you&#8217;re selling a $25 item, right? That means you know, you sell $25 item and you do 200 transactions exactly in every state. That means your total sales in every state that has a sales tax will be roughly $225,000 or something may not be that based on all the states that have a sales tax, somebody who does $225,000 in sales could not even come close to affording the cost of clients, it would just help. Because, you know, we do run on very thin margins on Amazon. And you know that and, you know, just because we have a million dollars in sales doesn&#8217;t mean we&#8217;re making a million dollars in income. And that&#8217;s something that&#8217;s also not understood.<\/p>\n<p>Michael Veazey 26:06<br \/>\nYeah, right. I mean, that that link between sales and taxes is a real killer because of that exact thing that you could be making minus money in terms of your cash flow, and you&#8217;d still have to pay tax that&#8217;s that&#8217;s why it&#8217;s such a crazy situation. But listen, let&#8217;s wrap up that episode there for the Amazon only sellers because I&#8217;m keen to separate out the episode for people who are off Amazon because some people aren&#8217;t and it won&#8217;t be relevant and some people are and they definitely going to want to listen up<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_023.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Ftax-nexus-with-paul-rafelson-of-ecommerce-attorneys%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-5\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_023.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9654-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_023.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_023.mp3\">Download<\/a> (Duration: 27:31 &#8212; 22.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_023.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Ftax-nexus-with-paul-rafelson-of-ecommerce-attorneys%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-6\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_023.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9654-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_023.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_023.mp3\">Download<\/a> (Duration: 27:31 &#8212; 22.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 27:31 &#8212; 22.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 27:31 &#8212; 22.6MB)Subscribe: Spotify | Email | TuneIn | RSS<\/p>\n","protected":false},"author":1,"featured_media":6828,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1550],"class_list":["post-9654","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Tax Nexus with Paul Rafelson of eCommerce Attorneys - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Tax Nexus with Paul Rafelson of eCommerce Attorneys - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 27:31 &#8212; 22.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 27:31 &#8212; 22.6MB)Subscribe: Spotify | Email | TuneIn | RSS\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-08-01T05:00:23+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-29T12:44:10+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K023-paul-rafelson-sales-tax-law-for-amazon-sellers.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"31 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Tax Nexus with Paul Rafelson of eCommerce Attorneys\",\"datePublished\":\"2019-08-01T05:00:23+00:00\",\"dateModified\":\"2020-06-29T12:44:10+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/\"},\"wordCount\":6539,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K023-paul-rafelson-sales-tax-law-for-amazon-sellers.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/\",\"url\":\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/\",\"name\":\"Tax Nexus with Paul Rafelson of eCommerce Attorneys - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K023-paul-rafelson-sales-tax-law-for-amazon-sellers.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-08-01T05:00:23+00:00\",\"dateModified\":\"2020-06-29T12:44:10+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K023-paul-rafelson-sales-tax-law-for-amazon-sellers.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K023-paul-rafelson-sales-tax-law-for-amazon-sellers.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"Tax nexus\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Tax Nexus with Paul Rafelson of eCommerce Attorneys\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Tax Nexus with Paul Rafelson of eCommerce Attorneys - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/","og_locale":"en_GB","og_type":"article","og_title":"Tax Nexus with Paul Rafelson of eCommerce Attorneys - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 27:31 &#8212; 22.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 27:31 &#8212; 22.6MB)Subscribe: Spotify | Email | TuneIn | RSS","og_url":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-08-01T05:00:23+00:00","article_modified_time":"2020-06-29T12:44:10+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K023-paul-rafelson-sales-tax-law-for-amazon-sellers.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"31 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Tax Nexus with Paul Rafelson of eCommerce Attorneys","datePublished":"2019-08-01T05:00:23+00:00","dateModified":"2020-06-29T12:44:10+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/"},"wordCount":6539,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K023-paul-rafelson-sales-tax-law-for-amazon-sellers.png?fit=1280%2C720&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/","url":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/","name":"Tax Nexus with Paul Rafelson of eCommerce Attorneys - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K023-paul-rafelson-sales-tax-law-for-amazon-sellers.png?fit=1280%2C720&ssl=1","datePublished":"2019-08-01T05:00:23+00:00","dateModified":"2020-06-29T12:44:10+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K023-paul-rafelson-sales-tax-law-for-amazon-sellers.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K023-paul-rafelson-sales-tax-law-for-amazon-sellers.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"Tax nexus"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/tax-nexus-with-paul-rafelson-of-ecommerce-attorneys\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Tax Nexus with Paul Rafelson of eCommerce Attorneys"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/08\/10K023-paul-rafelson-sales-tax-law-for-amazon-sellers.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2vI","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9654","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9654"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9654\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6828"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9654"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9654"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9654"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}