{"id":9656,"date":"2019-07-25T06:00:53","date_gmt":"2019-07-25T05:00:53","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6729"},"modified":"2020-06-28T19:46:55","modified_gmt":"2020-06-28T18:46:55","slug":"selling-on-amazon-for-retailers-with-will-tjernlund","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/","title":{"rendered":"Selling on Amazon for Retailers with Will Tjernlund"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fselling-on-amazon-for-retailers-with-will-tjernlund%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9656-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\">Download<\/a> (Duration: 31:13 &#8212; 25.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fselling-on-amazon-for-retailers-with-will-tjernlund%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9656-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\">Download<\/a> (Duration: 31:13 &#8212; 25.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><!--more--><\/p>\n<h1>Selling on Amazon for retailers with Will Tjernlund of <a href=\"https:\/\/www.goatconsulting.com\/\">Goat Consulting<\/a><\/h1>\n<h3><strong>Selling on Amazon for retailers is what you specialise in. W<\/strong><b>hat is the biggest learning from running your Amazon Agency (<a href=\"https:\/\/www.goatconsulting.com\/\">Goat Consulting<\/a>)? <\/b><\/h3>\n<p>Selling on Amazon for retailers can be a little confusing. Every retailer thinks they have a unique Amazon story. And they think they can’t solve the issues of Selling on Amazon.<\/p>\n<p>But more and more, retailers have the same issues selling on Amazon as each other.<\/p>\n<h2><b>What are the typical issues when Selling on Amazon for retailers?<\/b><\/h2>\n<p>“We’ve been selling x product for y years.”<\/p>\n<p>“We are the Apple of our niche. We have a great product.<\/p>\n<p>&#8220;We sell on the 3 stores. &#8221;<\/p>\n<p>On Selling on Amazon issues for retailers:<\/p>\n<ul>\n<li>the photos don’t line up<\/li>\n<li>People selling below MAP pricing<\/li>\n<li>What do we do? (General confusion)<\/li>\n<\/ul>\n<p>Retailers don’t know the difference between Seller Central and Vendor Central<\/p>\n<p>They don’t know how to raise a case with Amazon.<\/p>\n<h3><b>Getting organised when selling on Amazon for retailers:<\/b><\/h3>\n<p>It seems like retailers have 100 SKUs on Amazon, each with unique problems.<\/p>\n<p>In reality, you can organise the problems into 4 buckets.<\/p>\n<p>Then it can take 3 days to solve an issue that was bugging the retailers for years.<\/p>\n<p>Eg a photo issue on every single listing.<\/p>\n<p>You need to speak Amazon’s language. It’s not a big deal.<\/p>\n<h3>For retailers selling on Amazon, why get an agency involved?<\/h3>\n<p>It&#8217;s like laying tiles in a bathroom. You can lay 1, 2 or 3; but you aren’t going to want to do 50 or 100 tiles yourself.<\/p>\n<p>Goat consulting thrives by sorting out chaos, not micromanaging.<\/p>\n<p>They can’t really improve on well-optimised listings and good sales.<\/p>\n<h3><b>Solopreneurs micro-managing<\/b><\/h3>\n<p>A lot of them watch “hustle” porn &#8211; hurry up and wait!<\/p>\n<p>They feel there is nothing to do when going home from work.<\/p>\n<p>They are constantly looking for hacks. Instead of just launching more SKUs.<\/p>\n<h3><b>Over optimising a listing can be detrimental to ranking<\/b><\/h3>\n<p>Will’s company doesn’t want to mess with a good listing which is working well.<\/p>\n<p>6 months’ PPC optimization can make a difference but it takes time and data to improve on an already good listing.<\/p>\n<p>Sometimes it takes time to figure out negative keywords.<\/p>\n<p>So you need more budget and more time to figure out the perfect Keywords.<\/p>\n<p>In an ideal world, ACoS would equal profit margin &#8211; running at breakeven would get based data and best ranking.<\/p>\n<p>Especially if they are consumables.<\/p>\n<h3><b>Taking a longer view<\/b><\/h3>\n<p>Who cares if we’re not profitable for 6 months if this listing will be ranked for the next 6 years?<\/p>\n<p>There are Amazon listings that are 15 years old!<\/p>\n<p>Especially if you’re ranking for a kitchen gadget like a whisk.<\/p>\n<h3><b>When selling on Amazon for retailers, what are the best Cashflow management practices?<\/b><\/h3>\n<p>Some of these costs are just a rounding error to big companies!<\/p>\n<p>One of the companies Will consults with just got 38 containers of ONE SKU!<\/p>\n<p>Will doesn’t get into inventory management &#8211; these guys have that down pat.<\/p>\n<h2>Ideal clients<\/h2>\n<h3><b>Who are the companies that struggle to move onto Amazon?<\/b><\/h3>\n<p>Those retailers whose systems are not digitised yet struggle with selling on Amazon.<\/p>\n<p>If they can just send a dropbox link, it’s easy.<\/p>\n<p>At the other extreme, one company can’t even figure out the password!<\/p>\n<h3><b>Are there characteristics of poor clients?<\/b><\/h3>\n<p>Sometimes culture or just sour person!<\/p>\n<p>Sometimes there is a startup with funding trying to be “the new paper towel brand” trying to pay 300% ACoS and make the P &amp; L work!<\/p>\n<h3><b>How you analyse a client &#8211; common sense<\/b><\/h3>\n<p>First and foremost &#8211; check for no conflict of interest with existing clients.<\/p>\n<p>Can’t segment teams up and not talk about clients.<\/p>\n<p>Go to website straight away &#8211; check “lead bot”<\/p>\n<ul>\n<li>Does URL match the URL they say<\/li>\n<li>Look them up on Linked IN<\/li>\n<li>Look on SellerCentral\n<ul>\n<li>Do they have EBC (Enhanced Brand Content)?<\/li>\n<li>Photos &#8211; do they use all 9? Are they good?<\/li>\n<li>Competing for buy box?<\/li>\n<li>Reviews?<\/li>\n<li>Seller account?<\/li>\n<li>Seller feedback?<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>Will’s looking for outliers &#8211; not trying to judge themselves.<\/p>\n<h3><b>“Optimising for the human and the computer”<\/b><\/h3>\n<p>Optimising for the ranking is important &#8211; but then to convert to a sale, you need to optimise for a human.<\/p>\n<p>They can see price, photo, reviews and title. So it’s easy to test.<\/p>\n<p>Will has used <b>Mechanical Turk <\/b>($0.90 per survey)<\/p>\n<ul>\n<li>Name<\/li>\n<li>Age<\/li>\n<li>Do you work out?<\/li>\n<li>Do you take a protein product&gt;?<\/li>\n<li>Which photo?<\/li>\n<li>Size?<\/li>\n<li>Price?<\/li>\n<\/ul>\n<h3><b>“Blue Collar thought process”<\/b><\/h3>\n<p>You could create software &#8211; some of it just takes grunt work.<\/p>\n<p>Maybe this is the ultimate competitive advantage that Goat consulting has over more software-based approaches.<\/p>\n<h3><b>How do people get hold of Will?<\/b><\/h3>\n<p>Will@goatconsulting.com<\/p>\n<p>Or check out the site: <a href=\"https:\/\/www.goatconsulting.com\/\">www.goatconsulting.com<\/a><\/p>\n<p>For Will&#8217;s other recent interview (and notes), <a href=\"https:\/\/10kcollective.com\/competitor-analysis-on-amazon\">click here<\/a><\/p>\n<p>____________________________________________________________________<\/p>\n<h2>TRANSCRIPT<\/h2>\n<p>Michael Veazey 0:56<br \/>\nSo we&#8217;re here with Will Tjernlund and of goat consulting wheelchair and famously, former amazon seller very big time seller with his brother Andrew and vendor Central seller on Amazon as well now consultant at goatconsulting, which is an Amazon agency specializing in brand management and we&#8217;re going to talk about running an agency and the lessons you&#8217;ve learned from it. And I think, as we&#8217;ve been talking about with quite a few people who are serious Amazon sellers is no coincidence that quite a lot of the time, a lot of them end up starting an agency. So if you are considering that there may be some, some good and bad things that you may consider if you are thinking about going down that route. And also, I think there&#8217;s an awful lot of things that the world&#8217;s learned for the absolutely pure ecommerce seller, there are some useful learnings as well. So let&#8217;s let&#8217;s get started with this. You&#8217;ve learned a lot of things, obviously, from other people&#8217;s Amazon accounts, you&#8217;ve already talked about, really some of the main things about assessing competition and a lot of the brands that you&#8217;ve seen getting up on to Amazon and struggling with the business model changes and culture changes. What else have you would you say is like from the biggest picture 50,000 foot perspective, if you learned from other people&#8217;s managing other people&#8217;s Amazon accounts now?<\/p>\n<p>Will Tjernlund 2:03<br \/>\nI think mostly is that just how everyone seems that they think they have a very unique story to tell me on the kind of our first introduction call where they want to tell me about their business model and what they like what Amazon what they don&#8217;t like about Amazon, and that more and more, it tends to be kind of the same story over and over again. And so they&#8217;ll kind of pour their heart out to me thinking that they have this unique story. And that no, I no one can fix their unique problem. It&#8217;s always kind of humorous to me that it just kind of the same steps over and over again, make sure that we can solve all our problems and fix everything that we can fix.<\/p>\n<p>Michael Veazey 2:42<br \/>\nOkay, well, that begs the very obvious question, which is, how do you what are their issues then? And how do you solve them?<\/p>\n<p>Will Tjernlund 2:49<br \/>\nSo a typical call will start with me saying, Okay, tell me a little bit about kind of what your issues are. So I can figure out, see if our services line up with what your needs are. And they&#8217;ll go on say, hey, we&#8217;ve been selling x product for 50 years, where the Lamborghini of our niche, we are the best one in our, in our industry, we think we have a really good product. And we&#8217;ve just never really got a hold of Amazon, we sell on these three stores, we&#8217;ve been selling them forever, it&#8217;s really great. But with Amazon, we don&#8217;t know who&#8217;s selling our product at what price they&#8217;re selling it, we don&#8217;t have some of the photos don&#8217;t line up correctly, we got a bunch of people selling below map pricing. And we don&#8217;t even know where to get started. Can you what what do we do. And that&#8217;s basically where that&#8217;s where that&#8217;s as far as I&#8217;ve gotten. And they don&#8217;t know that what the difference between vendor Seller Central is, they don&#8217;t know how to fill out a case within Amazon. They don&#8217;t know all of these kind of very simple basic steps. And so being able to kind of take their chaos and like, calm them down and go Yep, we have no problem with that, like explain you step by step how we&#8217;d solve it. Or I can just do it for you. But I&#8217;ll it to them, it seems like they just have this crazy problem that involves that they they&#8217;re gonna have to learn how to like cope, to figure out but really, it comes down to just a lot of calling Amazon and filling out cases.<\/p>\n<p>Michael Veazey 4:18<br \/>\nYeah, okay. So yeah, I think a lot of the time, it comes down to the fact that if you don&#8217;t understand something, it seems like a total mystery, but to somebody who spends their life doing it, it&#8217;s just an absolutely normal daily event. So it comes down to hiring a specialist instead of, you know, panicking on your own or trying to sell stuff on your own right, which is just kind of obvious thing to say. But it&#8217;s amazing how many very significant size companies with decent size revenue, kind of are in denial about the fact that they don&#8217;t understand something<\/p>\n<p>Will Tjernlund 4:46<br \/>\nwhen you see a lot. Yep. And I think I feel like a lot<\/p>\n<p>of our job over and over and over becomes just organizing, just organizing things properly, where they have 100 skews, and everyone has, it seems like a unique problem, then we figure out that they&#8217;re actually in like four different buckets of problems. And then we assign them to four different employees to start filling out cases. And then two days later, all their cases have been figured out and all hundred listings have been fixed. And this problem that they have been just dealing with for years of all this different chaos of 100 listings all messed up and screwed up. It&#8217;s a three days later, it&#8217;s all solved, and it is can&#8217;t believe it<\/p>\n<p>Michael Veazey 5:25<br \/>\nwas suddenly quite an amazing results. So um, you obviously, I mean, you clearly do know what you&#8217;re doing with Amazon, as I know from talking to you many, many times. But yeah, that&#8217;s pretty amazing.<\/p>\n<p>Will Tjernlund 5:35<br \/>\nYeah, it&#8217;s things that just a bunch of simple things where it&#8217;s like, okay, these photos are off, why when I put the red t shirt, the blue t shirt show up in the photos, and like just one little problem like that on every single one of their listings that like to them it&#8217;s insurmountable. And for us, we&#8217;ve seen all these problems before and know how to talk like Amazon&#8217;s language will filling up the case to kind of get it solved as fast as possible. And for sure, there&#8217;s case that we have guys who have to call in three, four times getting resolved. But eventually, they always do get resolved.<\/p>\n<p>Michael Veazey 6:03<br \/>\nAnd that&#8217;s a reassuring reminder to everyone who is, you know, just on Amazon, even if they&#8217;re private label seller, or fairly small list or newest items in there. Generally speaking, Amazon does resolve most problems if you speak their language. And I think that&#8217;s the key. And again, if you get an account suspension, which is like the worst case scenario for everybody, in most cases, that one of the things you got to do is make sure you hire somebody who understands how to read between the lines in their language. And if you just try and do it yourself, based on no experience, or even having one experience of it, or a mate of yours had a suspension, that&#8217;s never going to compete with a consultant who&#8217;s done the same thing. 200 times, right. I mean, it sounds pretty obvious. And it sounds like I&#8217;m making a big, big sales pitch is not really that it&#8217;s just like that, you wouldn&#8217;t probably go and defend yourself in court. If you are upon a serious criminal charge. Why would you do something as critical as getting your business working on Amazon yourself? It&#8217;s this kind of disease that we have, sometimes that we have to solve stuff on your own right. And it seems to be a perennial problem for all of us, we just got to get to the point where recognize the humility is going to kick in, like, I can&#8217;t solve this on my own. But I&#8217;m sure somebody else can, right.<\/p>\n<p>Will Tjernlund 7:05<br \/>\nWe and I mean, I&#8217;m thinking of a point of view of like the example of like, someone laying like tiles in a bathroom, it&#8217;s like, Sure, I can lay a tile, I can lay two tiles, I only three. But like now as we get to scale, all of a sudden, it just seems a lot more annoying and a lot more insurmountable. And I&#8217;d rather just hired experts as the tile my whole bathroom.<\/p>\n<p>Michael Veazey 7:24<br \/>\nYeah, absolutely. And that people are very strangely resistant about this stuff. I guess it&#8217;s because there&#8217;s a lot of low trust level, because a lot of people that claim to be Amazon consultants, obviously, have been doing something for about five minutes. And then understandable. And I try and stay within my little box. I mean, a lot of the time these days, if somebody approaches me, like literally comes up to me at a conference, somebody came up to me conference the other day and said, Do you know how to solve the the I said, how you do it? I can&#8217;t remember how they got onto it. But I said, so how you doing? said yes, struggling with cash flow projections. There&#8217;s somebody you know, who knows how to do that. And I wouldn&#8217;t even dare to say that I do. But I exactly knew there&#8217;s a guy literally across the room as he Yes, I know his name, his name is actually using their mastermind around. And he&#8217;s got a genius way of predicting it. He was on the money with this last year&#8217;s predictions, which is where you know, somebody knows their stuff, because they get it right. And so I just introduced him. So yeah, I think in a in a world of low trust, where people are blowhards and, you know, overdoing the competence, you can understand that. But anyway, so yes, I think you probably want to get things done. And I think kind of just a piggyback<\/p>\n<p>Will Tjernlund 8:25<br \/>\non your comments there of like, kind of knowing where you&#8217;re not, at your best. We have people who contact us sometimes who have one skew, and we go and it just has awesome a plus content and as awesome storefront, and they did everything right, it looks optimize, all the pictures are great. And for people like that, like our services do not make sense. There&#8217;s nothing, there&#8217;s no special hack that we&#8217;re going to be able to do to double your sales, we might be able to<\/p>\n<p>increase sales, 123, maybe 4%, or something like<\/p>\n<p>that. But we&#8217;re probably just grow your account the pace that Amazon&#8217;s growing in general, it will be anything crazy. Where we kind of Thrive is currently it&#8217;s kind of more of the chaos and kind of fixing the messy problems and stuff that it actually does a big nose for different when we before and after opposed to coming in and just trying to micromanage and increase sales by 1%. Here 1% there.<\/p>\n<p>Michael Veazey 9:18<br \/>\nYeah. And that&#8217;s an interesting point it because an awful lot of people. Sorry, I&#8217;m just making it, you&#8217;re not going to want to lay 50 titles yourself, which I think is a very good point. Yeah, a lot of people have the mentality of micromanaging, like one, two or three skews. I mean, there&#8217;s sometimes if something is fairly optimized in a particular channel, if you&#8217;ve hit the limits of what you can do without going and getting a lot of extra capital, or you&#8217;ve hit your place, the market is decided where you belong in the market. And it&#8217;s the price that you may or may not like. And it&#8217;s a percentage of the market share, you may or may not like but you know, particularly if you&#8217;re done well, and you&#8217;ve you&#8217;ve got a decent share of the market that you&#8217;re ever going to get, then you&#8217;ve hit it. And the next thing to do is either more sales channels, or more skews, right, it&#8217;s kind of that simple. And a lot of people get very over complicated about this and hope for miracles when they&#8217;re trying to squeeze blood out of a stone it feels to me and it&#8217;s interesting that you sometimes get on the corporate level that thing because it&#8217;s certainly I encounter that all the time with private label sellers, that are solo printers with, you know, a few skews<\/p>\n<p>Unknown Speaker 10:12<br \/>\nwith the problem with<\/p>\n<p>Will Tjernlund 10:14<br \/>\nthe solar printers is that they came into this watching a bunch of like hustle porn thinking if they just work their butt off their grind their way to the top. And that Amazon is just a lot of Hurry up and wait, you just<\/p>\n<p>sit around do nothing a lot, that doesn&#8217;t take that much right one listing<\/p>\n<p>takes your whatever an hour. And so it&#8217;s kind of it gives them anxiety that they want to sit there and get home from work every day and like hustle on their one product. And there&#8217;s like nothing for them to do. And they check their sales figures. And they sell 13 units this week instead of 12 units. And it&#8217;s like, it drives them crazy that so they always want to find these little hacks and watch these webinars and stuff like that to try to figure out exactly how they&#8217;re going to get that one little special edge when really is like you said is launch for excuse? that&#8217;s easiest way to double your sales is have to excuse yourself one.<\/p>\n<p>Yeah,<\/p>\n<p>absolutely. And if you&#8217;re gonna do, and that&#8217;s why the social media thing to treat intriguing too, because it doesn&#8217;t cost any money. And people can sit there and fiddle away at it all day.<\/p>\n<p>So it&#8217;s all<\/p>\n<p>kind of adds up. But yeah, it&#8217;s 100%. with you. Yeah, there&#8217;s something to do after a certain amount. And I also think of it from the point of view of like, if you were ranked number one, or like number three in Google, do you really want to mess with like, your headline of like your website and like your URLs much and stuff like that, like, I&#8217;m pretty sure you want to just kind of let it chill and just kind of try to get incremental stuff by doing little stuff here and there, like, maybe adding one more extra infographic or something like that. But I wouldn&#8217;t really want to mess with the actual keyword indexing too much. Because if you&#8217;re revamping your listing every month, Amazon doesn&#8217;t really know what keywords are relevant for keep changing them.<\/p>\n<p>Michael Veazey 11:57<br \/>\nDoes a very valid point I see over optimization is great way of destroying what&#8217;s working. I mean, I suppose it&#8217;s a kind of greed, isn&#8217;t it? Because then you got suddenly this, I suppose it&#8217;s a bit like the sort of 8020 principle is not just about optimizing, but it&#8217;s about not destroying, it&#8217;s basically if you&#8217;re wanting to run a machine, or a person, if you want to train for a marathon, for example, and train for a half marathon recently, and just about to complete it. And I certainly is trained better for next one. But if I run it sort of 80% of my max heart rate, that&#8217;s called the training zone, if I go at 95%, my max heart rate, being a 45 year old guy, he&#8217;s not that fit, I&#8217;ll probably end up in hospital. And you can do the same thing with your listings. I think when people get a bit greedy and a bit too, anxiety driven, ironically, they can knock things over. And actually, Amazon is kind of a place for regression when you launch but I think all sorts of studies, you guys because the algorithm is a bit more sensitive and organic, almost like a person because it&#8217;s not official intelligence system, right doesn&#8217;t really like kind of crazy changes. It doesn&#8217;t it gets confused, almost like a person will get confused if you if you kept changing their job title every week if you&#8217;re employing them or something. Right. It&#8217;s, it&#8217;s an important point, actually.<\/p>\n<p>Will Tjernlund 13:06<br \/>\nYeah, and so that&#8217;s one that&#8217;s one thing we try not to go too crazy with where it&#8217;s explaining our services to potential clients and times where they&#8217;re like, Well, I have to meet everything set up, like what is there else to do? And it&#8217;s like, well, she gave us like three to six more months with like the PPC, we can really do a lot better job with the data over time. But like as for listing stuff, like yeah, you&#8217;re right, there isn&#8217;t like a crazy amount of stuff we&#8217;re gonna be doing, we&#8217;re going to be more focusing on like, when holidays coming up with what sales and that type of thing. But yeah, it&#8217;s, it&#8217;s a it&#8217;s a valid point on their side, where it&#8217;s like, well, what do you do? What&#8217;s the setup? It&#8217;s like, you&#8217;re right. It&#8217;s like, once we built the website, like, yeah, we won&#8217;t be doing too many SEO tweaks after it&#8217;s kind of all set up.<\/p>\n<p>Michael Veazey 13:48<br \/>\nYeah. But tell me about the on the flip side of that equation. And you were just saying give us six months with PPC optimization. And what we can probably get a lot further on. I mean, what, what does that look like?<\/p>\n<p>Will Tjernlund 14:00<br \/>\nI think we can do it a lot more transparent with the data exactly what&#8217;s working, what&#8217;s not where like, you change a couple key words here and there. And you look at like your listings ranking for different keywords and such, it&#8217;s like, kind of still a not an exact science, but like the PPC is a lot more obvious, like, Okay, this just obviously works. And so yeah, we do a couple of different things, obviously, just try to start with as many keywords as possible. And just slowly but surely narrow them down over time, but tense, we get these kind of rigid budgets, a lot of times from our clients, it takes us a while to work through the keywords and tournament and negative keywords and figure out exactly whatever&#8217;s going on. Because we usually allocate the spend of their budget too<\/p>\n<p>quickly, and don&#8217;t get to test all the keywords you want.<\/p>\n<p>Originally.<\/p>\n<p>Michael Veazey 14:45<br \/>\nYeah. So So in other words, you you need more time to test or more budget or what&#8217;s what do you think the solution to that? Both?<\/p>\n<p>Okay, the more budget or doesn&#8217;t buy us time?<\/p>\n<p>Will Tjernlund 14:56<br \/>\nYeah.<\/p>\n<p>And so if we if in a perfect world, we would have the a cost equal their exact profit margin for the first like three months. Because then we&#8217;re just going crazy on the ads vendor and trying to sell as much as possible. On top of that, we&#8217;re getting all that sales ranking, and sales Jews from kind of the honeymoon period when you first launch a product, and it just best case for everyone.<\/p>\n<p>Michael Veazey 15:21<br \/>\nYeah. Okay. So basically, it&#8217;s a class with equal profit margin. So in other words, they basically run it breakeven, as long as they could, in order to get the best ranking get the best data, right?<\/p>\n<p>Will Tjernlund 15:33<br \/>\nExactly, exactly. And especially if we have a bunch of companies that sell stuff like, say, protein powders, or different consumables and stuff like that, where you&#8217;re going to keep buying the product over and over again. So like, Who cares if you&#8217;re a cost is at breakeven, because if they become a repeat customer, then they all of a sudden become very, very profitable.<\/p>\n<p>Michael Veazey 15:56<br \/>\nMakes a lot of sense. And actually the Yeah, can you see the consumables? Again, it&#8217;s getting away from the, and again, you know, it&#8217;s funny hearing you say this about, you know, working consulting with in some cases, I know, some pretty serious companies and serious sizable established brands, because those are the classic mistakes of the the newbie, sort of private labels as well, and even more established ones that they they are very, very focused on the front end sale, and they don&#8217;t look at lifetime customer value. Now, even if you assume that you&#8217;re never going to see the consumer, again, because it&#8217;s a one off purchase. And they&#8217;ll have no brand loyalty, which, you know, there&#8217;s a fair point in that. But even if the first you know, 10,000 consumers of a product disappear enough to see you, again, the ranking juice alone is worth a hell of a lot of you projected for whatever the life cycle of the product, which is what I whatever it will be 18 months, two years these days. And I think an awful lot of people just from an extremely short term view, I guess, based on limited cash, right. But what was your view on that, because that&#8217;s obviously a critical factor.<\/p>\n<p>Will Tjernlund 16:53<br \/>\nAnd that that&#8217;s kind of my point of view is, especially with some of these companies that have some of these kind of ages, products, where it&#8217;s like, Who cares if we&#8217;re not profitable for like, six months, like, that&#8217;s really not that big of a deal, because this list is going to be ranked for the next six years, like a like, give up this for now then to be able to have that much better ranking for like, the next decade to come like there are Amazon listings that are 15 years old. That Yeah, it just can&#8217;t be thinking short term like that, especially if you&#8217;re selling, you&#8217;re actually ranked for something like a like a whatever, trying to think of like one of those kitchen gadgets that it&#8217;s like, it&#8217;s not going anywhere like a whisk or something like that. It&#8217;s like people will still use whisks in 100 years from now. So like, that&#8217;s a pretty sweet thing. If you rank on the first page for every single thing you can do conserve that<\/p>\n<p>Michael Veazey 17:42<br \/>\nhe had a guest that&#8217;s one of those things is category dependent and even product dependent. But that&#8217;s a good point. I it&#8217;s a little bit like the Warren Buffett approach to investing I mean, famously massive friends with Bill Gates of creator and you know, founder of Microsoft and CEO of that for years. And he never invested in Microsoft because he refused investing things he didn&#8217;t understand. But what the things that made Warren Buffett really rich are things that have been around forever, like Coca Cola, and Wrigley&#8217;s spearmint, gum and stuff like that, man. It&#8217;s just really old school fast stuff. So there&#8217;s, there is an argument for thinking about your product selection. But I guess if you&#8217;re an established brand, you&#8217;ve already got your products, and they&#8217;re either going to be kind of fly by night, things that will come and go and which case you don&#8217;t want to be spending too much in the first six months might be half of your sales. But if you&#8217;re selling a you know, fidget spinner or something, but if you&#8217;re selling gauging kitchen gadgets, or your consumable Yeah, exactly, um, the longer term view is always gonna be the right view. So tell me about cash flow management and your approaches. The clients approach to that, because obviously, the bigger companies can afford to take a bit of a longer view. But that&#8217;s one of the issues that comes up constantly in the difference between the people who really scale the business as well, even from scratch, and those who don&#8217;t, it seems to all come down to cash flow management. So have you got any cash flow management best practices that you see amongst your, you know, better organized corporate,<\/p>\n<p>Will Tjernlund 19:01<br \/>\nI as he has zero, they the amount of cash they have invest on Amazon inventory is a rounding error to them, they couldn&#8217;t really care less, we&#8217;re hardware companies, they just got 36 containers of one skew. So it&#8217;s Yeah, they recognize your name struck me on that train car, I just want you. And so they are kind of buying stuff and doing stuff on a different level. And that&#8217;s one of the reasons why we don&#8217;t get into inventory management with a lot of our clients who kind of just outsource it to them. Because they are buying such crazy amounts of inventory at times, and sending some to Walmart or some of the target or some here are selling it all over the world. Sometimes, we really don&#8217;t involve that because the supply chains are so complex, we just be kind of idiots, we came to be like, hey, you need to send 14 more units to soccer, like yeah, did you hear about what happened in Taiwan? It&#8217;s like, no.<\/p>\n<p>Okay, so sorry. We&#8217;ll, we&#8217;ll stay to what we know.<\/p>\n<p>Michael Veazey 19:58<br \/>\nThat&#8217;s fair enough. Now this very well, I&#8217;m not suggesting that you get into advising them. But yeah, you&#8217;re right. 38 containers is on one skew is I just beginning to try and imagine them, I think somebody is doing whether they&#8217;re all doing a container a week of you know, most of their ski or whichever skis they got to replenish. I mean, for me that accounts is one of the higher end sellers that I personally interact with, say, there&#8217;s obviously a totally different scale, which puts it in perspective, you sitting bragging to your friends about your, you know, seven figure eight figure business, I mean, like, that&#8217;s probably eight figure orders today or something. Okay, so let&#8217;s talk about and let&#8217;s, let&#8217;s zoom back out again. So tell me about the experiences you&#8217;ve had of clients that struggle versus clients that are doing well, because we talked about this before the inventory management systems they&#8217;ve got. And I guess, if you&#8217;re shipping 38 containers of one skew, you better have a good image your management system, right. But what are the other sort of things that you see where people struggle to get going on Amazon? The biggest culprits?<\/p>\n<p>Will Tjernlund 21:02<br \/>\nI think it&#8217;s basically just companies that aren&#8217;t digitized yet, that don&#8217;t have all their stuff online, don&#8217;t have all their stuff organized online, they&#8217;re the ones who struggle the most.<\/p>\n<p>So once it just kind of like,<\/p>\n<p>the second we sign up with them can just like, send us a Dropbox link, or Google Drive link, and everything&#8217;s just ready to go, we already tell that this is gonna be quick, easy, that people are gonna be able to communicate efficiently, it&#8217;s going to work really well, where we have legitimately a client that signed up with us and is paying us for the last like three weeks. And they still can&#8217;t figure out what their Amazon accounts password is. And so it&#8217;s like, it&#8217;s a legit company. But like, you can&#8217;t figure out what internally who set up the account with password and all that kind of stuff. And like you can already tell I more like more likely than not like this client will take more effort.<\/p>\n<p>Michael Veazey 21:46<br \/>\nYeah, I had one like that on a very, very different scale and the other day, and he couldn&#8217;t, he couldn&#8217;t figure out any of the passwords to anything. like Pinterest. I&#8217;m like, okay, is it gonna be hard work one. So yeah, we&#8217;ll get those. So talking of clients, and which are the clients that that, I guess is a bit more from an agency perspective, but I&#8217;m sure there&#8217;ll be learnings for ecommerce sellers, which are the clients that you find a great to work with, and which ones you find a hard work. And that being said, to know what that affects on their business, you&#8217;ve already given a few hints, the ones who aren&#8217;t digitized yet or not organized are they only are the characteristics of companies that you think may not going to work with this person. Nothing you say<\/p>\n<p>Will Tjernlund 22:25<br \/>\nthat and like random cultural fit sometimes where we just have someone who&#8217;s just kind of just sour Connect there, where there&#8217;s not happy to work with us. But for the most part, it&#8217;s fairly painless. The only other time it&#8217;s happened, where it&#8217;s like, we have a startup that has like funding and whatever, but they&#8217;re like, trying to be like the new paper towel brand. And they&#8217;re trying to, you know, say something like that, where it&#8217;s like, those are, we&#8217;ve had a couple of those that have been a struggle, where it&#8217;s like, I get that you guys are willing to pay 300% a cast to sell your paper towels, but still, you&#8217;re competing against these big name companies, and you&#8217;re shipping bars product that also is very light and cheap. And so like this is just kind of a nightmare trying to do this.<\/p>\n<p>Michael Veazey 23:07<br \/>\nBut I just have the kind of quick they set themselves a quick so I&#8217;ll take kind of goal in the first place like a ridiculous goal. And it just amazes me there&#8217;s there&#8217;s a thing I can&#8217;t probably say it without sentence that iTunes explicit but there is a site that is parallel to Kickstarter with a swear word at the start of it, which is about Kickstarter projects that should never have been funded. And you occasionally do meet them and just think, why did you get funding for this terrible idea? So those do exist. So yeah, what how do you analyze a client, then if you&#8217;re if you&#8217;re going in looking at potentially taking somebody on what&#8217;s part of your decision making process about that?<\/p>\n<p>Will Tjernlund 23:43<br \/>\nYeah, first and foremost, we want to make sure that they do not sell any like product that would conflict with one of our current clients. Since we&#8217;re running their advertising and stuff. We knew what all their competitors PPC cost per clicks were, it obviously would be a conflict of interest. We&#8217;re not quite big enough yet. Here, we could actually just like segment off one half the team to do one company one half the other, just not talking about that client. So that&#8217;s one thing we look at is kind of instantly if they compete with one of our clients. Another thing I look at is Yeah, go to their website right away. We have like a lead, like Bob that like ranks, leads coming in, and they look and see if like, the email they have matches the URL they said their website is, and a bunch of little things like that. Just kind of see how legit they are. look them up on LinkedIn, and then eventually look into their actual Amazon account and see Okay, do they have bullet points to have photos and everything? Do they have a storefront set up to the having Pam enhance brand content? Are they competing for the buy box? How many people they competing for the buy box? Is everyone price? The exact price setting price in a box? Or is everyone steak or prices? What are the reviews look like? today have a seller account where their seller reviews look like? There&#8217;s like a bunch of quick little data points that I use, just kind of click through and just kind of look just to see if I see any outliers or nothing. I&#8217;m not really judging the client too much from anything from the outside, I&#8217;m still going to get on the phone with them and have them explain to me exactly what the company is and what they&#8217;ve been up to. But I&#8217;m just looking for anything that&#8217;s crazy, where it&#8217;s like, oh, I find they have a seller account. They have 30% feedback rating. It&#8217;s like, well, what the heck, what happened here? Make sure to take a note ask them about that.<\/p>\n<p>Michael Veazey 25:21<br \/>\nYeah, that makes sense as well. So okay, so one of the things you mentioned to me we&#8217;ve been talking about this is how to optimize for human and the computer if you got a time to talk a little bit about that one. So obviously, a lot of people spend their life obsessing about the algorithm. And that&#8217;s important. But the one of the and under explored and more neglected areas is looking at how humans interact with the listing, because in the end of the day, it&#8217;s what&#8217;s going to get you a conversion. And you sorts of that for a couple of minutes.<\/p>\n<p>Will Tjernlund 25:52<br \/>\nYeah, so we are with great to optimize for the algorithm, like you said, and show up for as many pure rankings as possible. But once you&#8217;ve driven eyeballs there, it&#8217;s obviously equally if not more important to actually convert them into a sale. And so once they see your listing, either through an advertisement, or through a just organic search, there&#8217;s only a few different variables that they can see they see your price, your title of your product, your reviews, and photo of your product. And there&#8217;s not that many variables to tweak. So it&#8217;s fairly easy to kind of get down test. And so what we used in the past is Amazon&#8217;s Mechanical Turk, which is allows people to do surveys for very cheap, like 90 cents survey or something like that. And basically, we asked them, yeah, what&#8217;s your name? What&#8217;s your age? Like for their selling favorite for protein powders? Like the easy one to do? Because that&#8217;s common product. But do you work out? Do how many days a week do you live? Do you take a protein powder currently do care about taste you care about price? Which photo do you like the most? How much would you be willing to pay? What size you want to buy it in all of these kind of just kind of basic questions to figure out exactly what the human thinks on the set up the human side things until we&#8217;ve optimized for the algorithm we&#8217;ve shown over the keyword search now the customers there, we want to optimize for the human side of things and turn those eyeballs into paying customers. And that&#8217;s kind of what we&#8217;re trying to accomplish there. So we optimize the human side of things in the computer side of things<\/p>\n<p>Michael Veazey 27:22<br \/>\nmake sense? And I never heard Mechanical Turk called AI. So artificial artificial intelligence. So really speaking, it kind of looks a bit like on the surface, like you&#8217;re using some algorithm or Jungle Scout or something? Well, actually, they&#8217;re human beings behind it, just just working for crazily rubbish money per hour, unless they type incredibly fast. But yes, it&#8217;s very powerful thing, because the human element is actually at the end of it. And I think it&#8217;s just incredibly easy to forget that a conversion rate equals a human, I just think, really, going back to your business model that you&#8217;ve actually, quite interestingly, although you guys very comfortable with numbers and lots of aspects of business, you&#8217;ve chosen a business model for your agency that is very much based on, you know, human optimization in the sense that you got this panicking person saying, Our problem is unique, and we&#8217;ve got 100 different skews with 100 different problems, and you&#8217;re going Calm down, we&#8217;ll get it sorted, we&#8217;ll just turn it into four different types of problems. And then it&#8217;ll be sorted within a week. So it&#8217;s interesting to reflect that in the end, maybe your strength is that kind of human optimization, even dealing with the brand&#8217;s? Any any final thoughts on that? Because I know you gotta head off and go and continue on your day. I got another meeting coming up.<\/p>\n<p>Unknown Speaker 28:29<br \/>\nBut no, yeah, I<\/p>\n<p>Will Tjernlund 28:30<br \/>\nthink it&#8217;s, they&#8217;ve I&#8217;ve heard people say that people on like, the coast sell software, and people in the middle of the US sell physical products. And I think it&#8217;s kind of more that like blue collar just thought process where it&#8217;s like, yeah, I guess we could hire a programmer and figure out how to program the software for this very unique task we have, or they could just sit on the phone for an hour and a half, like just go home for an hour half.<\/p>\n<p>Nothing else you can do Bobby kind of thing. I think it&#8217;s just more of kind of just a<\/p>\n<p>blue collar idea that a lot of this just takes grunt work to get done. And there&#8217;s no like, fancy hack to get around it.<\/p>\n<p>Michael Veazey 29:07<br \/>\nYeah, and I guess the thing to do, as well as that there&#8217;s, in the end, if you&#8217;re prepared to optimize for the human, which other people can&#8217;t be bothered to you on the Amazon listing, and if you&#8217;re doing the same and the agency side of things, it&#8217;s a lot more competition proof because nobody can duplicate Wiltshire, England, at least not that I&#8217;ve come across, whereas somebody comes out with a competitor that looks pretty similar to the major software packages every six months is outdated, and they look like each other after a year. Right. So I think in a way doing groundwork of the right kind is kind of maybe the ultimate competitive advantage. So I certainly think you have that.<\/p>\n<p>Will Tjernlund 29:39<br \/>\nYeah, for sure. Um, that it&#8217;s we know who our competitors are in the agency world. And we try to fill this little kind of gap that no one else is willing to do. And we don&#8217;t Yeah, so yeah,<\/p>\n<p>yeah. Thanks for having me for sure.<\/p>\n<p>Michael Veazey 29:52<br \/>\nYeah, it&#8217;s been good to have you on the show. I know you&#8217;ve got another meeting to briefly how do people get ahold of you? Well, if they want to work with go consulting,<\/p>\n<p>Will Tjernlund 29:58<br \/>\nyeah, will actually consulting. com consulting. com felt a contact form. Yeah. If you have any questions, let me know for sure.<\/p>\n<p>Michael Veazey 30:06<br \/>\nGreat. Well, thank you so much for coming on sharing a desert own disk. So really fantastic, interesting content as ever, really grateful.<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fselling-on-amazon-for-retailers-with-will-tjernlund%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-5\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9656-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\">Download<\/a> (Duration: 31:13 &#8212; 25.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fselling-on-amazon-for-retailers-with-will-tjernlund%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-6\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9656-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_021-will-tjernlund-learnings-from-running-an-amazon-brand-agency_.mp3\">Download<\/a> (Duration: 31:13 &#8212; 25.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 31:13 &#8212; 25.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 31:13 &#8212; 25.6MB)Subscribe: Spotify | Email | TuneIn | RSS<\/p>\n","protected":false},"author":1,"featured_media":6730,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1550],"class_list":["post-9656","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Selling on Amazon for Retailers with Will Tjernlund - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Selling on Amazon for Retailers with Will Tjernlund - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 31:13 &#8212; 25.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 31:13 &#8212; 25.6MB)Subscribe: Spotify | Email | TuneIn | RSS\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-07-25T05:00:53+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-28T18:46:55+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K021-will-tjernlund-lessons-from-brand-agency.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"36 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Selling on Amazon for Retailers with Will Tjernlund\",\"datePublished\":\"2019-07-25T05:00:53+00:00\",\"dateModified\":\"2020-06-28T18:46:55+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/\"},\"wordCount\":7538,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K021-will-tjernlund-lessons-from-brand-agency.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/\",\"url\":\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/\",\"name\":\"Selling on Amazon for Retailers with Will Tjernlund - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K021-will-tjernlund-lessons-from-brand-agency.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-07-25T05:00:53+00:00\",\"dateModified\":\"2020-06-28T18:46:55+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K021-will-tjernlund-lessons-from-brand-agency.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K021-will-tjernlund-lessons-from-brand-agency.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"Selling on Amazon for retailers on the Amazing FBA Podcast with 10K Collective Amazon FBA Podcast\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Selling on Amazon for Retailers with Will Tjernlund\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Selling on Amazon for Retailers with Will Tjernlund - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/","og_locale":"en_GB","og_type":"article","og_title":"Selling on Amazon for Retailers with Will Tjernlund - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 31:13 &#8212; 25.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 31:13 &#8212; 25.6MB)Subscribe: Spotify | Email | TuneIn | RSS","og_url":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-07-25T05:00:53+00:00","article_modified_time":"2020-06-28T18:46:55+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K021-will-tjernlund-lessons-from-brand-agency.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"36 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Selling on Amazon for Retailers with Will Tjernlund","datePublished":"2019-07-25T05:00:53+00:00","dateModified":"2020-06-28T18:46:55+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/"},"wordCount":7538,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K021-will-tjernlund-lessons-from-brand-agency.png?fit=1280%2C720&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/","url":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/","name":"Selling on Amazon for Retailers with Will Tjernlund - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K021-will-tjernlund-lessons-from-brand-agency.png?fit=1280%2C720&ssl=1","datePublished":"2019-07-25T05:00:53+00:00","dateModified":"2020-06-28T18:46:55+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K021-will-tjernlund-lessons-from-brand-agency.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K021-will-tjernlund-lessons-from-brand-agency.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"Selling on Amazon for retailers on the Amazing FBA Podcast with 10K Collective Amazon FBA Podcast"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/selling-on-amazon-for-retailers-with-will-tjernlund\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Selling on Amazon for Retailers with Will Tjernlund"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K021-will-tjernlund-lessons-from-brand-agency.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2vK","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9656","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9656"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9656\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6730"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9656"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9656"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9656"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}