{"id":9662,"date":"2019-07-05T06:00:31","date_gmt":"2019-07-05T05:00:31","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6681"},"modified":"2020-06-29T07:56:10","modified_gmt":"2020-06-29T06:56:10","slug":"getting-quality-products-from-china-with-ash-monga-of-imex-sourcing","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/","title":{"rendered":"Getting Quality Products from China with Ash Monga of Imex Sourcing"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_015.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fgetting-quality-products-from-china-with-ash-monga-of-imex-sourcing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_015.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9662-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_015.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_015.mp3\">Download<\/a> (Duration: 33:47 &#8212; 27.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_015.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fgetting-quality-products-from-china-with-ash-monga-of-imex-sourcing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_015.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9662-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_015.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_015.mp3\">Download<\/a> (Duration: 33:47 &#8212; 27.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><!--more--><\/p>\n<h1><b>Getting Products Made in China with Ash Monga, Founder and CEO of Imex Sourcing, <\/b><\/h1>\n<p><b>What are the 2-3 most important things you think a serious e-commerce, Amazon, ebay or seller needs to consider when try to getting products from China to sell?<\/b><br \/>\n<b>Know what you want<\/b><br \/>\nMost important thing about <a href=\"https:\/\/10kcollective.com\/source-amazon-products-from-china\/\">getting Quality Products from China<\/a>: know exactly what you want.<br \/>\nSellers often pick opportunities based on JS etc.<br \/>\nYou can order a sample, check components.<br \/>\nGo to Youtube and look at production process for that product.<br \/>\nSuppliers will usually quote you for minimum possible spec, usually non compliant. Once you get into specifics, price goes up. So part of Getting Quality Products from China is clarifying specification upfront.<\/p>\n<h3><b>For product Quality from China, carry out a pre-shipment inspection<\/b><\/h3>\n<p>Another key to Getting Quality Products from China is  to carry out a pre-shipment inspection at a minimum.<br \/>\nThat&#8217;s because it is easier to fix issues while goods are in china. Negotiation power is less when they’ve gone.<br \/>\n<b>If serious seller\/good money, do due diligence on supplier<\/b><\/p>\n<h3>How do you do due diligence on Chinese Suppliers?<\/h3>\n<p>How long in business?<br \/>\nProduction capability?<br \/>\nQC processes are the key of Imex &#8211; supplier intelligence is focus now,<\/p>\n<ul>\n<li>get access to financial numbers<\/li>\n<li>See which market exporting to<\/li>\n<\/ul>\n<h3><b>DIY Supplier Due Diligence<\/b><\/h3>\n<p>There is a simple ad-hoc “supplier background check” Imex offers &#8211;<span class=\"Apple-converted-space\">  basic and advanced levels<br \/>\nThere are a lot of ad-hoc tools out there.<br \/>\nImportgenius<br \/>\nPangiva<br \/>\nAccess to customs data<\/span><\/p>\n<ul>\n<li>Which countries export to?<\/li>\n<\/ul>\n<h2><b>Ash Monga&#8217;s Background<\/b><\/h2>\n<h3><b>Tell us a bit about your background…<\/b><\/h3>\n<p>Ash Monga started with bringing in fashion accessories from china and India &#8211; ebay was the king and Amazon was bookseller.<br \/>\nBuilt a substantial business.<\/p>\n<h3><b>What made you start a sourcing company?<\/b><\/h3>\n<p>China is where the action is.<br \/>\nFirst year was meeting people, going to China<br \/>\nAbout 5 years ago, ASM, that’s when business focus changed to e-commerce.<br \/>\nNow only for e-commerce sellers.<br \/>\nHave online dashboard to allow clients to<\/p>\n<h2><b>Main Amazon Seller Needs\/main sourcing issues<\/b><\/h2>\n<h3><b>Issues with sourcing &#8211; quick outline<\/b><\/h3>\n<ul>\n<li><b>Quality<\/b><\/li>\n<li><b>Speed of response<\/b><\/li>\n<li><b>Trustworthiness<\/b>\n<ul>\n<li><b>Avoiding charlatans<\/b><\/li>\n<li><b>How do I know if the person I’m dealing with is for real?<\/b><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h2><b>QC<\/b><\/h2>\n<p><b>The biggest issue for many Amazon retailers is getting variable or mediocre quality products from China to sell. What are the most important simple things retailers can do from outside China to work on getting quality products?<\/b><br \/>\nQuality breaks into different processes<br \/>\n1. Supplier shortlisting &#8211; doing due diligence<\/p>\n<ol>\n<li>QC process &#8211; good contract defining everything agreed.\n<ol>\n<li>In Chinese if possible<\/li>\n<li>Names of components etc.<\/li>\n<li>QC checklist &#8211; act as the standard against which goods are checked<\/li>\n<\/ol>\n<\/li>\n<li>Get a sample that is 90% right\n<ol>\n<li>Retailer then goes back to supplier and say “we want this small thing changed”<\/li>\n<li>Supplier says “don’t worry we’ll sort this out”<\/li>\n<li>Often it won’t be addressed &#8211; they may<\/li>\n<li>Key is you have to approve sample BEFORE You get into bulk production<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<h3>Chinese Supplier &#8220;Quality Culture&#8221;<\/h3>\n<p>There is a deeper issue in terms of the quality<br \/>\nIn China if you’re 90% there, suppliers think you’re being fussy\/unfair.<span class=\"Apple-converted-space\">  Generally Chinese don’t complain about e.g poor service in China.<br \/>\nThere is also conflict of interest &#8211; suppliers want to maximise margin. For sellers, while margin is key, so is quality.<br \/>\nBe very upfront about quality expectations.<br \/>\nImex never just approves samples without giving client their say too. Quality is subjective.<br \/>\nBig organisations can go out and do market research to find out what customers really want.<br \/>\nIf it’s a new product, it’s harder to find this out. But there is always the<\/span><\/p>\n<h3><b>What are the key steps to increase <i>consistent<\/i> quality over time when buying products from China?<\/b><\/h3>\n<p>Work with supplier to understand process<br \/>\nimprove QC checklist<br \/>\nIf you have good process you can go from 0 to 95% in 1st order<br \/>\nThen 95-100% in next 3.<br \/>\nExample: complex product &#8211;<span class=\"Apple-converted-space\">  On 7th order, supplier just found a new supplier for one component<br \/>\nBut it invalidated the certification.<br \/>\nKeep doing inspections!<\/span><\/p>\n<h3><b>70-80 shipments &#8211; still do PSI<\/b><\/h3>\n<h2><b>Certification<\/b><\/h2>\n<p>It’s a very wide area &#8211; each product has its own compliance requirements.<br \/>\nIt varies by country and even state.<br \/>\nIn reality, it’s hard for anyone to know everything about compliance &#8211; even Imex can’t know it all.<br \/>\nA compliance professional would know this. It’s expensive &#8211; it can be difficult to hire them.<br \/>\nThe regulations are changing all the time.<br \/>\nImex has strong partnership with TUV &#8211; top testing labs. They give good guidance.<br \/>\nAlso avoid things with high compliance requirements:<\/p>\n<ul>\n<li>Things that come into contact with skin<\/li>\n<li>Baby products<\/li>\n<li>Chemicals<\/li>\n<li>Food grade plastics<\/li>\n<li>Consumer electronics with large batteries eg e-skate boards<\/li>\n<li>FDA in USA<\/li>\n<\/ul>\n<p>Small shipments &#8211; you may get away with it with customs etc.<br \/>\nThe larger the value of your shipment, the bigger your risk. Inspection happens more and you get asked for certification more. At<br \/>\nOther than the legal risk, there is a real risk to the end user. The compliance requirements are often high for good reasons based on risk assessments.<\/p>\n<h3><b>How do Imex work with TUV German company ?<\/b><\/h3>\n<p>Within compliance &#8211; you have compliance professionals who figure out compliance issues for each product<\/p>\n<ul>\n<li>Legal<\/li>\n<li>Testing labs &#8211; have equipment to test function; for chemicals &#8211; have labs everywhere<\/li>\n<li>They have experts for any given product or market<\/li>\n<\/ul>\n<p>Imex uses them for a lot of the testing they do.<br \/>\nAs Amazon enforces compliance standards more and more, they are asking sellers for certification. This could cause products to be de-listed and some of the certification could take months.<br \/>\nThere are also small labs in China that do testing &#8211; however, the certification is not always recognised in the USA or UK. This is something to be wary of.<br \/>\nSuppliers often produce certification from a small lab<\/p>\n<ul>\n<li>They are often not compliant products<\/li>\n<li>Also the certification<\/li>\n<\/ul>\n<p><b>IMEX HELP SELLERS OUTSOURCE<span class=\"Apple-converted-space\">  SOURCING, QC AND LOGISTICS<span class=\"Apple-converted-space\">  FOR<span class=\"Apple-converted-space\">  CHINA IMPORTS, SO THAT<span class=\"Apple-converted-space\">  THEY CAN FOCUS ON SCALING THEIR BUSINESSES<\/span><\/span><\/span><\/span><\/b><br \/>\n<b>Contact: <\/b><br \/>\n<a href=\"http:\/\/Imexsourcingservices.com\">Imexsourcingservices.com<\/a><br \/>\nAsh: facebook Ash Monga <a href=\"mailto:ash@Imexsourcingservices.com\">ash@Imexsourcingservices.com<\/a><br \/>\n<a href=\"https:\/\/amazingfba.com\/?post_type=10k&amp;p=6682&amp;preview=true\" target=\"_blank\" rel=\"noopener noreferrer\">For notes about how to source Amazon products from China with Ash Monga, click here<\/a><\/p>\n<h2>TRANSCRIPT<\/h2>\n<p>Michael Veazey 0:05<br \/>\nHello ladies and gentlemen, this is your host Michael vz on the 10 k collective pockets cost of a 325 episodes of The Amazing FBA podcast gotta remind myself this is a brand new podcast geared only to the needs of advanced sellers. Although those who are just still learning or learn a lot from us, I hope. Today I&#8217;m delighted to welcome somebody on the very important topic of sourcing ash monger is the founder and CEO of IMAX sourcing been working for and running IMAX for 10 years now IMAX helps sellers to outsource the sourcing QC and logistics for China import so that they can focus on scaling their businesses. So ash has a huge amount of experience a decade now of sourcing in China. So ash warm welcome to the show.<\/p>\n<p>Ash Monga 1:38<br \/>\nThank you for so much for having me, Michael, it&#8217;s really an honor to be on the show. It&#8217;s a pleasure to<\/p>\n<p>Michael Veazey 1:43<br \/>\nhave you on so we met in London when you were passing through between continents the other day. And obviously, there&#8217;s so much that can be discussed in this area. But first, let&#8217;s just we have to get through the traditional podcast cliches because people need to know who&#8217;s giving them advice or thoughts. So give us a bit of your background. What What got you started in the whole area of physical products and sourcing?<\/p>\n<p>Ash Monga 2:05<br \/>\nSure, absolutely. So I started importing from China when I was a student at a university in the UK. So as bringing in products from both India and China, and this is when Amazon used to be a bookstore, and he was the king. And so I was basically bringing in fashion jewelry and a lot of fashion accessories. And I hadn&#8217;t wholesale ecommerce website. So I did that for about four or five years, you know, paid the bills at university, and it grew into a pretty sizable business. And eventually I thought, you know, China was where all the action was, it was always in the news. I have been speaking to suppliers for a while. So I thought I might as well go to the other side of the world. And, and that&#8217;s when I decided to pack my bags and come to China and I never went back. So been here ever since. And then after coming here, you know, first year was just john researching the market, meeting suppliers attending the Canton Fair a couple of times and finally decided to set up I&#8217;m exposing and we&#8217;ve been around for about nine years now. About five years ago, when Amazon FBA really took off and a lot of courses came out especially the you know, an Amazon selling machine. That&#8217;s when our business focus really started to change towards e commerce. And gradually we positioned ourselves to be a supply chain management company only for e commerce sellers. And since then, you know, we kind of develop the offering and be able to develop an online dashboard that allows the clients to manage the product projects, the production sourcing. And and yeah, that&#8217;s that&#8217;s pretty much the gist of our business.<\/p>\n<p>Michael Veazey 3:49<br \/>\nExcellent. So China is where the action is, I like your I like the fact that you came from one continent and studying in another and then just thought that&#8217;s where the action is. And you went to yet another continent. So you&#8217;re obviously a massive prepared to follow his convictions literally all around the globe. So that&#8217;s pretty impressive. So yeah, nine years of the company, 10 years of being in China. So I guess you got some serious insight there. And interesting that you focus on on e commerce, I guess you perceived that that&#8217;s a big enough business in and of itself. So we&#8217;ll talk more about that possibly in future episodes about the differences between e commerce and other things. But let&#8217;s get to the basics then. So again, I&#8217;m going to ask a lot of questions that a lot of people ask and every mastermind and every in, but they&#8217;re the questions that need answering, I think is there the constant question. So first of all, China sourcing basics, that what do you think are the two, the three most important things you think a serious amazon seller or eBay or e commerce seller needs to consider when they&#8217;re sourcing from China, where the raw basics,<\/p>\n<p>Ash Monga 4:47<br \/>\nI would say the most important thing is to know exactly what you want as an e commerce seller. So a lot of e commerce sellers, you know, they take their products based on, you know, research tools out there, like Jungle Scout and stuff. So it&#8217;s, it&#8217;s, you know, they don&#8217;t always understand the product well. So once you&#8217;ve identified an opportunity, it&#8217;s really important to understand the basics of that product. So you can do that by ordering a sample to your place, and basically opening it up and checking out the components, you can do that by going to YouTube and watching videos in the production process for that product. But it&#8217;s very important to know exactly the specs you want. Because normally what happens in China is when you go to a supplier, they will quote you for the minimum possible spec. And normally for a product that is non compliant. And as you start being more specific about your requirements, normally the price starts to go up, because they know that they&#8217;re competing with a, you know, thousand other sellers and Alibaba. So they want to start below. So so it&#8217;s really important to know your product inside out the specs, that&#8217;s the first thing. The second thing that I would say is, if you&#8217;re not investing in quality control tool, the least you can do is carry out an inspection, you know, it&#8217;s a lot easier to fix issues while the goods are still in China wants to go there on boat. Normally, the cost of being able to send the goods back or being able to replace all the negotiating power that you have with suppliers is significantly less. So an inspection is the least you can do to kind of wait quality issues. And finally, you know, if you are a more serious seller, and if you&#8217;re investing serious amount of money, I would really do the due diligence on supplier. So it kind of amazes me that a lot of people, they get the first coat from the supplier, they get the samples in the place in order without actually doing any serious due diligence and suppliers. So you know, looking at how long they&#8217;ve been in business, what kind of production capabilities, they have an anomaly. You know, as we have gained more experience as a company, we have shifted a lot of our focus on putting in very strong QC processes. I mean, I think we&#8217;ve kind of establish our processes quite well. But focuses shifted on supplier intelligence, because we found that if we can get a lot of data on the suppliers, and now we&#8217;re able to get pretty much you know, access to even their financial numbers and stuff and see which markets they&#8217;re exporting to, and what&#8217;s their size and stuff that allows us to find suppliers that are way more likely to deliver a quality product. And as a result of that we have to spend less time effort and cost in the QC process. So we I think those would be my three main tips there.<\/p>\n<p>Michael Veazey 7:33<br \/>\nOkay, great. Well, we&#8217;re already getting into some detail here, because this goes well beyond the usual tips. So know what you want. I mean, that sounds, this is a really critical question that a lot of people I think, when they start a business, just in the most general sense, don&#8217;t know what they want. They got a vague idea. They want to make money, but that&#8217;s kind of too general. And yeah, I like the idea of looking on YouTube for production prices for that product, it sounds really obvious, I&#8217;m ashamed to say I&#8217;ve never done that. So that&#8217;s a very quick, easy tip, carrying out inspection. Absolutely. But the other thing is even more important before you even get into inspecting some that&#8217;s already been made to in doing due diligence on a supplier. So obviously, you&#8217;ve got some fantastic abilities to do supplier intelligence now. And I can see the value in that, especially anyone who&#8217;s saw some Charlie from work and see the value of getting true quality in a sea of mediocrity. Tell us a little bit if you&#8217;re not based in China, what are the best ways to do that for yourself to try and get some due diligence done.<\/p>\n<p>Ash Monga 8:33<br \/>\nSome, if you&#8217;re doing it for yourself, there are ways, you know, we actually have a very simple ad hoc service, which is not really part of the whole supply chain service, which is called, you know, supplier background check or company verification service. And we have like basic and advanced level service, wherein we kind of do that research and hand it over to our clients. And then they can deal with the suppliers themselves. So that&#8217;s one option. The other option is there&#8217;s a lot of ad hoc tools out there, for example, you know, there are websites where you can get access to customers data. So you can see which countries is a virus of exporting to, you know, how many shipments they&#8217;ve done. So that kind of gives you an idea of this scale? Yeah, that&#8217;s a couple of things. You could try.<\/p>\n<p>Michael Veazey 9:20<br \/>\nOkay, and if you got new things, is that sort of import genius? Things like that?<\/p>\n<p>Ash Monga 9:24<br \/>\nYeah, exactly. So those are, there&#8217;s another one called punchy Vassar, there&#8217;s quite a few websites out there.<\/p>\n<p>Michael Veazey 9:30<br \/>\nImport genius and panty are okay, there&#8217;s always going to be somebody right writing down the numbers that will By the way, folks, if you&#8217;re listening, we&#8217;ll put somewhere in the podcast will put the number of the podcast and you&#8217;ll be able to get the show notes from that as well. So listen out for that, and then you can get some very detailed show notes will be taking, okay, so you can do a bit of it yourself, using punchy volume for genius. There&#8217;s also your IMAX thing itself. Okay, it makes a lot of sense. So there&#8217;s some basics. Now let&#8217;s show let&#8217;s plunge into some other the the main issues that I keep hearing come up again and again, with myself friends over the years, which is quality, speed, and the whole kind of question if trustworthiness, whatever that means there&#8217;s a lot of different areas that are but let&#8217;s talk about quality. First, the biggest issue for many amateur retailers is variable or simply mediocre quality. So we&#8217;ve already touched on this, but what do you think the other things are that people can do to from outside China to improve on those?<\/p>\n<p>Ash Monga 10:29<br \/>\nIn terms of quality, I think, you know, it&#8217;s, and I&#8217;d like to kind of break it into different processes. So it&#8217;s your supplier shortlisting process where you want to spend your time and due diligence and stuff, then once you finalize your supplier, it&#8217;s more about putting a solid QC process in place. So that starts with having a good contract that defines everything you&#8217;ve agreed in Chinese, if possible, because English contracts have less value in China, both as a legal tool and as a negotiating tool. You want to put down every single thing that&#8217;s been agreed the names of components and stuff like that. Once you&#8217;ve done that, you know, again, you want to have a really good QC checklist that would kind of act as the as the standard against which codes are checked. And finally, I think, yeah, one, one very common mistake I see people make is, they will get a sample, that would be 90%, right, and then go back to supply say, you know, we love the sample, everything is good. But we would like this small thing changed. And the supply would normally come back with the hate not a worry, when we get into production will change this and will be all good. And when the ball production comes out, that thing is not addressed. So the supplier hasn&#8217;t been able to address it to a level that the client expected. So the key there is you have to approve the sample before you get into ball production. And, and then your expectation from the supplier should be to deliver bulk production that matches that sample. So if there&#8217;s anything you&#8217;re not happy with, it&#8217;s better to do another round of sampling and spend another two, three weeks, then kind of just have a verbal agreement and get into production, because a lot of the times that issue exists because the supplier might not have the production capability to address that issue. You know, they might need a very specific machine tooling, and maybe they&#8217;re just not able to address that issue. So it&#8217;s really important to approve the sample as you expect to see it before getting into production.<\/p>\n<p>Michael Veazey 12:31<br \/>\nYeah, that makes sense. I mean, it&#8217;s it comes out to a lot of things in China, which is, I don&#8217;t know why you can speak to this. But I get the feeling that as a couple of cultural things. One is good enough is good enough for the Chinese suppliers, but it isn&#8217;t for Amazon consumers. And the other thing is that they&#8217;re not going to add extra expense or go to the trouble of creating a wonderful products unless you push them to do it, because they&#8217;re so driven by price. Whereas we got more of a concept of quality and our heads, would you think that&#8217;s a fair summary or top? Tell me a bit more about<\/p>\n<p>Ash Monga 12:59<br \/>\nthat? Actually, I think you&#8217;ve nailed it, both those points are very valid. The first point, I think it&#8217;s, there&#8217;s a deeper issue here in terms of the culture because in China, people generally are very accommodating. And, you know, they don&#8217;t generally people don&#8217;t complain about small issues here. Even you go to restaurants, you get poor service, you know, if you are from the west, you you would normally want to express your opinion about that service in China, people are very flexible, and they&#8217;re very okay with that. So that&#8217;s that&#8217;s the first point that definitely, you know, if you&#8217;re 90%, where people are normally happy, and suppliers think that you&#8217;re being too fussy if you want to go from 9200. So that&#8217;s one common challenge that we&#8217;re constantly training our team to deal with, you know, where supplies come back to us. And they think the clients being too fussy and unfair, the product is pretty good as it is. Where as the second issue that you mentioned, is more about the conflict of interest, you know, suppliers, in most cases are thinking short term, and they&#8217;re praying objective is to maximize their margin. Whereas for a client, it&#8217;s obviously, I mean, margin is a key objective, but it&#8217;s also about getting a quality product out there, because consumers in the West have high expectations, being very upfront with the supplier about the quality expectations. That&#8217;s why it&#8217;s very important to put this on paper. Because, you know, even with us, when we get samples in office, we never proved them. And we have a first round of approval, but the client has to approve them. Because what is good quality is also a very subjective issue, you know, what is good quality for one person could not be good quality of someone else? Or are we looking at the same sample, but what is a quality issue for me could be non issue for you, and vice versa. So, so it&#8217;s really important that you approve a sample based on your standards.<\/p>\n<p>Michael Veazey 14:47<br \/>\nYeah, I think quality is subjective. I think you&#8217;re right. And I think that it goes together with creating, I think a strong brand. And what is it that your brand is really amazing at for example, if you&#8217;ve got something that needs to look fantastic, is going to be worn for season in the fashion industry, then what quality is about appearance, I guess. Whereas if there&#8217;s something very ugly, but functional, like had no doorstep, to walk to top to walk on to a car or something to get up into a car or something, I guess then function is more important beauty so that those things are a bit subjective, aren&#8217;t they and I think that&#8217;s the kind of decision that a wise retailer makes when they are considering where to spend money and also where to save money. Because as you said, margins important. And I think that goes even deeper, I think you know, if you really understand your customer, the end user, then you need to know what they think is quality. And then you need to engineer that into your products and and push that back through the supply chain. So I think often the problem that people have is that they don&#8217;t really know what their customers think of is quality, therefore they have no really valid way of defining quality when it&#8217;s getting a bit deeper, really. But that&#8217;s not just a sourcing issue. I think it&#8217;s as you said, it comes down to knowing what you want, in the true sense, really.<\/p>\n<p>Ash Monga 15:58<br \/>\nYeah. And I think that&#8217;s where you know, big a bigger organizations have been bit of an advantage where they could go out and do market research, and really know what a what is great quality for customers for Amazon sellers. If the product already exists in the market, they can look at reviews of the competitors and stuff and see areas where quality can be improved. But if it&#8217;s a brand new product that doesn&#8217;t exist on the platform, then it&#8217;s very much subjective. And you know, based on what they think is good quality.<\/p>\n<p>Michael Veazey 16:28<br \/>\nYeah, the only thing I would say about that, and I&#8217;ve got a client going through this, and by the way, he&#8217;s not a sophisticated amazon seller. He&#8217;s He&#8217;s brand new to the game. But he&#8217;s simply I&#8217;m not going to reveal for his sake what the product is. But he&#8217;s he&#8217;s in something in this sort of construction, trade. He&#8217;s got friends who do that. And he&#8217;s got something that isn&#8217;t working very well. It&#8217;s got a 2.5 star average on Amazon. And yes, he&#8217;s got rave reviews. But he&#8217;s on my suggestion, given them samples of that and asked him for very detailed feedback and is working with an industrial designer to create a product. And we&#8217;ll talk about that as well creating unique products a whole different, but he&#8217;s trying to create the problem that solves those problems. So although he doesn&#8217;t have access to big market research, he does have access to end users, which could be yourself right? So I was thinking there&#8217;s something very important about some simple pragmatic testing where products by people who are can actually use it, that is always possible. We know that&#8217;s that we don&#8217;t always have to make this a very complex process, right? If you&#8217;re trying to use a step ladder in it, and it breaks when you use it, then it&#8217;s obviously not good quality. And that&#8217;s not a good example, because you wouldn&#8217;t normally sell step by step ladders. But you know what I mean, if you got a pen and the ink runs out, or it sort of runs out after two days, or its matches, or it breaks and bus on your pocket, that&#8217;s the sort of thing you can find by using it,<\/p>\n<p>Ash Monga 17:40<br \/>\nI guess, no absolutely makes complete sense. There&#8217;s always ways to get feedback. And the more feedback you can get, the better your requirements spec would be. And then the supplier is actually in a better position to deliver what you want.<\/p>\n<p>Michael Veazey 17:53<br \/>\nExactly. I think there was a lot of things in life when you&#8217;re outsourcing things. And there&#8217;s no unless you have a factory in your garden, there&#8217;s no way you can unlock outsource the manufacturing side of things, it&#8217;s very easy to blame the person you outsourcing to ensure they may be partly at fault. But I was thinking that it&#8217;s a lack of clarity, that from ourselves and our lack of management of disciplines, that often creates the problem that can be to the photographer who produces random photos, because we haven&#8217;t given them a brief packaging designer that produces packaging that isn&#8217;t suitable because we haven&#8217;t thought it through and, and so forth. But anyway, so I&#8217;m trying to turn these back on the seller here as much as I can, because that&#8217;s where we have control, right, blaming the rest of the universe is rather disempowering. So what other things can we do is as the seller then to increase consistent quality, you&#8217;ve talked about the basics at the beginning, how do we ensure that keeps going over the course of say several, several orders several boatloads? containerized rather,<\/p>\n<p>Ash Monga 18:46<br \/>\nyeah, I think it&#8217;s about, you know, also refining your process. So as you work with the factory, and you get feedback on how they work, and how they communicate, you have to constantly keep upgrading your process and your checks. So this includes improving your QC checklists, over time improving your contracts, as you get new feedback or issues, you know, setting better communication mechanisms. And then Normally, I find, if you have really good process, you can go from zero to 95% in the first order, and you can go from 95 200, in three orders at the most. And then after that, it&#8217;s more about maintaining the quality standards. And this is where, you know, the complexity of the product comes in, because we&#8217;ve had some fairly complex products with a lot of components and moving parts. And we found that on the seventh order, the supplier just all of a sudden decided to change the component because the components of buyer was out of stock, but they were able to get that component make the dollar cheaper. But what the supplier didn&#8217;t realize was they were invalidating all the certifications for that product by doing that, because the certifications kind of lyst how the components and stuff. So that&#8217;s that&#8217;s the ongoing QC, you know, ensuring that the suppliers are using the same component. And again, in terms of ongoing QC, the least you can do it do is continue doing the inspections. You know, that&#8217;s one thing I&#8217;ve learned in China, we have suppliers we&#8217;ve done 7080 shipments with and we still do a pre shipment inspection every single order.<\/p>\n<p>Michael Veazey 20:16<br \/>\nWow. Okay, yeah, that ties and that&#8217;s a consistent theme for anyone who knows about sourcing from China. I remember speaking to Kevin King about more to three years ago now on the podcast and the amazing FBA podcast. He said never ever ever shipped anything from China that inspecting so that ties in I mean, that&#8217;s, I guess what you&#8217;re saying is they have a culture, which in a way, I think a lot of the supply culture ironically ties in with the entrepreneurial culture that a lot of Amazon sellers, who is more sellers trying to grow fast have which is cutting corners is not a big deal. But the trouble is you interacting with the West&#8217;s safety, safety certification, and legal issues. So actually, in a sense, the problem is created by a mismatch between not between sellers and the suppliers, were all quite pragmatic, just going to get a product out there that the customers like really definitely, and is safe. But between that and the legal requirements of the West. So I guess that&#8217;s talk, let&#8217;s talk about certification a bit, because that is an area that is obviously pretty vital, and can get very technical. And I know that it&#8217;s very product specific. So how long is a piece of string, but give us some basics, or some examples of how to go about that if you&#8217;re entering a new area?<\/p>\n<p>Ash Monga 21:26<br \/>\nSo I think this is a really tricky one, because certifications are I mean, it&#8217;s it&#8217;s a, I mean, firstly, it&#8217;s a very wide area, because each product has its own compliance requirements. And and, you know, firstly, it varies by country, and sometimes even by states within the country. And then there are product categories. And then depending on the components being used, there are requirements and, and in reality, you know, it&#8217;s very difficult for anyone to know everything about compliance, even we, for example, when it kinds come to us really, can you ensure that this would be compliant to the US standards for this product. And normally, we tell them, that we can ensure it compared to the standards that you set for this product. But we don&#8217;t know all the standards, because that&#8217;s something that a compliance professional would know. And that&#8217;s a separate field. Or together, there are people who spend the entire day reading the new regulation. And what makes it even more tricky is the regulations are changing and updating all the time. So there are people who are dedicating themselves to this, it&#8217;s expensive, you know, when you&#8217;re starting out, it can be difficult to hire them. But then still, there&#8217;s a lot you can do in terms of one of the things that we have done is, we actually have a very strong strategic partnership with you, we now which is one of the top three testing labs in the world. So so we&#8217;re actually able to get a lot of compliance related info from them, in terms of what certificates immediate for which market course you can go online and do your research. Again, it requires a lot of reading, reading, you know, boring technical legal stuff. So a lot of people don&#8217;t really enjoy that part of it. And they tend to kind of skim over it. But try normally what I have found in terms of compliance is, the larger the value of your shipments, the bigger the risk. Yeah. So when you&#8217;re doing smaller shipments, you will normally get away with it. Because, you know, from the point of view of the customs and stuff, the recovery won&#8217;t be significant enough. But as you start scaling up, we&#8217;ve seen with own clients, that you get inspected more, or you get asked for certifications more. And at that point, you have to kind of professionalize the process and basically get professionals on board, or avoid products that have very high compliance requirements. Yeah, like baby products and stuff that comes in touch with your skin, or anything that could cause a health risk. Okay, so just<\/p>\n<p>Michael Veazey 23:55<br \/>\nthat I mean, a lot of people be listening to this thinking, God, this sounds horrendous if they&#8217;re just starting out, or even people who&#8217;ve been around for a while. So just give me a bit of a list of things that are going to be more high compliance requirements, you mentioned baby products, and anything that comes into contact with your skin, any other things that occurred to you.<\/p>\n<p>Ash Monga 24:13<br \/>\nSo yeah, I mean, those two plus, you have, you know, products with the potential to have chemicals in them, products that are like food grade plastics, consumer electronics with large batteries, you know, like escape boards and stuff like that. These products tend to be a little bit more sensitive in general, make sense? Anything that comes under the FDA in the US would be something you want to watch out for us. But yeah, so that&#8217;s the Food and Drug Administration. Right? Yeah. So<\/p>\n<p>Michael Veazey 24:44<br \/>\nthank you. That&#8217;s, that&#8217;s a very sensible list. So I suppose you&#8217;ve got a few options, which is, number one, especially for those who are new, or who are more comfortable with marketing them with the sourcing side, which is a lot of people like myself included. But first of all, avoid things like the ones you just said. And again, we&#8217;ll put the list in the show notes will, will put that at the beginning and end the podcast, folks, if you want to check this out. So a lot of detail in the realm of sourcing, right. The second thing is, if you&#8217;re doing small shipments, you could get away with it. And the third thing is, big shipments desk, don&#8217;t risk it and absolutely true. And that the sellers, I know the shipping by the container load every so often they get it inspected. And they have to pay for the privilege as well, if it&#8217;s the US Customs, so guess what, I don&#8217;t see that being any less either with the trade wars potentially heating up, which we&#8217;ll talk about at another point. But I do agree that it&#8217;s not worth the risk when you got a big amount of stuff. But TV sounds like it could be the the answer. How do you guys collaborate with TV? If you have got so then it requires some certification or compliance?<\/p>\n<p>Ash Monga 25:42<br \/>\nSure. So before I get into that, I do want to correct myself, I wouldn&#8217;t say that you will get away with it. If it&#8217;s a smaller shipment, you may get away with it. Yeah.<\/p>\n<p>Michael Veazey 25:51<br \/>\nYeah. Okay. Fair enough. Yeah. leak legal cover that. Yeah, that&#8217;s true. mean, nothing is guaranteed, obviously. And yeah, I mean, you want to be asked about client is possible. And, you know, my suggestion would be to avoid those product categories. If you&#8217;re just starting out? Yeah. Because, you know, other than the legal risk of getting inspected and stuff, the reason why they have all these requirements is because there is a real risk to the end user. And that&#8217;s, that&#8217;s the most serious issue. So you want to avoid that as much as possible. Absolutely. And, you know, sometimes we feel that the compliance requirements are extremely high in certain markets, like the US and UK, for the same products are being used in other markets with much lower requirements, and people are doing fine. But the fact is, you know, it&#8217;s very important to respect the local regulations, and recognize that the regulations are based on certain risk assessments that they have carried out, and and you want to avoid that risk as much as possible. Absolutely. I mean, de risking your business. I think, given that this is a podcast for for people who are serious about building a proper business, that de risking your business, I think, is an incredibly wide topic, which we talked about in the 10 k collective, a million pound masterminds that I run with, with sellers that are doing anywhere between half a million and several million pounds a year in turnover, mostly on Amazon, sometimes their own e commerce stores as well. But I think that&#8217;s a big, big topic, but de risking or supply chain, I think is extremely important. Because if you have something valuable, that&#8217;s worth defending, that&#8217;s worth, you know, serious money and you&#8217;re planning to sell it, then you really do not want to be giving yourself some massive Achilles heel, whereas if something got inspected, your entire product chain will be pulled from the shelves, and you get sued or worse. So I agree 100%, that we need to become more professional about these things. And yeah, or avoid them, but the middle ground where we fudge it is probably not wise place to live. So tell me more about this the TV because obviously that that is one of the solutions. What is TV says one of the third biggest compliance or the top three compliance companies, how does that work?<\/p>\n<p>Ash Monga 27:54<br \/>\nSo within the compliance fair, you have a compliance professionals stages specialize in basically helping you figure out what the compliance requirements are for any given product. You also have legal experts that also compliance professional from a legal perspective, but these guys can also be people working at smaller testing labs, then you have the testing labs themselves that have the equipment to transfer all kinds of things, you know, certain chemicals, function tests, and products and stuff. So to you is one of those labs, they have labs all over the world. They&#8217;re a German company. And basically, they have in terms of testing, but they also have experts in different areas who can advise us in terms of what the compliance requirements are for any given product and market, because we use them for a lot of the testing that we do to kind of develop this relationship where we have access to a lot of the knowledge that exists within the company and the expert. So So, you know, we use that as a key resource in understanding compliance requirements for product.<\/p>\n<p>Michael Veazey 29:01<br \/>\nExcellent. Yeah. And TV. Okay. Yeah, I used to, I lived in Germany for a couple of different years in my 20s. And so tooth is actually the, it&#8217;s like an mot in Britain. So it&#8217;s actually that they are so widespread that even test British I&#8217;m sorry, German car. So yeah, it&#8217;s a very, very internationally known and very long established company, as well as now. And when it comes to Christian, we can&#8217;t fault the Germans. I mean, they are the most precise people I&#8217;ve ever met in my life. So having lived out there, so I think that if you&#8217;re going to trust the German to be precise, that they&#8217;re going to do the job for you. But also, I think the other thing to bear in mind again, before we move on to this topic, the last thing to say is, it&#8217;s obviously scary to people, it&#8217;s obviously complex. But those are two great barriers to entry. If you&#8217;re again, if you&#8217;re serious about building a defensible business, if everybody&#8217;s you know, doing ASM 15,000, or whatever it is, that&#8217;s come out recently, and and all the podcast my my own included that amazing FBA podcast for beginners, then it&#8217;s a very good idea to have some barriers to entry and very good compliance testing being needed is I would argue one of those. So if you&#8217;re brave and professional combination, then I think this is potentially an opportunity around, I just think there&#8217;s always an opportunity to the other side of pain. Because if everyone else is too afraid to do it, or doesn&#8217;t do it properly, and you do, then you win.<\/p>\n<p>Ash Monga 30:19<br \/>\nAbsolutely. And, you know, there&#8217;s two more points that I want to add there. Firstly, you know, Amazon, I think one of the big priorities going into the future would be enforcing these compliance standards. So more and more sellers we all be seeing are being asked for the certification. So it&#8217;s not just something that is nice to have, and would give you a competitive advantage, I could potentially become a major risk if you don&#8217;t, if you cannot produce the certification when requested, because your products could be delisted. And it could take I mean, some of these certifications could take months, you know, could take months to get so so ideally, you want to be prepared. The second thing I was going to say is there&#8217;s a lot have small labs in China that also do testing and they tend to be a lot cheaper than the international labs. However, these certifications are not always recognized in the US or UK. We have seen the HMC in the UK, for example, rejecting certifications issued by Chinese labs, because they just didn&#8217;t recognize the lab. So So that&#8217;s something to be careful of a lot of people when they go to supply supplies produce the certificates given by small Chinese labs. And in most cases, firstly, the labs will not be recognized. And in most cases, those products are not compliant either because you can get a certificate with a compliant product and still produce a non compliant product in mass production. So So having this certificate and ensuring that your product is actually compliant are also two different challenges altogether.<\/p>\n<p>Michael Veazey 31:49<br \/>\nThank you. So yeah, I like what you&#8217;re saying as well. So you a bit of a reality check that this is not just a nice to have thing, but it&#8217;s actually a must have Although, I would still argue if for example, you there are there I suppose three options. Number one is your amateur supplier baby products with no certification, you get asked for your certification by Amazon is not acceptable. They d lyst. You option two is you stay away from baby products because you&#8217;re scared and option three as you do professionally and properly and stay ahead of the competition. So I still think in a sense, it&#8217;s a competitive advantage. But I take your point that it&#8217;s also if you if you don&#8217;t have certification folks on one of those types of products, food grade plastics, chemicals, baby products, anything and it comes in contact with skin, food grade plastic, that&#8217;s very common. A lot of people sell things like that because you met electronics like batteries as less common, then you probably want to be looking at certification quite soon or possibly considering moving out of the product of the numbers no longer work. So thank you. That&#8217;s that&#8217;s a bit of a sobering but important reality check.<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_015.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fgetting-quality-products-from-china-with-ash-monga-of-imex-sourcing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-5\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_015.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9662-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_015.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_015.mp3\">Download<\/a> (Duration: 33:47 &#8212; 27.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_015.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fgetting-quality-products-from-china-with-ash-monga-of-imex-sourcing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-6\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_015.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9662-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_015.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_015.mp3\">Download<\/a> (Duration: 33:47 &#8212; 27.6MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 33:47 &#8212; 27.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 33:47 &#8212; 27.6MB)Subscribe: Spotify | Email | TuneIn | RSS<\/p>\n","protected":false},"author":1,"featured_media":6705,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1550],"class_list":["post-9662","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Getting Quality Products from China with Ash Monga of Imex Sourcing - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Getting Quality Products from China with Ash Monga of Imex Sourcing - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 33:47 &#8212; 27.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 33:47 &#8212; 27.6MB)Subscribe: Spotify | Email | TuneIn | RSS\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-07-05T05:00:31+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-29T06:56:10+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K015-ash-monga-getting-quality-products.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"37 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Getting Quality Products from China with Ash Monga of Imex Sourcing\",\"datePublished\":\"2019-07-05T05:00:31+00:00\",\"dateModified\":\"2020-06-29T06:56:10+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/\"},\"wordCount\":7661,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K015-ash-monga-getting-quality-products.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/\",\"url\":\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/\",\"name\":\"Getting Quality Products from China with Ash Monga of Imex Sourcing - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K015-ash-monga-getting-quality-products.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-07-05T05:00:31+00:00\",\"dateModified\":\"2020-06-29T06:56:10+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K015-ash-monga-getting-quality-products.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K015-ash-monga-getting-quality-products.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"Getting Quality Products from China for Amazon Sellers with Ash Monga on the 10K Collective Podcast with Amazing FBA Podcast\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Getting Quality Products from China with Ash Monga of Imex Sourcing\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Getting Quality Products from China with Ash Monga of Imex Sourcing - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/","og_locale":"en_GB","og_type":"article","og_title":"Getting Quality Products from China with Ash Monga of Imex Sourcing - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 33:47 &#8212; 27.6MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 33:47 &#8212; 27.6MB)Subscribe: Spotify | Email | TuneIn | RSS","og_url":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-07-05T05:00:31+00:00","article_modified_time":"2020-06-29T06:56:10+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K015-ash-monga-getting-quality-products.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"37 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Getting Quality Products from China with Ash Monga of Imex Sourcing","datePublished":"2019-07-05T05:00:31+00:00","dateModified":"2020-06-29T06:56:10+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/"},"wordCount":7661,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K015-ash-monga-getting-quality-products.png?fit=1280%2C720&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/","url":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/","name":"Getting Quality Products from China with Ash Monga of Imex Sourcing - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K015-ash-monga-getting-quality-products.png?fit=1280%2C720&ssl=1","datePublished":"2019-07-05T05:00:31+00:00","dateModified":"2020-06-29T06:56:10+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K015-ash-monga-getting-quality-products.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K015-ash-monga-getting-quality-products.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"Getting Quality Products from China for Amazon Sellers with Ash Monga on the 10K Collective Podcast with Amazing FBA Podcast"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/getting-quality-products-from-china-with-ash-monga-of-imex-sourcing\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Getting Quality Products from China with Ash Monga of Imex Sourcing"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/07\/10K015-ash-monga-getting-quality-products.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2vQ","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9662","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9662"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9662\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6705"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9662"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9662"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9662"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}