{"id":9667,"date":"2019-06-24T06:00:57","date_gmt":"2019-06-24T05:00:57","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6622"},"modified":"2020-06-29T08:26:29","modified_gmt":"2020-06-29T07:26:29","slug":"outsource-for-e-commerce-with-aaron-osullivan","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/","title":{"rendered":"Outsource for e-Commerce with Aaron O’Sullivan"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_010-arron-pt2.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Foutsource-for-e-commerce-with-aaron-osullivan%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_010-arron-pt2.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9667-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_010-arron-pt2.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_010-arron-pt2.mp3\">Download<\/a> (Duration: 30:12 &#8212; 20.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_010-arron-pt2.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Foutsource-for-e-commerce-with-aaron-osullivan%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_010-arron-pt2.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9667-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_010-arron-pt2.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_010-arron-pt2.mp3\">Download<\/a> (Duration: 30:12 &#8212; 20.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><!--more--><\/p>\n<h1>Outsource for e-Commerce<\/h1>\n<h2><b>Personal assistant (in person)vs. Virtual assistant  when you outsource ecommerce <\/b><\/h2>\n<p>Where you outsource for e-commerce depends on where you’re based!<br \/>\nAnd Depends on your situation.<br \/>\nOutsource to someone part-time to start &#8211; depending on your profit level.<br \/>\nIf based in UK, USA, when you outsource for e-commerce, you need to consider:<\/p>\n<ul>\n<li>Local (can connect virtually)<\/li>\n<li>Virtually you can hire amazing people<\/li>\n<\/ul>\n<p>Book keeping can all be done virtually<\/p>\n<h3><b>Outsource for e-commerce vs. Inhouse?<\/b><\/h3>\n<p>Having a company that can scale with you is important<br \/>\nIf work with one person, and business trebles, that’s easier.<br \/>\nEg book keeping<br \/>\nYou just need delivery of specific reports, on time each month, accurate<\/p>\n<h3><b>To outsource e-commerce, a clear outcome is critical<\/b><\/h3>\n<p>Having a clear outcome is critical.<br \/>\nAnd clearly explained is critical.<br \/>\nMonthly strategic call &#8211; what do they see in the numbers.<\/p>\n<h2><b>What to do with the time you gain when you learn how to outsource:<\/b><\/h2>\n<ul>\n<li>Product creation\/Launch\n<ul>\n<li>Min. $10K\/mo per launch &#8211; $3k net\/mo =36kpa<\/li>\n<\/ul>\n<\/li>\n<li>New Amazon marketplaces\n<ul>\n<li>International expansion<\/li>\n<\/ul>\n<\/li>\n<li>Building a brand\n<ul>\n<li>Getting off Amazon &#8211; don’t have all the eggs in that basket<\/li>\n<li>Messenger bot<\/li>\n<li>Building a database of customers<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h2><b>It’s so important now to build an audience round a product line that makes a meaningful difference<\/b><\/h2>\n<p>It helps determine the multiple<br \/>\nIf amazon only source of revenue lowers multiple if selling business<br \/>\nClear systems in place &#8211; how to do the task<br \/>\nHaving assets away<\/p>\n<h3><b>What Aaron offers?<\/b><\/h3>\n<p><b>Next steps?<\/b><br \/>\n<b>Free training in how to create a Product Launch Machine<\/b><\/p>\n<p class=\"p5\"><a href=\"http:\/\/amazingfba.com\/blueprint\">amazingfba.com\/blueprint<\/a><br \/>\nOne of the biggest systems to set up is launching a new product.<br \/>\nThis is to set up a well oiled launch machine<br \/>\nCome up with ideas, oversee and coach but not do all the steps yourself.<\/p>\n<h3 class=\"p6\"><span class=\"s1\"><b>If you want to Contact Aaron to see how he can help you outsource e-commerce:<\/b><\/span><\/h3>\n<p class=\"p6\"><span class=\"s1\"><b><\/b><a href=\"https:\/\/systemscultureimpact.com\/contact\/\">https:\/\/systemscultureimpact.com\/contact\/<\/a><br \/>\n<\/span><br \/>\nCan book in a call<br \/>\nSome people remove 40 hours a week from plate<br \/>\nWhat do they spend that time on now?<\/p>\n<h3><b>For high 6-7 figure e-commerce sellers,  what they do with time saved by outsourcing:<\/b><\/h3>\n<p>Already have SOPs &#8211;<br \/>\nhand them a filing cabinet<br \/>\nPersonalise SOPs to their biz<br \/>\nRun it for them for 3 to 12 months<\/p>\n<h3>So can keep scaling the biz.<\/h3>\n<p>Plug an operations dep.t<br \/>\nDon’t have to hire, onboard, train<br \/>\nHave backup VAs if it’s not working out.<br \/>\nTake care of whole thing.<\/p>\n<h3>To contact Aaron O&#8217; Sullivan to explore getting help, use this link:<\/h3>\n<blockquote class=\"wp-embedded-content\" data-secret=\"7HiOaaANrO\"><p><a href=\"https:\/\/systemscultureimpact.com\/contact\/\">Contact<\/a><\/p><\/blockquote>\n<p><iframe loading=\"lazy\" class=\"wp-embedded-content\" sandbox=\"allow-scripts\" security=\"restricted\" style=\"position: absolute; clip: rect(1px, 1px, 1px, 1px);\" title=\"&#8220;Contact&#8221; &#8212; Systems, Culture &amp; Impact\" src=\"https:\/\/systemscultureimpact.com\/contact\/embed\/#?secret=7HiOaaANrO\" data-secret=\"7HiOaaANrO\" width=\"500\" height=\"282\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"><\/iframe><\/p>\n<h2>For further info  interviews with Michael, <a href=\"https:\/\/amazingfba.com\/aaron-o-sullivan-systems-culture-impact\/\">click here<\/a><\/h2>\n<h2>TRANSCRIPT<\/h2>\n<p>&nbsp;<\/p>\n<p>Michael Veazey 0:04<br \/>\nWelcome to the 10 k collective podcast. Listen, if you want hacks, my friend, I&#8217;m afraid you&#8217;re in the wrong place. Our philosophy has grown out of the 10 k collective London mastermind members, by the way, make between half a million and several million dollars a year in e commerce based on many have doubled revenue in the last 12 to 18 months. If you&#8217;re that kind of person, this podcast is made view. We&#8217;re not puritanical. We use hacks, we just don&#8217;t think you should focus on them. If you&#8217;re building a real business, instead, we focus on what&#8217;s been proven to work in the real brand building, clear strategic objectives, courageous long term goals and long range thinking, if you like that focus, keep listening. Welcome, take a collective<\/p>\n<p>I think my experience with people to get very excited belted in and exasperated about vas and stuff is that they are unclear in there. And I&#8217;ve done I&#8217;ve been this person, probably still am in something we all have. Yeah, I mean, examples of where outsources work while my podcast editor for example, example was not work so well, I&#8217;ve got a bookkeeper who&#8217;s who&#8217;s really intelligent guy, probably too intelligent indian guy who tend to be high precise. That&#8217;s another cultural differences, things negotiate right there, the podcasters Americans, he&#8217;s used to me kind of throwing stuff at him. And he just kind of makes it work and doesn&#8217;t, doesn&#8217;t get upset about being imperfect. Whereas the Filipinos, famously are perfectionist, and it is all that stuff. But I mean, I would say in most cases, where hasn&#8217;t worked, I just threw a lot of bookkeeping at him and said, Do my bookkeeping as opposed to thinking through for myself in articulating what do I really need for this process. And then above all, not articulating, Tim, I don&#8217;t need the most complete tax accounts in the world is not going to be examined by Deloitte or somebody last week, what I need is management accounting, that will give me profitability by product line, they wouldn&#8217;t have taken me long to articulate that to him. And I didn&#8217;t, I just said do it. And of course, he&#8217;s now spend hours on my books. And I&#8217;m thinking Do I need to fire this guy, and it was also one and of course, I didn&#8217;t explain the result up front. So that&#8217;s how not to do it. From my<\/p>\n<p>Aaron O&#8217;Sullivan 2:14<br \/>\nexperience. on that, I think you made a great point, Michael. So what usually happens when we hire people is we we are, you know, the micromanager, we are giving them a task where you know, and then they&#8217;re coming back with a spoon feeding them task, which you know, where once they&#8217;ve done that, then we give them another task, you know, that&#8217;s going to be the most, that&#8217;s why people really struggle with hiring people and team is because of that reason. So what&#8217;s going to be absolutely critical, if you give them absolutely clear outcomes, specific results that you want. And, you know, let them figure it, you know, figure some of out themselves, you know, so it depends on the role that you hire for, of course, but, you know, let&#8217;s say that you are, instead of giving them everything, and you know, if you think about the amount of work, they&#8217;re supposed to be taken off your plate, not adding more to your plate. So the whole point of hiring a team is so they can remove, you know, stress and task and areas of business from your plate, and own them and be responsible for them, and giving them clear outcomes of what it what you&#8217;re looking for. And then kind of coaching them, you know, on what they&#8217;ve done. And that is how you basically scan a team, if you&#8217;re looking, if you&#8217;re going to be doing that spoon feeding tasks forever, then no wonder people, you know, this, what I see a lot, no wonder people don&#8217;t want to hire because it&#8217;s all got, you know, another task to do is tell them what to do now, and they keep coming to me, instead of giving them clear results that they&#8217;re going to be responsible for. And then just know, coaching them and mentoring them along the way is, you know, one of the biggest things which is changing the game for people. And that comes from like, Vern harnesses, books gaining up, you know, coaching and mentoring any of your team members on the outcomes that you&#8217;re looking for is going to be the most powerful things for them. Because they feel casual, they feel respected, they feel important, which they are. And you&#8217;re also showing them how to grow as a person as well, you&#8217;re not just spoon feeding tasks. You know, I don&#8217;t know about you, but I would hate to be told every task what to do, how to do it. And you know, I want to be able to be responsible with some part which is moving the company forward towards a predefined goals that you you set year, the quarter for the month. And as a team member that&#8217;s having a pie and you helping your team achieve these goals and outcomes. There&#8217;s nothing more exciting, and you know, you really become a team then if you aren&#8217;t just micromanaging them, and yet giving them task without clear outcomes, then they&#8217;re going to become annoyed and it&#8217;s going to be exhausting for you.<\/p>\n<p>Michael Veazey 4:39<br \/>\nAbsolutely. I couldn&#8217;t agree more. And I think because I&#8217;ve experienced both again, I mean it like with the the the the bookkeeping, I, for example, would eat he has a name and good guy. I mean, he&#8217;s got a background, he worked for delights in India. So I&#8217;m obviously quite high powered guy. And I think it was probably too high power for me as I probably should have said, Look, this is going to be shockingly primitive. It&#8217;s a culture thing, I guess like Indian very precise somehow to why they&#8217;re racing mathematically oriented. And and that&#8217;s good programmers and good accountants, I guess I don&#8217;t traditionally seem to be good at those skills. I&#8217;m not saying that&#8217;s all they do that we&#8217;re talking about 1.1 billion people. But you know, traditionally, they&#8217;re very good at those skill sets, particularly. And, yeah, I can see why. But again, that&#8217;s almost like a culture clash between that Indian thing that the kind of Western entrepreneur, the online entrepreneur versus the corporate culture, there&#8217;s a few cultural differences I can see there. And I can see now in retrospect, I should have sat down and said, Look, it&#8217;s a small business, the sort of thing that you would find shockingly ridiculous, the amateurs is probably exactly what I want, the sort of thing you would think of this professional is what I would think is ridiculous, the over the top and not necessarily. So let&#8217;s verify that. And I should have said, reverse engineering, I need to get hold of this guy and talk to him about and said, Here is the outcomes that I want. And here&#8217;s what isn&#8217;t doesn&#8217;t interest me out of the traditional bookkeeping things. And he&#8217;s also I can&#8217;t just say, it&#8217;s not like customers, I&#8217;ve done to death. I can&#8217;t just say, do this, then do this. I can&#8217;t even micromanage him, because I&#8217;m not competent enough in bookkeeping to do that. I mean, it&#8217;s it can get complex quickly, I what I need to do is set clear outcomes and ask him. Okay, so from the bookkeeping specialist perspective, what do you think we need to do? Is That&#8217;s it, he&#8217;s been kind of micromanaging me. Because I given like such a generalized thing, he&#8217;s been going, Okay, I need this account. And I need this. And by the way, I want your mortgage statement. Now, Mike, why do you need this, so I don&#8217;t understand why he wants stuff from me. He doesn&#8217;t want from him. It&#8217;s just, it&#8217;s it&#8217;s not pretty. And I have to say, in my defense, that with the podcast, for example, we got a little team chat, and my podcast editor knows that he&#8217;s part of something that is trying to achieve an outcome of of launching a course and trying to reach a new audience. And, and my webmaster is also part of that. So there is a team culture and funnily enough, it works. So I can endorse what you&#8217;re saying from Yes,<\/p>\n<p>Aaron O&#8217;Sullivan 6:53<br \/>\nit certainly does. And on that point, which you just made, having, it&#8217;s having a, you know, a little their mission purpose around what you stand for, you know, is the basis of your company culture, right? Where you&#8217;re going together that strategic planning, as far as what&#8217;s the, you know, the, the B hag, Where we going? You know, what&#8217;s our outcome? Who do we want to really help and serve? And that&#8217;s the long time the long term, then you&#8217;ve got the year ahead, the quarter had the month ahead, what do we do this week? And, you know, that is missing from So, you know, the majority of businesses out there, and the reason the biggest companies in the world, and the biggest companies in the world, because they have that process locked down in place, you know, yeah, like, there&#8217;s, it&#8217;s a clear correlation, the only difference between a big company and a small company is processing systems. That&#8217;s literally the difference. That&#8217;s, that&#8217;s what it is. That&#8217;s quite a statement. The only that&#8217;s a very treatable, the only difference between a big companies and small companies, that is the culture and the processes that are in place, I mean, I guess you could argue that have a lot more money in but then on the other hand, they got to that place because they had a vision. So they got to that place, because they had a clear direction, you know, in terms of where they&#8217;re going, you know, for the year ahead, like apple and these companies like Microsoft, they plan like five years ahead at four or five years ahead. You know, if we just planned a year ahead, we&#8217;re doing miles ahead of most people. But the why it&#8217;s relevant to this conversation is because when you&#8217;re bringing on new team members, you know, you need to hire people that really believe in what you&#8217;re doing and want to get behind that and be part of this team. Because you hire somebody that&#8217;s not really interested is going to do a half assed job, then you will always have problems there.<\/p>\n<p>Michael Veazey 8:34<br \/>\nAnd you end up in a fit of culture. And I think my experience with people to get very insulted in it and exasperated about vas and stuff is that they are unclear in there. And I&#8217;ve done I&#8217;ve been this person, probably still am in<\/p>\n<p>Aaron O&#8217;Sullivan 8:46<br \/>\nsomething we all have. Yeah, I mean, I think it should be about<\/p>\n<p>Michael Veazey 8:50<br \/>\nYeah, and I remember doing some management thing years ago when it was working for a local music service, which is pretty uninspiring, but actually, they were inspiring enough. People like that. I mean, I found the job itself extremely boring. And I left but which is right, because I wasn&#8217;t a fit for their culture. No, but they brought some management consultants in of all things, which is pretty unusual for local music service like teaching beginner trumpet, whatever was what I was doing at the time. And actually, they brought some people in said, Look, when you&#8217;ve got a team, you got to think about each member of the team has their own personal goals, you&#8217;ve got to appear to which is the what&#8217;s in it for me thing, but they also need to buy into the team goals. And then there was something else I forget the third component, which might be critical, but the point is that it&#8217;s not it&#8217;s a whilst is no good saying we are, you know, an amazing company. And I&#8217;m obsessed with myself. And they&#8217;re great. Yeah, well, why should I do this? You&#8217;ve got to answer that question. But I think the next level of mistake is to not really do anything except say, yeah, I&#8217;m going to pay you lots of money. And that should be enough is people want to be part of something bigger than themselves. And actually, it&#8217;s over. overlooked that to be cynical ago, these guys just want $5 an hour, you know, it&#8217;s they don&#8217;t I my experiences, you know, recognition, I&#8217;m personally in the same if I&#8217;m doing something for somebody bit of recognition just really counts. Like if somebody&#8217;s playing me, you know, hundreds of pounds. So to go to mastermind with me or mentoring or something, it still matters to me say, look, Mike, thanks, that was a great day, that really helps me, it still feeds me, because that&#8217;s part of my mission. That&#8217;s part of why I do stuff is never just about the money, whether it&#8217;s money or big money. And and it&#8217;s easy to forget that I think, because we get so numerically driven as Amazon sellers. Because it&#8217;s all online, we forget that you&#8217;ve got to inspire people. And<\/p>\n<p>Aaron O&#8217;Sullivan 10:25<br \/>\nyou can always have that challenge of if there&#8217;s if there&#8217;s no real buying from them we need to make money is not inspiring people they can do they can help comedy make money anywhere in the world, if they can be a part of something which is bigger than themselves, give them recognition and appreciation that deserve which are helping you move towards your predefined outcomes. And being part of that team is something I think everybody wants to be part of.<\/p>\n<p>Michael Veazey 10:50<br \/>\nYeah, well, look, I mean, we&#8217;ve got a million things we could ask about this. I&#8217;ve just got a couple more questions. And I&#8217;d love to ask a bit more about what you do at systems culture impact has obviously unsurprisingly, you specialize in this stuff, you&#8217;ve also got really clear insightful processes in place. Very impressive. So one couple of quick questions and about the things that keep coming up. Again, with some quite serious people. This isn&#8217;t just a newbie, kind of question with outsourcing, or indeed, the question of outsourcing versus in house hiring. What are your thoughts on that conundrum?<\/p>\n<p>Aaron O&#8217;Sullivan 11:22<br \/>\nRight, so depends on you know, where you were you kind of base I think a lot of the time it in your particular situation, we talked about it a bit before, the earlier on in the podcast, if you&#8217;re getting started her a process contractors are fine. You know, they can be anywhere in the world, I think there is completely depends on your situation, but staff of processes, getting things you know, particular areas of the business and then bring somebody in part time, whether that&#8217;s local to you, it&#8217;s up to you, it depends on the the profit you have any business that you can afford to pay somebody locally, if you&#8217;re based in UK, USA, and so forth, then you need to look at that in regards to do I want to have somebody local to me, that can work virtual, we can we can connect every week, and we want to because it&#8217;s just down the road, or have them completely virtual. So I think it depends on where you are in the state in in your business, you can hire amazing people, virtually people are growing virtual teams, you know, everywhere and doing it really, really well. It depends on so when you say in house, I presume that you mean having an office and having go people go there.<\/p>\n<p>Michael Veazey 12:28<br \/>\nThat was you know what that was? That was what I meant and actually articulated really poorly. And then I suppose what we&#8217;re talking about is a personal in person, assistant versus a virtual assistant. So you&#8217;ve answered that question very well, I can work in both cases. But yeah, and I think one of the things that&#8217;s always struck me I&#8217;m Tim Ferriss said this, and he famously talks about outsourcing a lot. Whether he&#8217;s personally that grated it or not, I mean, people obsess about to impress him, I don&#8217;t care. I think the ideas were valid, whether or not he did the more like, does many matters, interesting debate that gets the answers just to launch that boil. But he was talking about the whole thing of like, people obsess about cost per hour. And he says the right metric is cost per completed task. And to give an example, coming back to bookkeeping, it might be that this Indian dude who&#8217;s who&#8217;s incredibly well qualified and clever, it seems to me and is working me for between 10 and $16 an hour, depending on which skill set he&#8217;s using, like the whole accounting versus bookkeeping, versus my British based accountant who I&#8217;ve worked with for a while, he&#8217;s 90 pounds an hour. So whatever that $110, whatever it is, it may be, I&#8217;ll end up going back to her because I can clarify stuff to an articulate so she understands me, she understands parts British entrepreneurial culture, and how we work and all the compromises we&#8217;re willing to have. Perhaps that might be the better spend their money and actually, overall cheaper to end up with a set of accounts that are usable management accounts for me. So I always think that&#8217;s a really important thing to bear in mind, if you got any other thoughts on that as somebody who does deal with virtual teams?<\/p>\n<p>Aaron O&#8217;Sullivan 13:51<br \/>\nRight? So I think the question is working out whether you have somebody like a contractor, like in your case, a bookkeeper that you can go and visit and see and connect with, right? Yes, this is virtual, virtual. Yeah. So in that situation, I think that can be completely done virtual, where I think there needs to be, you know, things like bookkeeping and accounts, having, you know, for us, at least, having that with a company that can scale with us is really important. Because we don&#8217;t want to particularly have to grow a big accounting department in our company. Because right now you can get all that stuff taken care of off your plate and someone else manage it like overseas, if you&#8217;re if the guys from India, you know, if he&#8217;s working in a company, then usually that&#8217;s scalable view. So if you&#8217;re, if you&#8217;re just working with one guy in your business trebled, he&#8217;s going to really struggle to understand and keep up with that, if your business traveled, but you&#8217;ve got a team of accountants that are experienced in that and can do that overseas and deliver, all you need is delivery of these, the specific reports you need to see. And the numbers need to be accurate on time every month, right? is a very straightforward kind of, you know, this black and white, right is to say, is not like there&#8217;s no in between, it&#8217;s like they need to be 100. Right. And they need to be on time, every every time. So with that in mind, if you&#8217;re, if that&#8217;s happening, and you can connect with him on a call, but you know, on zoom once a month, and that is all you need, you know, to go and sit down with him and go through stuff I don&#8217;t think is necessary. The numbers speak everything that the outcome speaks everything, and a call on zoom face to face is just as good as sat there with him.<\/p>\n<p>Michael Veazey 15:22<br \/>\nYeah, I would agree with that. I think the issue is not whether it&#8217;s you put your finger on it, the question is not whether it&#8217;s virtual or physically, there is more a question of culture is now because I&#8217;m I&#8217;ve got a business coach, who is in Seattle, Washington is eight hours time eight time zones away. I mean, it&#8217;s I&#8217;ve never flown there. And as way too far, that&#8217;s not the problem, because he&#8217;s American internet marketer, and I&#8217;m British internet marketer, there&#8217;s enough cultural similarity. But actually, we speak kind of the same language, whereas my wife doesn&#8217;t understand half the hell the things I say these days, because, you know, we understand music kind of speak, which is speaking itself, which I have no idea what I&#8217;m talking about. I mean, she&#8217;s getting that she&#8217;s bright lady and picked it up. But my mates in London, if I ever mentioned, like affiliate marketing or internet marketing or conversion rate that they kind of look at me, like, I&#8217;m sorry, I didn&#8217;t quite get that. So from that point of view, maybe it comes down to a cultural match more than geography, which I think you&#8217;ve just put your finger on something, a very important distinction, I think people model together, it doesn&#8217;t really matter where the person sitting next to you in the desk or not, but the fact is, they need to understand you and unit understand them. And I guess,<\/p>\n<p>Aaron O&#8217;Sullivan 16:22<br \/>\nI think it&#8217;s just a cultural question. I think it&#8217;s just what is the specific outcome that I&#8217;m here to get? Yes, cultural, not if there&#8217;s a specific outcome that you&#8217;re looking for, like, if they&#8217;re from India, whatever, this is a specific outcome that we want, you know, this is what we need to see each and every month. And then we jump on a, you know, a monthly call to talk about anything that, you know, a strategic call for them, giving you what they see in the numbers, you know, if they&#8217;re, if you&#8217;ve got any questions for them that you can do that on that call. But I just think having a very clear outcome, you know, and having that very, very clearly explained in kind of delivered to that, so they understand exactly what you want. And there&#8217;s no in between, then,<\/p>\n<p>Michael Veazey 17:04<br \/>\nyeah, no, absolutely. Thank you for my therapy. My relationship with my bookkeeper is funny because I in theory, I know this because I like a lot of things, I just the irony is, and I&#8217;m not foul writing, so I&#8217;m just releasing this, that the blood and guts and the kind of my mess up with this, so that people can relate to it and get over their shame, I totally will do it, you know, totally. But the thing, what I did is I&#8217;m like, I just didn&#8217;t patients, like I want this off my desk, I just want management consoles, I just, you know, to the point where I was so impatient and quick, and this is such an entrepreneurial thing that you get, just do it. And the thing is, do what you have to fight what it is, you don&#8217;t even clarify the scope of what it is, you know, and you amplify the outcomes. And you haven&#8217;t clarified like, the bigger picture, because not just the deliverables, but why in the bigger context of the picture. Sorry, being context of your business. Do you want them at all? Okay, I need management accounts, not tax accounts, I need to know profit loss by product. Why is this so that I can make decisions to develop products or kill them off? And you know, I yeah, so I need to go and have that conversation. So thank you for your time on that. Last question, then is really a really important one as well. What do you do with the time you gain? Let&#8217;s say that I stop spending hours banging my head against spreadsheets for 10 hours a week trying to make sense of my numbers, and I gain 10 hours a week, and maybe I spend an hour a week, once things are set up managing this person&#8217;s game nine hours net? If you like, what is the most productive thing to do with that time, you&#8217;ve already talked about product creation, which is obviously critical for any e commerce site or anything else that has come across your desk? With your client base that they do? It&#8217;s different, it&#8217;s productive for them?<\/p>\n<p>Aaron O&#8217;Sullivan 18:39<br \/>\nYeah, absolutely. So for the most part, you know, people come to us, they&#8217;re doing 10 to 30 hours, sometimes even more week on operational tasks. So one of the challenges is, okay, well, once we take this off your plate, because some service, bookkeeping dementia management, what are you going to spend it on, you can&#8217;t, you know, it&#8217;s not going to work. You know, I tell this to people, you know, we don&#8217;t want to work with you, if, if you&#8217;re just going to go on holiday, because you&#8217;re not going to see the return, you need to obviously allocate that time to profit generation, whether that&#8217;s creating new products, and launching them, you know, not not having to do it all yourself, but the ideation of the products and, and whether it&#8217;s opening up new marketplaces, a lot of people are itching to get to Europe, or if they&#8217;re in the USA, or USA, if they&#8217;re in Europe, because they know their opportunity is huge there. But they&#8217;ve already got the product lines, they&#8217;ve got everything in place, they just need to get it over there, to capitalize on that. But you know, that in some cases could be, you know, an extra 50 grand a month for a lot of sellers, if they&#8217;ve got a successful established brand. The work, you know, is is minimal, in again, over there compared to what you&#8217;d have to do if you you know, start fresh, for instance. So there are two clear, very, you know, common ones, but more so is building your brand, building your audience remove getting off of Amazon and not having all your eggs in that bag it of being an Amazon seller where your focus is on, you know, capturing the low hanging fruit on Amazon, for instance, building an asset, like an email lists a database, you know, messenger bot subscribers, where you can basically make offers to a group of people that love your products, love what you&#8217;re doing, and can help you make more money on Amazon, and help you make more money off of Amazon, sending them to your Shopify store, or where you know, whatever the store you have.<\/p>\n<p>Michael Veazey 20:30<br \/>\nAbsolutely, I mean that this absolutely makes sense, because you&#8217;re basically, yeah, these are whole new chunks to your business or whole new expansion possibilities rather than just the day to day. And it just struck me while we&#8217;re talking that one of the reasons own is kind of obvious. But one of the reasons we don&#8217;t expand into new things is we get into comfort zone, we get good at what we&#8217;re doing. And I guess the whole point of expanding a business and being an entrepreneur is if you&#8217;re too good at what you&#8217;re doing is probably because you&#8217;ve been doing the same thing for a while, which means you&#8217;re not expanding your business, which means as an entrepreneur has to stay from a businessman, you know, business person, if you&#8217;re running a corporate entity, and you see maybe your business is going really well doing the same damn thing for 10 years. But if you&#8217;re an entrepreneur, you&#8217;re not doing the job if you&#8217;re not outside your comfort zone, I guess. So it just struck me No wonder we keep doing the same damn things, it&#8217;s a lot more comfortable than going right now I&#8217;m going to go to Germany, and I don&#8217;t speak the language. And I don&#8217;t know how it&#8217;s done. I don&#8217;t know how to deal with it. And, you know, that&#8217;s probably a sign of growing pains, right?<\/p>\n<p>Aaron O&#8217;Sullivan 21:25<br \/>\nYeah. And it&#8217;s like, you know, if you&#8217;re, if you&#8217;re only selling on Amazon, there&#8217;s like, hundreds of thousands of sellers, millions of Amazon, millions of sellers, sorry, all competing for the low hanging fruit. You know, that&#8217;s when you launch a product, you know, a good way to get going. But, you know, as soon as possible. In most cases out even if you&#8217;re starting out now, I&#8217;ll be more focused on how can I build an audience before I launch, because it&#8217;s a whole different game, if you&#8217;re trying to capture the low hanging fruit on Amazon with 10s of thousands of sellers, everybody&#8217;s sending the same product from the same supplier, you know, and following the same system, you&#8217;re gonna get the same results. So how can you figure out how to build an audience around a brand, a product line that solves and makes a meaningful difference in people&#8217;s lives, you can use that audience and then launch on Amazon, you know, you launch your products to Shopify, and that is an asset, which is going to be critical if you&#8217;re looking to sell your business down the line. And that&#8217;s going to be a huge factor in determining the multiple that you get in which obviously creates a high risk for any investor or buyer. If they don&#8217;t have, you know, Amazon&#8217;s the only source of you know, revenue stream, then it&#8217;s not going to lower the money that you you can receive from all that hard work you put into it. So having the right systems in place with instructions on how to do all the the tasks are going to reduce risk by having an asset and assets away from Amazon that you can use to drive offers to that audience are going to also present low risk for a buyer. Absolutely,<\/p>\n<p>Michael Veazey 22:54<br \/>\nyeah. And finally, we had the guys from Pro video, which is a wall street based for I&#8217;m here bringing private equity investors as buyers and arms and businesses, we talked extensively about that. And it&#8217;s funny how, at the higher level, it&#8217;s about connecting the dots, right is putting together the outsourcing piece with the you know, the customer service piece with it, you know, the outsourcing and the culture of outsourcing and having systems and processes that all gradually adds up together to sort of two sides of the same coin, really. So yeah, I think preparing your business to sell it is the ultimate in now I&#8217;m going to have to get everything else sorted. But as we said, for paying to outsource your business as we&#8217;ve just been discussing, or going through the process of outsourcing things forces you to do, I think just as valuable work on company culture, which I think you&#8217;ve articulated beautifully. So you know, what&#8217;s really nice about what your, your message and everything you about you and clearly comes through so clearly in our conversation is the culture thing. And the big picture. And then linking that to the individual people and individual tasks is really critical. And I love that because it&#8217;s quite different from the, you know, the traditional approach to was, which is very mechanical. And I think that may be why people are struggling. So tell us a bit more about what you guys offer. Obviously, you you&#8217;re very, very experienced and a lot of this stuff is shines through what are you saying? What do you guys offer for people that systems cultural impact.com, he wants to not just do this stuff on their own.<\/p>\n<p>Aaron O&#8217;Sullivan 24:17<br \/>\nYeah, thanks for having me on today. I&#8217;ve really enjoyed it. And hopefully, it&#8217;s been helpful for some people. So what we do really for six, high six and seven figure sellers is we just come into their business and methodically remove inventory management, customer service, bookkeeping, off their plates with our pre trained FBA train team, we already have all the systems and the processes, like standard operating procedures, which are basically written documentation on how to do all of that stuff, we just hand them kind of a filing cabinet for them and personalize it to their business. So we would remove inventory management off their plate, personalize all of our SAP for their business, and run it for them for three months to 12 months, depending on the client, and we know how we want to get started. But that&#8217;s really what we do. We remove things from the plate, get them organized with all of our SAP to help them remove that glass ceiling, so they can keep scaling their business. It&#8217;s kind of like plugging in an operations department to businesses. I hope that makes sense.<\/p>\n<p>Michael Veazey 25:25<br \/>\nYeah, totally makes sense. Man, that sounds really good. And I guess, yeah, plugging in operations department. And so you can focus on growing the business sounds kind of pretentious or kind of silly. But, you know, in the first instance, if you&#8217;re used to doing the work, and there&#8217;s a certain mentality amongst entrepreneurs that can happen with solo printers that, you know, it&#8217;s a bit like the small shopkeeper mentality works 70 hour weeks and has profit. And that&#8217;s great is working, but it&#8217;s not sustainable. And it&#8217;s not expandable, and I guess we have to be courageous enough to go. Now I need to get myself out of that unfocused, as we said on, you know, just a small bit of maths on the value of a new product line versus the value of bookkeeping or customer service suggest is extremely compelling. So yeah, absolutely makes sense to plug you guys in and then move on to bigger picture things,<\/p>\n<p>Aaron O&#8217;Sullivan 26:11<br \/>\nwhat people find helpful, just to make it more clear, what people don&#8217;t find most helpful is that I have to go and find the staff, train them, hire them onboard them, create the sap is in the hopes that they got it right, in hopes of the funded by person, we just bring all that we have backup vas, you know, if it&#8217;s not working out at all times, and we basically just take care of that whole the whole thing and solve all the issues around their system. They&#8217;ve gotten their current specific situation. So right. Yeah, that&#8217;s, that&#8217;s pretty much it. If that sounds as if that resonates at all, if you want to, you know, have a chat we need to do is reach out, you can go to systems Coach impact.com, forward slash go. And there&#8217;ll be a short survey. And we jump on a quick call and see you guys where you&#8217;re at where you need. If we can&#8217;t help, then I&#8217;ll be more than happy to point you in the right direction.<\/p>\n<p>Michael Veazey 27:05<br \/>\nExcellent. And I believe they&#8217;ve also got some free training on how to create a product launch machine, if I understand. That&#8217;s right. So we&#8217;re going to afford from amazing fba.com forward slash blueprint. So what&#8217;s it what&#8217;s included in that just briefly, if anyone&#8217;s interested in that?<\/p>\n<p>Aaron O&#8217;Sullivan 27:20<br \/>\nYeah. So in light of our conversation today of, you know, setting up systems, one of the biggest ones for Amazon people, ecommerce sellers is they are not wanting to do all of the tasks involved with launching a new product. So we want to be able to set up a well oiled product launch machine. So yes, we can focus on creating the products, but we have a team in place to help execute on that launch process. So you can come up with the ideas you can approve and oversee and coach along the way. But you know, having to do all of the steps in between. So it&#8217;s basically it&#8217;s basically like a PDF, you can you can use it if you want it. A ton of people got loads of value from it, and it will show you how to sell that system for yourself. So it&#8217;s amazing. fba.com forward slash blueprint.<\/p>\n<p>Michael Veazey 28:11<br \/>\nExcellent. Yeah. Well, we&#8217;ll get that set up as soon as the podcast is live. So Excellent. Thank you, Aaron. It&#8217;s been excellent stuff for men really. So bit of therapy for me on an example of me messing up the outsourcing thing, but I just think that was just an example of where I know damn well from doing it well, that it does work. If you articulate the value of your team, to your team, rather, of where you want to go, what&#8217;s important to you what is important to not do, what the outcomes are having done that sometimes and sometimes failed to the difference is really extremely big. So I think you&#8217;re what you&#8217;ve articulated today is really important for people to hear and to go away and reflect on. And if nothing else to track your time, as you say, again, it&#8217;s a tough discipline. But it&#8217;s so so revealing. so incredibly rewarding. Fantastic message and clear, actionable stuff, as well. So really valuable and great to have you on. Thank you so much for coming on.<\/p>\n<p>Aaron O&#8217;Sullivan 29:02<br \/>\npleasure as always Michael. Hopefully it was helpful and anyone needs help whatsoever. Just reach out I&#8217;ll be more than happy to point in the right direction.<\/p>\n<p>Michael Veazey 29:10<br \/>\nRight. Thanks, Aaron very much. Thanks for listening to the 10 k collected podcast. I really hope you found this show helpful. I mentioned the London based masterminds we&#8217;ve been running since September 2017. Members of the 10 k collective mastermind make a minimum of about 480,000 pounds a year, whatever 600,000 euros or dollars. To find out more about that mastermind. Get to amazing fba.com forward slash 10 k si k for killer. See for Charlie million pound mastermind members make a minimum 4.2 million pounds a year that&#8217;s about 1.5 million US dollars for years. To find out more about that mastermind. Go to amazing fba.com forward slash MP em em from other people.<\/p>\n<p>Transcribed by https:\/\/otter.ai<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_010-arron-pt2.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Foutsource-for-e-commerce-with-aaron-osullivan%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-5\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_010-arron-pt2.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9667-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_010-arron-pt2.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_010-arron-pt2.mp3\">Download<\/a> (Duration: 30:12 &#8212; 20.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_010-arron-pt2.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Foutsource-for-e-commerce-with-aaron-osullivan%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-6\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_010-arron-pt2.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9667-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_010-arron-pt2.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_010-arron-pt2.mp3\">Download<\/a> (Duration: 30:12 &#8212; 20.7MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 30:12 &#8212; 20.7MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 30:12 &#8212; 20.7MB)Subscribe: Spotify | Email | TuneIn | RSS<\/p>\n","protected":false},"author":1,"featured_media":6618,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1550],"class_list":["post-9667","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Outsource for e-Commerce with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Outsource for e-Commerce with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 30:12 &#8212; 20.7MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 30:12 &#8212; 20.7MB)Subscribe: Spotify | Email | TuneIn | RSS\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-06-24T05:00:57+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-29T07:26:29+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"34 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Outsource for e-Commerce with Aaron O’Sullivan\",\"datePublished\":\"2019-06-24T05:00:57+00:00\",\"dateModified\":\"2020-06-29T07:26:29+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/\"},\"wordCount\":7130,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/\",\"url\":\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/\",\"name\":\"Outsource for e-Commerce with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-06-24T05:00:57+00:00\",\"dateModified\":\"2020-06-29T07:26:29+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"outsource for e-commerce with freeup on the 10K Collective Podcast with Amazing FBA Podcast for Amazon Sellers\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Outsource for e-Commerce with Aaron O’Sullivan\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Outsource for e-Commerce with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/","og_locale":"en_GB","og_type":"article","og_title":"Outsource for e-Commerce with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 30:12 &#8212; 20.7MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 30:12 &#8212; 20.7MB)Subscribe: Spotify | Email | TuneIn | RSS","og_url":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-06-24T05:00:57+00:00","article_modified_time":"2020-06-29T07:26:29+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"34 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Outsource for e-Commerce with Aaron O’Sullivan","datePublished":"2019-06-24T05:00:57+00:00","dateModified":"2020-06-29T07:26:29+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/"},"wordCount":7130,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/","url":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/","name":"Outsource for e-Commerce with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","datePublished":"2019-06-24T05:00:57+00:00","dateModified":"2020-06-29T07:26:29+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"outsource for e-commerce with freeup on the 10K Collective Podcast with Amazing FBA Podcast for Amazon Sellers"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/outsource-for-e-commerce-with-aaron-osullivan\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Outsource for e-Commerce with Aaron O’Sullivan"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2vV","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9667","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9667"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9667\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6618"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9667"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9667"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9667"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}