{"id":9668,"date":"2019-06-21T06:00:43","date_gmt":"2019-06-21T05:00:43","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6600"},"modified":"2020-06-29T08:52:26","modified_gmt":"2020-06-29T07:52:26","slug":"outsourcing-ecommerce-company-culture-with-aaron-osullivan","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/","title":{"rendered":"Outsourcing ecommerce &#038; Company Culture with Aaron O’Sullivan"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_009-arron-pt1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Foutsourcing-ecommerce-company-culture-with-aaron-osullivan%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_009-arron-pt1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9668-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_009-arron-pt1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_009-arron-pt1.mp3\">Download<\/a> (Duration: 42:20 &#8212; 29.1MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_009-arron-pt1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Foutsourcing-ecommerce-company-culture-with-aaron-osullivan%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_009-arron-pt1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9668-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_009-arron-pt1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_009-arron-pt1.mp3\">Download<\/a> (Duration: 42:20 &#8212; 29.1MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><!--more--><\/p>\n<p>In this episode, I talk with Aaron O’Sullivan of Systems Culture Impact, in part one of a two-part series.<\/p>\n<p>Aaron starting selling private label products on Amazon in 2013. He was growing quickly, but in 2014 the brand started to plateau and then took a dive. He realized that he needed systems and teams in order to continue to grow, and so he began outsourcing.  Finding the right people to add to your team can free you up to take your Amazon business to the next level. We discuss why outsourcing is so valuable and the steps on how to expand your team the right way.<\/p>\n<h2>Topics in the episode<\/h2>\n<ul>\n<li>Benefits of outsourcing, and how that is reflected in your profits<\/li>\n<li>How to start the process of outsourcing:\n<ul>\n<li>Start by hiring processes out to contractors<\/li>\n<li>Then develop a team that is full time for you<\/li>\n<\/ul>\n<\/li>\n<li>Types of tasks that should be outsourced:\n<ul>\n<li>Customer service is the first thing that comes to mind.<\/li>\n<li>Start small, and ramp up to tasks with more responsibility<\/li>\n<\/ul>\n<\/li>\n<li>Outsourcing doesn’t have to only pertain to business tasks. It can also be beneficial to outsource home and daily task.<\/li>\n<li>Services for daily tasks and outsourcing:\n<ul>\n<li>Zipjet (<a href=\"https:\/\/www.zipjet.co.uk\/\">https:\/\/www.zipjet.co.uk\/<\/a>)<\/li>\n<li>TaskRabbit (<a href=\"https:\/\/www.taskrabbit.com\/\">https:\/\/www.taskrabbit.com\/<\/a>)<\/li>\n<li>Magic (<a href=\"https:\/\/getmagic.com\/\">https:\/\/getmagic.com\/<\/a>)<\/li>\n<li>Airtasker (<a href=\"https:\/\/www.airtasker.com\/\">https:\/\/www.airtasker.com\/<\/a>)<\/li>\n<\/ul>\n<\/li>\n<li>The critical step of time tracking:\n<ul>\n<li>Will help you see the tasks you should outsource.<\/li>\n<li>Will also help clarify the role and desired outcomes of the person you hire<\/li>\n<li><a href=\"https:\/\/toggl.com\/\">https:\/\/toggl.com<\/a><\/li>\n<\/ul>\n<\/li>\n<li>Value vs Cost of Outsourcing.<\/li>\n<li>Tactics of hiring:\n<ul>\n<li>Clarity<\/li>\n<li>Scorecard<\/li>\n<li>Job Posting<\/li>\n<li>Questions within the Application<\/li>\n<li>One and done tasks<\/li>\n<\/ul>\n<\/li>\n<li>Hiring Process, which should result in 2-3 candidates:\n<ul>\n<li>Job posting<\/li>\n<li>Personality and aptitude tests (Criteria Corp.: <a href=\"https:\/\/www.criteriacorp.com\/\">https:\/\/www.criteriacorp.com\/<\/a>)<\/li>\n<li>15-minute interview<\/li>\n<li>1 hour tandem interview (with 2-3 team members)<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<hr \/>\n<h2>Transcript<\/h2>\n<p>Ladies and gentlemen, welcome to the show the is Michael Veazey of the tank, a collective and I&#8217;m going to be delighted to welcome Aaron O&#8217;Sullivan of systems culture impact to the show, Aaron deals with outsourcing, which is a very important thing for people wanting to go from a certain level where you still got stuck. And you can even find your revenue going backwards if you&#8217;re focusing on the wrong things. And at that point, you definitely need to be thinking about outsourcing. So Aaron, welcome to the show. Very important topic.<\/p>\n<p>Aaron O&#8217;Sullivan 1:23<br \/>\nHey, Michael, thanks so much for having me on board. Really excited about today&#8217;s session<\/p>\n<p>Michael Veazey 1:26<br \/>\nthere. And my pleasure, good to have you back. And it&#8217;s an important topic, as we said, For for people who are and got the growing pains, and they can actually become a real barrier. So tell us a little bit about yourself, first of all, your background personally, or as an Amazon seller as well.<\/p>\n<p>Aaron O&#8217;Sullivan 1:40<br \/>\nAbsolutely. So um, I started in 2013, selling our own brands, private label brands, on Amazon, and things that were really good. And, you know, I was like a kid in a candy shop, started launching new products and open up new marketplaces. And, you know, went a bit crazy in 2014, because I had so much on my plate. Now the brand started taking a bit of a plateau and then a bit of a dive. And I was freaking out, I kind of didn&#8217;t know what to do. You know, it took me a while to kind of join the dots, but you need systems and you need team in place for you to continue to grow. And that really came to me that insight came to me through working with some large teams and help them build large teams in the Philippines. You know, it&#8217;s my job to build all the systems and processes and in kind of nurturing a team culture to drive forward now 10 or so brands. So that was how I got my kind of start in systems and team and, and implementing them to get things off people&#8217;s plates. Yeah, we just been working with seven-figure sellers, helping them get the operations off the plate so they can focus on profit generation, things like inventory management, customer service, and bookkeeping. That&#8217;s kind of where we are, where we&#8217;re at today.<\/p>\n<p>Michael Veazey 2:46<br \/>\nExcellent. So I guess it&#8217;s like a lot of the best businesses, you start by scratching your own itch. Or to put another way, you&#8217;re your own first customer, because you&#8217;ve got a problem, you didn&#8217;t solve it, and then realize that you&#8217;re not the only person with that problem. So I think it&#8217;s a good hint, whether you starting out just creating your own Amazon products, or indeed creating a service, it&#8217;s the same thing, right? It&#8217;s just always good to really be answering a real need. It&#8217;s coming up with something off the top of your head. So very reassuring that you&#8217;ve been there and done it yourself. So obviously, you know from firsthand experience. So tell me that in the first question, which is not just the naive question, it sounds like do we actually really need to outsource some of the other day, in one of the masterminds around we had somebody who&#8217;s doing, you know, at least 1.2 million pounds a year or something like that, and probably quite a bit more in good years. And he&#8217;s just him and his business partner? They haven&#8217;t actually got a VA at all. It&#8217;s not because they don&#8217;t know they exist, I haven&#8217;t worked with them. They haven&#8217;t felt the need for it. So is it something we really need?<\/p>\n<p>Aaron O&#8217;Sullivan 3:42<br \/>\nis a great question, it comes up often. But I think the answer is usually pretty simple. You know, if you are doing everything yourself, it&#8217;s going to be holding you back from focus on the profit generation activities that enable you to, to grow your business to a place where you can, you know, take more time off, you can create the legacy that you want to create in the world, whether it&#8217;s just helping your family, whether it&#8217;s building a movement around your products, and brands are going to change all of a lot of customers lives. But if you do not outsource, and it&#8217;s going to prevent you from doing that. And frankly, I think if you don&#8217;t grow team, it&#8217;s going to be one of the most lonely, challenging endeavors that you ever go, you know, forthwith, it&#8217;s kind of like any successful sports team has a real solid team behind it. And you know, that is the same, you know, with any business, any successful business that you know, that we all remember, or the most, you know, legendary business people that you&#8217;ve ever heard of always had a solid team around them, you&#8217;re going to reach the capacity of which you can continue to grow your business, because you are maxed out with all of the operations or the day to day or the firefighter. My answer is kind of absolute, it&#8217;s, you know, you will 100% need a team in place, you don&#8217;t have to start there, you can start with just outsourcing parts of it processor parts of the system, you can get people per minute, these days, you don&#8217;t have to go and I have to employ somebody and you know, have a big office, and you can just start with the process. One thing that you want to get off your plate. Yeah, that&#8217;s kind of where I would start hiring processes out contractors, and then move into hiring a team, which is full time for you.<\/p>\n<p>Michael Veazey 5:21<br \/>\nOkay, so yeah, that&#8217;s you&#8217;ve made a very valid point. So one of the reasons people question it is probably because the question they&#8217;re asking in their mind is, do I need to outsource an entire role a whole lot higher, you know, a full-time person, or outsource a ton of stuff and get this whole team? And your answer is, well, yeah, you should outsource. But that doesn&#8217;t mean you gotta hire full time. You could just be in micro hiring. And that&#8217;s a very, yeah, it&#8217;s very wise. Because I think that if you make the barrier to entry for something too big people just never do it. For the newbies to the market is like this go from nothing to one private label products in one go, which is why I always encourage people to sort of things out and small level. And I guess for more established sellers, it&#8217;s the same thing if you moving into outsourcing first time, you don&#8217;t get full time. So that&#8217;s a very good point. So the next question that comes up is at what point then should we start outsourcing because it when you&#8217;re just doing tiny numbers, your business can&#8217;t really handle any extra overhead. But there comes a point where there&#8217;s that balance between the overhead edition versus your time and growing the business in the future. What would you say is that kind of point where you need to start outsourcing.<\/p>\n<p>Aaron O&#8217;Sullivan 6:24<br \/>\nAs we mentioned, you can start hiring out particular parts of the process, I think it&#8217;s really important to to immediately, you know, as your business as you start to get some sales and starts to get some revenue come in, what things that you ultimately don&#8217;t like to do or not good at, or you can outsource for way less than your potential hourly rate that you bring to the business in value. So I believe we should start outsourcing as soon as you start generating some revenue, start bringing some money into the business, you will be able to understand the things that you&#8217;re spending time on whether it&#8217;s a personal thing, whether it&#8217;s you know, hiring a college, this, you know, spend two hours a week clean your house, or whether it&#8217;s, you know, go into Amazon, you know, we&#8217;re all in the Amazon space, if you haven&#8217;t got your most of your stuff automated on Amazon in terms of products that you need delivered your house as a quick and easy when you can get going with to free up some time. But it could be anything from having cleaning around your house, or whether it&#8217;s in offloading part of your customer service, or part of your inventory management. Really, there&#8217;s no time to early as long as you&#8217;re, you&#8217;ve got a product and you know, you&#8217;re bringing in some revenue can afford to start outsourcing a process or a part-time person, they don&#8217;t have to be full time. They don&#8217;t have to be in house. It can be virtual, and, you know, literally contracted in, you know, like on-demand<\/p>\n<p>Michael Veazey 7:44<br \/>\nYeah, makes sense. So really, you&#8217;re saying I guess as early as possible. And I have to say Looking back, I wish I&#8217;d start outsourcing stuff earlier. It&#8217;s funny, you should mention outsourcing cleaning, because I&#8217;ve had somebody in to do, just like the washing up really, which is not a big deal. But it takes me about half an hour day because we eat a lot of food and drink a lot of coffee in this somehow. And yeah, it just keeps track every so often I have the discipline to hire somebody in and then magically, I get another podcast at the door which brings, you know, revenue and brand awareness and stuff, which no amount of washing up is ever going to do. So you&#8217;re not necessarily just business, it&#8217;s just winning back time. Right? That&#8217;s<\/p>\n<p>Aaron O&#8217;Sullivan 8:16<br \/>\nexactly I mean, there&#8217;s services for everything, there&#8217;s you know, I use it jet, which is I&#8217;m London Bay. So it&#8217;s like laundry, they do the pickup and delivery laundry tweet, there&#8217;s task rabbit which is you can get anything done, you know, you want a flat pack furniture belt, you can just hire somebody for like, you know, 10 pound an hour or something amazing. That&#8217;s where I get my cleaners from. And yet everything in between, everything is your reach nowadays in terms of hiring out people per minute per hour on anything you want. So really take advantage of the some places to check them out task rabbit is it jet? Like I mentioned, there is get magic, which is and get magic, such an awesome company, it&#8217;s based over in San Francisco, they have permanent vas, you can have a business account, or you can have a personal account, you can hire, you can offload things to them, you know, super cheap and get things delivered you anything, it could set reminders on your phone, they can text you to pick up your children, anything you want. Just so you<\/p>\n<p>Michael Veazey 9:20<br \/>\nknow, that would be bad. I&#8217;ve actually used air task, which is I think on Australian based company, but as we find a cleaner from because task rabbit somebody mentioned to me and found a task was good. But anyway, I mean, you know, there&#8217;s lots of services. Again, absolutely, I mean, we&#8217;re going to have a bunch of links to put in the show notes already. But so coming back to Amazon, I&#8217;m going to buy like the idea that it&#8217;s not just about business, it&#8217;s not just about all or nothing. It&#8217;s like you can start immediately, and you can outsource on mundane, daily tasks. And I&#8217;m really like that I really liked the fact that I was sitting here doing a podcast one day when somebody next door taking care of yc up, it&#8217;s a great feeling of you haven&#8217;t done it. Personally, I love it. I know some people are paranoid Latin people in the house and whatever, I just loved it. But there you go. So the next question, then came back to the Amazon space, what do we outsource? And then what do we outsource first? And so let&#8217;s deal with that. What things? Could we outsource? that&#8217;s listed with that question.<\/p>\n<p>Aaron O&#8217;Sullivan 10:12<br \/>\nWe as leaders, as business owners, we have a ton of things on our plate. And there&#8217;s a lot of stress, frankly, and press pressure, if you&#8217;re taking a step out there, you&#8217;re running a business you&#8217;re taking care of with everything providing for your family. So you&#8217;re going to this is not just like a one-off thing, you need to constantly become addicted to removing things off your plate. One of the things we always have our clients do, and I think we talked about it, maybe a year ago on the podcast is always, you know, tracking your time regularly. It doesn&#8217;t sound sexy, but what it does is it completely, you know, change the game for you in terms of how productive you are, where you know, the amount of value that you can bring to the business because it creates awareness of where you&#8217;re actually spending your time. So that will reveal all to you if you have a clear way to track your time on a daily basis is. So a tactical way to do that is just have a spreadsheet open. And every time you switch task, every time you change do anything, whether it&#8217;s look at your phone, whether it&#8217;s through the washing up, whether it&#8217;s, you know, respond to a customer email on Amazon, or whether it&#8217;s contacting a supplier over in China, every time you switch task, track it in terms of the time and how long it took you and you know, 10 days, two weeks, you&#8217;re gonna have absolutely no absolute clarity of, you know, what do I want to get rid of off of this list, because without that, you&#8217;re gonna, you know, you&#8217;re not going to be 100% clear, the data speaks for itself, absolutely kick my backside. It does every time the first time I&#8217;ve done it, it was like, you know, I thought I was really productive. And it was quite humbling actually, to do it because it was a very far from the truth. That&#8217;s what I would highly, highly recommend you do that to get going. And then you build it in as an as a system into your business. So you do it periodically through the year. So you&#8217;re constantly have to evaluate where you&#8217;re working and identity defined on that list. What is not bringing value to business? What can you outsource? What part of that could you hand to somebody else, and eventually, you know, your, your move from contractors, to having a part time person, whether that&#8217;s in a, you know, local to you, or overseas, and then you know, eventually go to full time. But that&#8217;s what you know, first and foremost, to gain that clarity, you need to you need to have a clear way to track and measure where you&#8217;re spending your time makes a lot of sense. It really does. And the thing is that the act of measuring as Peter Drucker, the management consultant, I think was just one of the most really useful management consultants, law people, right very fancy books that then turn out not to be very useful the next decade, but he said what gets measured gets done, right. And if you don&#8217;t measure time, like you don&#8217;t measure money, famously businesses go broke, you know, if you&#8217;re not measuring your money will come to the bookkeeping question in a second. But I mean, yeah, if you don&#8217;t measure time, you don&#8217;t know how you&#8217;re spending money, right, I use a system called toggle to GG l don&#8217;t use that. But I mean, is great, try and be working rigorous. Now I tried to be really anal about tracking my time, so I can really look at the statistics at the end of a week ago. Yeah, I didn&#8217;t feel that project move forward very much this month, I feel frustrated about it. And like, no wonder because I spent three hours on it this month, when I mentally spend 20 hours worrying about it, but it&#8217;s very, very easy. For something there particularly I find you think about something a lot been actually sit down and, you know, whatever it is map out the processes and the emails, you know, place actual physical orders, whatever. And, yeah, I think a reality check in terms of at least a week of being really, really ridiculous, the over measuring, I think, is really, incredibly powerful. So haven&#8217;t done it, I agree with you. I mean, I&#8217;m not a naturally very structured person. So I think for me, it&#8217;s particularly important is, you know, it&#8217;s not just you, Michael, if you think about most business owners, they&#8217;re visionaries are leaders there, they just want to make stuff happen. And most, for the most part, the details and things like that scares a lot of entrepreneurs, because they&#8217;re like, they&#8217;ve got this crazy big vision that they want to go make happen. And that&#8217;s, that&#8217;s completely normal. But what this will do in and for your team members, you know, if you have team members that are, you know, high level, tracking their time will be able to enable them to remove things from their play, so they can work on higher value areas. So this is absolutely, you know, critical and foundational, and that&#8217;s, that doesn&#8217;t ever stop that, you know, ongoing, you know, whether you do it every, you know, a couple of months, every six months, it&#8217;s up to you. But the reality is, the more you&#8217;re clear on where you&#8217;re spending your time, because things evolve so quickly. And things change rapidly, you know, you&#8217;re going to have absolute clarity on. Okay, well, what part of this two weeks that I&#8217;ve just spent time on is really not moving forward. You know, so if you&#8217;re working on just reactive, reactive things, fighting fires, and you&#8217;re not, you know, you aren&#8217;t doing customer service emails, you&#8217;re tracking down shipments, you are doing things like, you know, talking and trying to reconcile your books, things like that, which are typically, you know, to advocates that, what usually happens is business owners, they spend 80% of their time and operations instead of 80% of their time on sales and marketing and strategy, which is what we need to flip around. And the faster you can do that and the more proactive you can be in that you will see your business absolutely explode because you&#8217;ll be focusing on opening up new marketplaces, launching new products, building, you know, systems around your, you know, the things that ultimately grow your business and put you on the path that you&#8217;re looking for. Because I think a lot of time we get stuck at, you know, a glass ceiling of growth, because it&#8217;s 80% operations managing and, you know, checking tasks and pushing them through. And a lot of people wonder how they can continue to grow without having more hours in a day. The simple answer is having team in place, you know, and structure and system systems around the things which you can kind of offload.<\/p>\n<p>Michael Veazey 15:54<br \/>\nOkay, so you just mentioned a few specific examples. So can you can you say from experience, what kind of task you find Amazon should be outsourcing it also, just more specifically, what things should you outsource first, because we mentioned a few things. You&#8217;ve also mentioned the thing of you don&#8217;t have to go from nothing to outsourcing everything. Yes, you should make your time. So that&#8217;s a critical reality check. But in general, because you&#8217;ve seen the patents yourself, now, would you say if you had to generalize the one or two sort of areas that you should hire that first five or 10 hours a week of somebody&#8217;s time for?<\/p>\n<p>Aaron O&#8217;Sullivan 16:27<br \/>\nYeah, absolutely. So I&#8217;m going to be honest, it&#8217;s going to be, I like to have somebody who can handle all of the customer service all of the day to day that comes in, but also is capable to help me out in my kind of personal life as well. So hiring somebody, like a, you know, a PA, you know, a virtual pa is fine, just to help out with any life admin that you have, because frankly, there&#8217;s a lot of that stuff that comes in. And, you know, also somebody can, you know, also help you with all of the customer service based activities, whether that&#8217;s answering to answering customer service emails within Amazon, you know, checking, responding to reviews, processing refunds, fulfillment orders, responding to your Facebook page, messages, anything regarding forward facing low value tasks like that, which you can easily, you know, put into a process and hand over to somebody else. So, we can talk a little bit about how to do that tactically, today, I&#8217;m, you know, definitely more than happy to do that. But usually, it&#8217;s somebody to lower the stress on you personally, but also to lower the incoming customer service based inquiries. And, you know, you can start there, and then ramp up the responsibility over time. So they can start with the basics, answering customer service, emails, responding to reviews, seller feedback, and then you can offload more of the high responsibility things onto their plate, like Dino of Amazon cases, you know, having processes in place for removing hijack, because things like that, which, you know, can they can work into that.<\/p>\n<p>Michael Veazey 18:04<br \/>\nDoes that make sense? Yeah, makes a lot of sense. And actually, I like the fact that, again, this is not an all or nothing proposition that you&#8217;re making very, very clear that you can start off with something, anything that you can put in places as simple process is the place to start. And then over time, you can ramp up the responsibility, but you don&#8217;t have to hand your business over in one go. And I think that the two resistance is to outsourcing that I sense in myself, and certainly in clients that have worked within them, mostly mastermind members now is yet number one, the money and you&#8217;ve got to think about the greater value of your time and have a longer vision than just purely the profit this month. And the second thing is that that trust, and so we&#8217;re talking about that in a second. So who you hire and how you hire is obviously critical. But starting off with something that isn&#8217;t mission critical is probably also good as well and and then ramping up to more complex things like how do you handle hijackers?<\/p>\n<p>Aaron O&#8217;Sullivan 18:53<br \/>\nI mean, just on that note, yes, this just a little example, is, let&#8217;s say you are spending 10 hours a week on customer service, and you&#8217;re doing the best 40 hours a month on customer service. But you know, if you remove that from your plate, you would have 40 hours to work on creating and launching a new product. And let&#8217;s just assume that, you know, one product can bring you in 5000 pound or $5,000 a month in gross revenue, let&#8217;s say two grand of that is just to keep it simple. Two grand of that is net profit. So if you were to work on launching one or two new products with that new 40 hours in that month, then there&#8217;s a clear way on how you will bring in per product, it&#8217;s five k revenue, then that&#8217;s that is over 50 k 60 k and revenue for the for the year. And that is just with one product. So removing that 40 hours from your plate allows you to focus on creating a product, which is literally going to generate 50 k per time you do it.<\/p>\n<p>Michael Veazey 19:57<br \/>\nYeah, absolutely. That makes sense. It makes total sense. And the thing is that people are nervous about that actually think about the business modeling is big, really, we are arbitrage in the difference between being able to buy goods in bulk, because nobody probably normally needs 1000 iPhone cases. But a business will buy that any given week. And also the arbitrage between Chinese factory costs and what retail what consumers in the West will buy, wherever you&#8217;re selling, it actually doesn&#8217;t matter where it is. But there&#8217;s arbitrage between those two. So if we&#8217;re not willing to advertise the difference in the value of our time and the value of a time, it shows you have no faith in, in the fundamental act we&#8217;re involved in, which is to say that you&#8217;re going to have to buy things in at a certain value. And that business model only works if you then do something at the other end that has got more value. So just struck me that is really kind of a similar thing, you buy a VA time at $5 an hour, and you do something that will generate enough revenue to be worth about $40 an hour of your time. Right. So in other words, you&#8217;re you&#8217;ve got to have some faith in the value you bring to your business in the first place. And<\/p>\n<p>Aaron O&#8217;Sullivan 20:56<br \/>\nthen yeah, I mean, if you do it, if you spend 40 hours on a task, which can make you in a in a month that can bring you in 60 grand for the year, then the hourly rate on that is way higher than focusing on customer service for the Yeah, reef processing refunds all I just tried doing that, you know,<\/p>\n<p>Michael Veazey 21:16<br \/>\nyeah, 60,000 divided by 500. The hell is that? It&#8217;s suddenly it&#8217;s pretty easily $120 an hour or something, it&#8217;s actually really very hard when you think about that the the return on investment of actually a successful product. And even if you&#8217;re cynical, you&#8217;ve been around the block and say, Oh, yeah, that works in theory, but I&#8217;d be products is a win. Okay, so look, maybe one product in three, and then it&#8217;s $40 an hour as opposed to $5, which is customer service, right? You can&#8217;t get around the massive the thing that we focus on the higher value tasks,<\/p>\n<p>Aaron O&#8217;Sullivan 21:41<br \/>\nif you spend 40 hours working on a product which generates you, you know, 50 grand in the year, then that&#8217;s 1200 and 50 pounds, dollars per hour that work. So, and again, it&#8217;s never obviously perfect. But the point here, what would what was what we&#8217;re saying is, when you consistently remove these things from your plate, you don&#8217;t that doesn&#8217;t even have to come into your you know, your mind space, then all you&#8217;re focusing on is how you can improve your product launch system, how you can get better at launching products. So is a compounding return of investment. As you know, if you&#8217;re removing customer service, bookkeeping, inventory management, daily admin off your plate, then the things which are really important to grow the business, product creation, launch systems, growing your audience going away from Amazon building assets, you become better at them over time, which then you can use to make more money on and off of Amazon.<\/p>\n<p>Michael Veazey 22:32<br \/>\nSo yeah, I think it&#8217;s one of those things. So to interrupt, I just think it&#8217;s so worth ramming the point home with people who are actually pretty good sellers and pretty in some ways very sophisticated business people is that they get way too wrapped up in, in cash flow is critical, and then profit and losses as well. But they get wrapped up in being part of the machine that generates the cash. And that&#8217;s addictive. But yeah, what you&#8217;re getting better at if you do a lot of customer services, customer service. Whereas if you do a lot of product development, you get better product development. And it&#8217;s just a higher paid skill, right, I guess to say what you&#8217;re saying,<\/p>\n<p>Aaron O&#8217;Sullivan 23:00<br \/>\nthe time tracker will tell you everything, you know, if you&#8217;re spending if you if you try to say you tracked your time for the whole year, every single day, and you had in one quarter you had you know, massive growth, you can bet your money or you know that if you look on the activities where that growth came from, it will be around profit-generating activities. So there&#8217;s a direct correlation, of course, on the value that where you&#8217;re spending your time in your business, you know, the value that actually brings and the results that bring to your business. But because we are so in the forest, you can&#8217;t you know, we can&#8217;t see the forest, so to speak now we&#8217;re so close to the trees.<\/p>\n<p>Michael Veazey 23:35<br \/>\nYeah, you can&#8217;t see the wood for the trees. Now. That&#8217;s totally an issue for all small business people, I think. And it&#8217;s, that&#8217;s one of the reasons why masterminds was so valuable. And these guys in its q4, I had a meeting on Wednesday with people like one of the guys doing 7 million euros a year. And you know, he&#8217;s flown over from Europe to come to this mastermind, but he&#8217;s out of the office ICC, good thing because he&#8217;s thinking bigger term, longer term, bigger picture. And that should be his job. So actually, there&#8217;s a great value in stepping away from these things. So let&#8217;s talk about them so that the value of the outsourcing versus the cost of the cost is one barrier. The other one is the trust thing with reason, because you don&#8217;t always get great people, right? And if you hand over something to somebody, and they don&#8217;t do well, that tends to be in some cases, that&#8217;s the nail in the coffin for people are tried outsourcing ones didn&#8217;t work. So obviously, this is a primitive approach. But I&#8217;m just reflecting, you know, some of the reality that people seem to bring up. So the critical question that&#8217;s then is, how do you find good people?<\/p>\n<p>Aaron O&#8217;Sullivan 24:29<br \/>\nYeah, so I think it&#8217;s is a common challenge across, you know, so many, you know, online businesses they&#8217;ve had, or they&#8217;ve heard nightmare stories around outsourcing, it&#8217;s just an area, which just seems like a huge benefit. And I don&#8217;t know how to start taking chunks out of it. So I think it&#8217;s crucial to get started with first and foremost identifying, you know, where you need help. So, again, I&#8217;m going to keep going back to it. But understanding where you&#8217;re spending your time on the time tracker is going to give you that information, which basically, right, the job posting or the thing you need to hire for, that&#8217;s a simple way to look at it. And I feel that if you do have a company, which has a clear mission of where you&#8217;re going, and what&#8217;s important in terms of, you know, company priorities for the year ahead of the quarter, and strategic planning in place, you can be clear that went to become steps into your company, they&#8217;re going to be absolutely clear on what the company is about what it stands for, what to expect, you know, what role they&#8217;re going to be filling, and what the outcomes they&#8217;re responsible for, it starts back kind of far back, if you&#8217;re bringing somebody you know, in house, you know, or full time, then you know, that&#8217;s what you&#8217;re going to need to set you up to have that that higher, be most productive and come on into your business with the meat that the most amount of success. If you&#8217;re just hiring our process or part of that, then, you know, granted, you won&#8217;t have to have that strong of a foundation in place in terms of your strategic planning, you know, where you&#8217;re going for the year, quarters month, and so forth. But that does really, really help. It starts off with having clarity around that having clarity around the role that you&#8217;re you&#8217;re hiring for, and having a clear, structured hiring process in place to filter out the people that, frankly, are a good talkers, but are not good, you know, doers. Interesting. So I guess my question implied, what&#8217;s the hiring process? And your answer implied why you call your business systems and culture impact, as opposed to just systems.com, or whatever you might call it, because I think what you just said, is really critical that you&#8217;ve got to have a clear mission, that have a strategic plan, what&#8217;s your company stand for? What&#8217;s the role about what outcomes they want? And actually, this is to flip it on its head, I would say my experience of outsourcing as somebody that is not naturally very structured, but appreciate structure. It&#8217;s funny, because my background is classical musician I was to conduct to say, you know, and penis, so they&#8217;ve definitely quite anal and structured about things. And yet, kind of in the end of the day, we&#8217;re action-oriented and all that. And then process oriented. Well, I am and but the act of having to outsource to somebody means you have to articulate this stuff. And I think sometimes the act of articulating it is actually the true value. You might hire somebody who turns out to be a disaster, but going through the process of having to articulate what are we actually trying to achieve? When I&#8217;m thrashing around on the computer on a spreadsheet for 10 hours a week? Why the hell am I doing that? Actually, you might discover, it&#8217;s like the Tim Ferriss thing, eliminate before you delegate, you might discover that what you&#8217;re doing is pretty valueless. And he shouldn&#8217;t be doing it at all. That&#8217;s<\/p>\n<p>Michael Veazey 27:33<br \/>\nreally valuable, right to discover that I think, but also what you just pointed out, and that&#8217;s more mundane, most people don&#8217;t do it. But at least in theory, we get that, but what you just pointed out is more critical. If you don&#8217;t know what you stand for. If you don&#8217;t know what the role is about why do customer service, what outcome do you want? Then there&#8217;s no way anyone&#8217;s going to do well, and that includes yourself, right? And when you hire somebody, it becomes more obvious. But that&#8217;s been a problem all along. And I would say it&#8217;s trying to spot lights on what the hell you&#8217;re doing all day anyway. So yeah, I really like the fact you brought that up, it&#8217;s really critical.<\/p>\n<p>Aaron O&#8217;Sullivan 28:07<br \/>\nAbsolutely. So you know, in terms of tactics of hiring, first and foremost, it starts with having clarity on what role you need to fill, you know, where do you need help, and the fastest way to do that is to be able to track your time. You know, if you do a download of all the things you&#8217;ve done over the last two weeks and look at your to do list that&#8217;s going to give you a great clarity of oh my god I&#8217;m doing all this stuff and it&#8217;s just driving me mad is keeping away from x y&amp;z you know, grow my business launching new products, and that&#8217;s where it starts that helps build your you know, if it&#8217;s your first hire, then that helps build the the outcomes of that new hires going to be responsible for. So we&#8217;ve always used scorecards, which is outcome based, kind of like for it&#8217;s from a book, which is called top grading is a great book, it&#8217;s, it&#8217;s been used across, like, huge organized, on how to effectively hire a players. And we took the scorecard concept from that, which is basically just talking about the specific outcomes, this person is going to be responsible for, you know, what are the kind of requirements that they needed to fulfill the role? And what is their role gonna kind of entail? So we use that in terms of our the beginning part of our hiring process, we obviously have a job posting, which is raising people&#8217;s interest in the role, you know, which is people, frankly, you know, they want to know what&#8217;s in it for them, right. So what will they get is, you know, you need to appeal to that with people in a job posting, when they apply, takes them to a scorecard takes them through a bunch of questions, we usually have them do kind of a one and done task, which is a great way to filter. If I if I talk about this in filtering through all the applications you get on different levels, you&#8217;re going to end up with a few candidates, which are really aligned with the outcomes that you&#8217;re looking to achieve, and also alignment of your culture or company culture. That&#8217;s going to be the context there. Does that make sense?<\/p>\n<p>Michael Veazey 30:11<br \/>\nYes, it does. And just to reflect back, because I think this is critical stuff that people need to hear. And, by the way, if you want show notes for this, then we&#8217;ll figure out how to put them up just for the moon go to amazing fba.com forward slash Aaron a. And if I&#8217;ve got the right is Aaron with an O, isn&#8217;t it, not a threat to them. So and obviously will be getting a new blog up for the new podcast as well. We&#8217;re in sort of transition stage. But this sort of thing can be useful to see written down. But just to reflect back for those who are listening in the car and need to get this stuff, you got to clarify the role. And the best way to do that is look at your time tracking for last few weeks and look at your to do list. And if there&#8217;s a gap, I guess between your I want to do this, but I&#8217;m doing this that&#8217;s that&#8217;s obviously a big hint, I guess, and then have clear outcomes. And I&#8217;ll let the scorecards from the top grading book sounds very interesting. Get the very specific outcomes requirements for the role and define the role. And then the job posting is to raise interest and what&#8217;s in it for me as that question, when you apply the have quite a few questions, I guess, normal enough. So I wanted to ask about the what questions to ask. But before I do that, what&#8217;s this one and done task? How does that work?<\/p>\n<p>Aaron O&#8217;Sullivan 31:13<br \/>\nYeah, so great question. So what I will say is, if anyone wants to see actual job posting that we have on our website, you can go to our website and find that it&#8217;s under join our team, you can just see our process in there, of what that looks like, let me that&#8217;d be super helpful for guys. And gals listening in terms of you know, how we have a job posting, and we use a type form, we&#8217;ve we&#8217;ve automated our process with that. So we have a job posting, then type form. And within that type form, we extract all the questions and get all the information we need around the application. And in that has the the scorecard embedded, and all the referrals we need. And it also has a one and done task. So let me on that fresh, short second. So in terms of our wanting done task, it&#8217;s a task which they can complete pretty quickly, which is going to give you a lot of, you know, a lot of info around the type of person that has responded. So an example that we had, we had a for the customer service, it was getting ready for a customer love manager, somebody who&#8217;s going to be able to manage a lot of customer service agents. So the question we had in that case was, I&#8217;m staying at this hotel in London, I think it was the Shangri La in London, and I need 1000 letters, I need to deliver 1000 letters to go out International, can you find the the nearest post office to my hotel and give me directions? That&#8217;s something of that nature. So it tells and this is what I&#8217;m talking about, you know, quick ways to filter through all of the applications. And that&#8217;s what top grading does? Well, you know, the concept of hiring from top grading. And this is one of the first filters, the application basically is set up. So if we don&#8217;t have people fill it out, or if people don&#8217;t provide referrals, or if people don&#8217;t give us a you know, anywhere near a good enough good enough answer for the one and don&#8217;t ask, they don&#8217;t you know, get through to the next stage of the hiring process. Some people were just answer shorter, I&#8217;ll get back to you. And that was it. Some people will go through the the effort of creating step by step instructions. So let me exactly where I&#8217;m walking, give me screenshots from Google Maps, of where to find out post office and was just delivered in a really high, high level way in terms of, you know, customer service, because it was a customer service as well. So immediately, when I, you know, I was scanning for all these applications in type form, when once they&#8217;ve been weird, like 60 or 70. I was scanning for all of these, and then ones that were that was kind of the first thing I&#8217;d look at is how they filled in the fall and how they answered the question. If they didn&#8217;t answer it, well, then I just, you know, in our automation, I&#8217;ll just move over to unsuccessful and then they get an email sent out which says we&#8217;re sorry, didn&#8217;t make it through to the next round. Thank you so much for applying. If they made it through, they&#8217;d be moved over in our project management software to the next stage. And they would have a skills and aptitude test sent to them automatically. Does that make sense? Yeah. Don&#8217;t overcomplicate it too much. No, no.<\/p>\n<p>Michael Veazey 34:22<br \/>\nBut it sounds pretty charming. To me, it sounds fairly straightforward. But I mean, if the trick is, as I was saying, I&#8217;m saying that 10 k collective mastermind the other day that I mean, it&#8217;s like in the music profession, we audition, we don&#8217;t interview. So I mean, like, if you want to go for a job as a pianist somewhere, or I speak French horn player professionally in orchestras, as you do, unusual background from Amazon seller, but you&#8217;ll come from all different walks of life. And you know, you don&#8217;t go in there and have a chat for half an hour about how you would play this phrase, you go in and say, Hi, how are you? Good. See, it&#8217;s like 10 second conversation. And then here&#8217;s the music go. And then if that crap, you can tell instantly, if they good, you put them into the auction for trial, which is something else you want to talk about. And you might be on trial, a job an auction for a year, and maybe two or three other people up for the same job. And then they pick one or they didn&#8217;t think anyone was good enough. They pick nobody. But it&#8217;s all about how do you deliver in an individual situation like this, like on a task? And then how do you deliver in the team? And then it comes down to? Can you deliver on all the conversations are pretty relevant, because you&#8217;re not being asked to talk to people anyway. So in a lot of ways, I think it&#8217;s very familiar territory for me, and then it&#8217;s a very tried and tested thing. So I really like the fact there&#8217;s based around that, that we can talk about the skills and aptitude test in a second. But I mean, tell me a little bit more about what I&#8217;ve just talked about. I mean, for me, the idea that you have two or three people traveling for a job, and then you pick one is standard for the music industry, specifically the classical music industry to funnel them world that happens to be familiar to me. Is that something you do? Do you think that&#8217;s too brutal? Do you think that&#8217;s too confusing? What what&#8217;s your view on that?<\/p>\n<p>Aaron O&#8217;Sullivan 35:49<br \/>\nOh, what so when? No, it should be a tough decision, you know, when you if you&#8217;ve done this correctly, and you&#8217;ve got the applications come in, there&#8217;s going to be a small percentage of the people that are going to be fitting, you know, fits in your culture, you know, you need to hire for culture. First, as you know, that&#8217;s kind of become cliche, but it&#8217;s so true, either, you know, the attitude that the person has, and obviously, they need to be competent in the role and they need to be capable, for sure. In terms of the question you asked, it should be tough to make a decision on who you&#8217;re going to bring on to your company, for sure. And if it&#8217;s not, you know, if you don&#8217;t have two or three people to compare, and I think you need to revisit the process of the steps beforehand. So it should be difficult, because what people tend to do is just hire somebody, they don&#8217;t run through, you know, a filtering process, I&#8217;m just going to give you the context, again, in terms of the stages of the hiring. So it&#8217;s clear, which is what we&#8217;ve used. And there&#8217;s a number of ways to do it. So what we do is we create, we post the job posting, which is has the scorecard involved and basically retrieve all the information from their previous employers, there is kind of like a plan their work history, they post references, and they give us a one and done task. That&#8217;s the first day. So if we have 60 applicants in that, I can quickly scan through each one and say, Well, this person, I don&#8217;t even have to read through half of them. Because, you know, if they did a terrible job in filling out the form, then I just know that it&#8217;s not going to work. So that&#8217;s the first stage, the second stages, you know, having them go through a personality test or skills and aptitude test, which is really great way to find out, you know what, what they&#8217;re competent in. So if it&#8217;s a customer service based role, you can quickly find free tests, like 16 personalities to tell you what kind of person they are, there&#8217;s a great one called criteria Corp, which is what we use, which is more higher level, but it is there&#8217;s isn&#8217;t some yearly thing that you pay for. But it&#8217;s incredible. It&#8217;s created by guys in Harvard. And it&#8217;s like, it tells you, you can have a customer manager, customer service based skills and aptitude tests, we get the results back from that, and that is very telling. And then the people that have made it through that, then we say, Okay, the next is a 15-minute interview, if they pass that, and it&#8217;s a an hour tandem interview with know me a business partner, or and another team member, and or another team member. And then you know, at that point, you should have two or three people that you&#8217;re, you know, trying to make a decision on. Does that make sense?<\/p>\n<p>Michael Veazey 38:24<br \/>\nYeah, it does. So just to just to clarify, then the overall process is great stuff, by the way, I really like this very structured show is good. Stage One is that basically fill in the type form. So it&#8217;s the scorecard referrals, job history, and the one and done task, which you&#8217;ve explained really nicely. Second Stage is for those who make it through the aptitude and skills test. Stage 315 minute interview stage for tandem interview, I&#8217;ll I&#8217;ve never heard of that. Bicycle made for two and interview made for two. I like it. And then yeah, you got so you ended the end of that you have you have what two or three really qualified candidates. What do you do then about this, come back to this idea that I had, because it&#8217;s not just me that does this, though somebody else was saying in the group, you know, hire for fire three key one, I mean, it&#8217;s a bit brutal to go in knowing that that might happen. But do you advocate or use the thing of giving people trial periods, and do you trial more than one person for the same kind of job,<\/p>\n<p>Aaron O&#8217;Sullivan 39:18<br \/>\nthe way you should kind of always hire if you&#8217;re bringing somebody into your business, you&#8217;ve got you put them through this rigorous hiring process, which we just talked about, you know, job posting scorecards, skills and aptitude test, 15 Minutes interview, one hour tandem interview with another, you know, two or three team members. And that should get you somewhere near. And if you&#8217;ve got somebody come into the team, you&#8217;re going to want to know how they perform within the team and how everybody else feels about them as well. So I would recommend having, you know, two other two weeks to get to get you&#8217;re going to say we&#8217;re going to try it for two weeks. And if things are good, then we&#8217;re going to then extend that with three months probation period where we&#8217;re, we&#8217;re seeing how we work together, and then we&#8217;re just rolling after that. So it&#8217;s important that you clarify that up front to them, you know, and give that visibility ahead of time for sure. But usually, if you if you&#8217;ve done this, right, and if you&#8217;ve gone through that process, which I&#8217;ve just explained, then you&#8217;re going to be you know, somewhere very near<\/p>\n<p>Michael Veazey 40:19<br \/>\nYeah, yeah, I&#8217;m going to one of the reasons why I suppose people have to be sort of brutal in, I would not have to be choose to be rather sort of crude and higher, I&#8217;m going to have just literally hire three people for the same kind of role is to granted work. But the same kind of tasks, I guess processing before just as a trial, but like I said version of your one and done thing. But yeah, if you have to hire a lot of people, and then fire a lot of people, it probably doesn&#8217;t mean you&#8217;re not filtering people out that effectively. It&#8217;s sort of filtering at the end rather than early in your process sounds like it&#8217;s pretty thorough. So you&#8217;re trying to filter out people early on. And also if you&#8217;re very clear about your own culture and the role, and what you need is outcomes. And then you communicate that clearly, which is two different forms of art, get good I guess then that also helps drive you clear in your own mind. If you&#8217;re clear to other people either have a structured process to get to the people who are doing that. I guess by the time you&#8217;ve done all that you shouldn&#8217;t need to you know, be firing people left right and center all the time anyway. And as you said, if you got a two-week tryout, and then a three-month trial, it&#8217;s gradually committing over time rather than like we&#8217;ve done this now we&#8217;re in.<\/p>\n<h3><strong>Watch my full interview with Aaron O’Sullivan<\/strong><\/h3>\n<p>[video_page_section type=&#8221;youtube&#8221; position=&#8221;bottom&#8221; image=&#8221;&#8221; btn=&#8221;light&#8221; heading=&#8221;&#8221; subheading=&#8221;&#8221; cta=&#8221;&#8221; video_width=&#8221;1080&#8243; hide_related=&#8221;false&#8221; hide_logo=&#8221;false&#8221; hide_controls=&#8221;false&#8221; hide_title=&#8221;false&#8221; hide_fullscreen=&#8221;false&#8221;]https:\/\/www.youtube.com\/watch?v=Su-fEZ3tHpY&amp;feature=youtu.be[\/video_page_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_009-arron-pt1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Foutsourcing-ecommerce-company-culture-with-aaron-osullivan%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-5\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_009-arron-pt1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9668-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_009-arron-pt1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_009-arron-pt1.mp3\">Download<\/a> (Duration: 42:20 &#8212; 29.1MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_009-arron-pt1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Foutsourcing-ecommerce-company-culture-with-aaron-osullivan%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-6\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_009-arron-pt1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9668-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_009-arron-pt1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_009-arron-pt1.mp3\">Download<\/a> (Duration: 42:20 &#8212; 29.1MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 42:20 &#8212; 29.1MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 42:20 &#8212; 29.1MB)Subscribe: Spotify | Email | TuneIn | RSS<\/p>\n","protected":false},"author":1,"featured_media":6618,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1550],"class_list":["post-9668","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Outsourcing ecommerce &amp; Company Culture with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Outsourcing ecommerce &amp; Company Culture with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 42:20 &#8212; 29.1MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 42:20 &#8212; 29.1MB)Subscribe: Spotify | Email | TuneIn | RSS\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-06-21T05:00:43+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-29T07:52:26+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"45 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Outsourcing ecommerce &#038; Company Culture with Aaron O’Sullivan\",\"datePublished\":\"2019-06-21T05:00:43+00:00\",\"dateModified\":\"2020-06-29T07:52:26+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/\"},\"wordCount\":9388,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/\",\"url\":\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/\",\"name\":\"Outsourcing ecommerce & Company Culture with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-06-21T05:00:43+00:00\",\"dateModified\":\"2020-06-29T07:52:26+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"outsource for e-commerce with freeup on the 10K Collective Podcast with Amazing FBA Podcast for Amazon Sellers\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Outsourcing ecommerce &#038; Company Culture with Aaron O’Sullivan\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Outsourcing ecommerce & Company Culture with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/","og_locale":"en_GB","og_type":"article","og_title":"Outsourcing ecommerce & Company Culture with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 42:20 &#8212; 29.1MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 42:20 &#8212; 29.1MB)Subscribe: Spotify | Email | TuneIn | RSS","og_url":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-06-21T05:00:43+00:00","article_modified_time":"2020-06-29T07:52:26+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"45 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Outsourcing ecommerce &#038; Company Culture with Aaron O’Sullivan","datePublished":"2019-06-21T05:00:43+00:00","dateModified":"2020-06-29T07:52:26+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/"},"wordCount":9388,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/","url":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/","name":"Outsourcing ecommerce & Company Culture with Aaron O’Sullivan - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","datePublished":"2019-06-21T05:00:43+00:00","dateModified":"2020-06-29T07:52:26+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"outsource for e-commerce with freeup on the 10K Collective Podcast with Amazing FBA Podcast for Amazon Sellers"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/outsourcing-ecommerce-company-culture-with-aaron-osullivan\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Outsourcing ecommerce &#038; Company Culture with Aaron O’Sullivan"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k009.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2vW","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9668","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9668"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9668\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6618"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9668"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9668"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9668"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}