{"id":9670,"date":"2019-06-17T18:40:38","date_gmt":"2019-06-17T17:40:38","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6597"},"modified":"2021-06-29T11:21:34","modified_gmt":"2021-06-29T10:21:34","slug":"business-credit-for-small-business-with-bruce-mack-of-platinum-financing","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/","title":{"rendered":"Business Credit for small business with Bruce Mack of Platinum Financing"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_007-bruce-pt1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fbusiness-credit-for-small-business-with-bruce-mack-of-platinum-financing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_007-bruce-pt1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9670-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_007-bruce-pt1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_007-bruce-pt1.mp3\">Download<\/a> (Duration: 39:43 &#8212; 27.3MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_007-bruce-pt1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fbusiness-credit-for-small-business-with-bruce-mack-of-platinum-financing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_007-bruce-pt1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9670-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_007-bruce-pt1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_007-bruce-pt1.mp3\">Download<\/a> (Duration: 39:43 &#8212; 27.3MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><!--more--><\/p>\n<h1>Business Credit for Small business Amazon sellers<\/h1>\n<p>This show is focused on those who already have revenue, and know how to do the basics and want to grow and are ambitious. And one of the things you need to do is money because this is an inventory based business. And that means it&#8217;s capital intensive. Business credit for small business can be a solution to this.<\/p>\n<p>There have been many, many discussions at the 10 k collective mastermind around the question: &#8220;How do I get more money to fund my business?”<\/p>\n<h2>What is Platinum Financing?<\/h2>\n<p>The man to answer that question is Bruce Mack of Platinum financing Group, a financial consulting company that primarily funds clients.  Bruce has a huge background in finance: He is a financial advisor, a speaker, a trainer. He was even a banker in his past life, so incredibly qualified to talk on this subject.<\/p>\n<p>Bruce has Worked with a number of small business owners  in the FBA space to get them business credit, including the first FBA seller to have $1-million day on amazon.<\/p>\n<p>He is also a passionate skiier and was a ski instructor, which is one of his motivations in business.<\/p>\n<p><b>UK based small business owners with LLCs &#8211; can they get corporate credit?<\/b><\/p>\n<p>Yes, they can get domestic (US) funding regardless of where they are in the world &#8211; up to $50K in Domestic (US) business credit.<\/p>\n<p>They would need to file for EIN number. Then consultants can work with them on small lines of credit<\/p>\n<p>Then using credit cards up to $25,000.<\/p>\n<p><b>For USA based people<\/b><\/p>\n<p>$200K Credit is easily achieved.<\/p>\n<p>They have Revolving lines of credit up to $75-200K<\/p>\n<p>They can stack those and often get up to another $100K<\/p>\n<h2>Other business credit programmes if a business owner and have track record<\/h2>\n<p><b>What are the forms of business credit that one can get as a small business owner?<\/b><\/p>\n<p><b>Revolving lines of credit programme <\/b><\/p>\n<p>Additional credit cards<\/p>\n<p>Mix of business and consumer cards<\/p>\n<p>At zero% APR for up to 21 months.<\/p>\n<p>Licensed financial advisor &#8211; worked with MasterCard and Visa<\/p>\n<p>If you want just one credit card, you don’t need Bruce or Platinum Financing.<\/p>\n<p>But if you need 8-12 cards, you need him. Making multiple enquiries at same time, whole thing will implode.  There’s an order and logic to flow, otherwise you’ll get declined 100% of the time &#8211; and probably damage your credit rating in the meantime.<\/p>\n<p>There is no term to pay it back. Monthly minimums for years (revolving)<\/p>\n<h2>Contact details for Bruce Mack<\/h2>\n<p>bruce@platinumfinancinggroup.com<\/p>\n<p>Tel.: (720) 371-2345<\/p>\n<p>Times: West Coast (CA), generally gets into office 9 am. Call 9 am-7 PM Pacific time. Or text.<\/p>\n<hr \/>\n<h2><span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\">Transcript<\/span><\/h2>\n<p>Ladies and gentlemen, welcome to the show. This is your host, Michael Veazey, with more wonderful knowledge for advanced or at least the moving Amazon sellers. This show is focused on those who already have revenue, and know how to do the basics and want to grow and are ambitious. One of the things you need to do that is money or funding, because this is an inventory based business. And that means it&#8217;s capital intensive.<\/p>\n<p>There have been many, many discussions that I&#8217;ve had at the 10 k collective mastermind, where one of the major topics is how do I get more money to fund my business.<\/p>\n<p>So the man to deal with that is Bruce Mack of Platinum financing Group, a financial consulting company that primarily funds clients. Bruce has a huge background in finance: He is a financial advisor, a speaker, a trainer. He was even a banker in his past life, so incredibly qualified to talk on this subject. So Bruce, warm, warm, welcome to the show.<\/p>\n<p>Bruce Mack 1:46<br \/>\nThanks so much, Michael. I really appreciate being invited to your show and look forward to chatting with all the folks that are on the podcast and what have you and give them some great information that they can take to the bank. Pardon the pun.<\/p>\n<p>Michael Veazey 2:02<br \/>\nIdea bad puns already. It&#8217;s that kind of show.<\/p>\n<p>Unknown Speaker 2:05<br \/>\nYeah, it&#8217;s good. I like it. So Bruce, tell<\/p>\n<p>Michael Veazey 2:08<br \/>\nus a bit more about yourself. And I know you were just sharing with me that you just been skiing. And you had a bit of a sports injury but have less than exciting kind. So in your amount of action. Tell us a little bit more about yourself your back I know it&#8217;s a bit of a full of figure for Bruce the man as well as the finance here.<\/p>\n<p>Bruce Mack 2:23<br \/>\nOkay, so So now you&#8217;re already starting. I think we&#8217;re into this now for what, 20 seconds, and you&#8217;re embarrassing me, I&#8217;m already probably turning red in the face.<\/p>\n<p>So I was was telling Michael, they said how&#8217;s things going? I said, Well, I said to be honest with you, my I think you call it a bum right? my bum is killing me, says my my left hand. I used to teach and race. I love to snow ski. And it&#8217;s my passion. I mean, every you know, we all do it for a reason. And my reason or my Why is to be able to take a day and cut work and live live the laptop lifestyle and go and do and be where I want to be and where I want to be when there&#8217;s snow is up in the mountains skiing.<\/p>\n<p>So I was up at a place called Mammoth Lakes, California, it&#8217;s about five, five and a half hours from Los Angeles. And the mountain is fantastic. And they just had over three feet of fresh new snow. And I wanted to time it right. And timing it right meant after one storm and before this next storm coming in. And that meant I go up on Saturday, and I ski Sunday and Monday and beat it back to the office by only cutting work for one day. So I&#8217;m up there, and I&#8217;m having a good time. And I&#8217;m not falling. I&#8217;m just you know, everything&#8217;s good.<\/p>\n<p>I&#8217;m walking right back to the car. I&#8217;m in the parking lot. I see that car. I&#8217;m 10 feet away from the car. And the next thing I see I see my feet going right over my head. The parking lot was a sheet of ice. I fell on my arse.<\/p>\n<p>Michael Veazey 4:12<br \/>\nYeah, I suppose we say &#8220;bum!&#8221;<\/p>\n<p>So getting back to the point. So you obviously are a man of great action. And you know, unfortunately, some of the action in the car park. That&#8217;s the exciting, but I love the fact that you&#8217;re a very physical, entrepreneurial people are are often like that it seems very sporty and very goal oriented in their hobbies as well, a lot of other people that I know. So we must be into cars and car racing, drag racing, whatever it is. So yeah, fantastic to meet somebody who&#8217;s got some passion for life outside of Finance.<\/p>\n<p>But tell us a little bit more about that the whole topic of Finance.<\/p>\n<p>The first thing is to say that it&#8217;s a big, big need that I come across repeatedly. And the bigger the sellers Ironically, the bigger the need for money. Because a lot of people miss that at the beginning stages. They think I&#8217;ll the better my businesses, the last man I&#8217;m going to need and sure that can work that way. But tell us a little bit about your experience festival working with ecommerce sellers or physical product sellers generally, how does that need for funding manifest itself?<\/p>\n<p>Bruce Mack 5:07<br \/>\nWell, that&#8217;s a that&#8217;s a great question, Michael.<\/p>\n<p>I&#8217;ve been in in the financing arena for decades and work with countless thousands of people helping them either with startup capital capitalization means in your existing businesses with cash infusion so that they can take their business to the next level. We work with a lot of different verticals. But a couple of the verticals that we found to be that are big niches that we&#8217;ve been able to be extremely successful with that particular type of individual has been real estate investors because there&#8217;s an ongoing and chronic need for money for people that are doing foreclosures for people that are acquiring properties for people that are you know, they just always seem to need a lot of money.<\/p>\n<p>Another major market a niche that we&#8217;ve been extremely successful with, is working with FBA types of folks, people that are in your space people that are buying and selling on Amazon and and or eBay or what have you. Because the interesting part is that I keep getting told from the students that we work with, is when you find and you&#8217;re able to mine out data mine out what have you, a winner, one that you know a object that is clicking and that you may want to take an offshore it or what have you. It&#8217;s how quickly can you get your your product to market?<\/p>\n<p>And how can you get as many of those widgets gadgets or gadgets that you can get and warehouse them so you can send them out. And if you can&#8217;t get those widgets, gadgets and gadgets in the warehouse to be able to send out, then that&#8217;s last opportunity cost. And it&#8217;s an unfortunate thing because the the FBA world moves so quickly, that you need to be able to capitalize on them as as quickly as possible. And that&#8217;s one of the things that cash and cash infusion can make such a global difference in is to be able to get the inventory that&#8217;s required, so that you can make the sales so that you can make those great margins.<\/p>\n<p>Michael Veazey 7:28<br \/>\nAbsolutely, you put your finger on the the key word that I heard from that is opportunity cost. I think that&#8217;s one of the things that when people go out to stock on Amazon, and one of the reasons they might go out of stock is under-capitalisation because, you know, there&#8217;s a few reasons they may not have predicted demand, etc.<\/p>\n<p>But often people are stingy, if you like that they&#8217;re cautious with the amount of inventory, they stopped because of a lack of cash and that they miss out on out of stock. And if you&#8217;re out of stock on Sunday, that&#8217;s selling $10,000 a month. And that&#8217;s quite small for the q4 in an amazon.com. In America, certainly, then, you know, if you&#8217;re out of stock for three months $30,000 of lost sales plus or the last ranking, or the last reviews you could have been gaining in the meantime, your competition is doing all the rest.<\/p>\n<p>So 100% I mean, this is a major, major major block to a lot of people. So yeah, I think you&#8217;ve got your finger on the pulse very much.<\/p>\n<p>Let&#8217;s get into some details. And first of all, let&#8217;s deal with the question because a lot of people listen to podcast. This is a new venture. So I imagine if it reflects the amazing FBA podcast. By the way, this is kind of a blend because I want people to know to completely run away from using FBA still me it&#8217;s still the same kind of set of context. But the focus is different for 10K collective.<\/p>\n<p>We don&#8217;t know but I imagine it&#8217;d be a lot of Americans listening and a lot of Brits too. So let&#8217;s differentiate between what the things you can you and your company can help with Brits within the the topics you know about.<\/p>\n<p>First of all, can UK based individuals get funding at all in America if they&#8217;re wanting to expand their FBA businesses there?<\/p>\n<p>Bruce Mack 8:53<br \/>\nOh, okay. The answer is, yes, we do have a program for Brits, as you put it that would like to be getting money to drive their business forward, we have a corporate credit program for individuals. And they can they can live in Britain and continue their business in Britain.<\/p>\n<p>There&#8217;s a little twist to that, the twist would be that they would establish a business, which is very inexpensive, establish a business in the United States, and then we can get them credit, we can get them, generally speaking, well, our guarantee is to get them a minimum of $50,000 worth of credit.<\/p>\n<p>That&#8217;s a minimum guarantee, I&#8217;ve seen in many cases, us getting 100, hundred and 50 or more for individuals. And the reason that we can do it is once they have established a business, we can use that as a threshold, to begin to getting open lines of what&#8217;s called trade lines credit, and then build upon that, until we get other types of credit, so that they can use that that type of credit for open to buy. Matter of fact, we&#8217;ve been one of the interesting, one of the clients that we get people credit with is actually with Amazon.<\/p>\n<p>So that&#8217;s interesting as we go through the credit building process with the individuals. So the credit can be used anywhere in the world, it&#8217;s strictly a simple scenario of establishing a business domestically, to be able to start to do the credit building process.<\/p>\n<p>And it has nothing to do with what&#8217;s called here in the United States one&#8217;s FICO score, which is their Fair Isaac score, which is their credit score, and it also has nothing to do with their social security number. So it is totally strictly based on their EIN, which is their employer identification number, how we go about building that type of credit from ground zero.<\/p>\n<p>Michael Veazey 11:04<br \/>\nWow. Okay, interesting. So let me just reflect a few things back, I&#8217;m just a firm to plan and started making notes on a notepad because I was thinking, I was trying to focus on the interview and not be fiddling around with notes. But I&#8217;ve got to get my head around this. And that helps my listeners get their head around it as well.<\/p>\n<p>So first trade line credits. So that&#8217;s based, let me just check one thing first, because this is obviously a critical distinction between different flavors of debt. Is that dependent on putting your your personal property like your house as collateral? Because obviously, that can be one of the big things that makes a difference to a lower?<\/p>\n<p>Bruce Mack 11:36<br \/>\nAnd that&#8217;s a great question. People oftentimes asked me, they say, well, is the credit that you get for your folks secured? Or is it or is it unsecured, the types of credit that we&#8217;re going to be focusing on for today&#8217;s call, are all going to be what&#8217;s considered to be been secured, meaning no security pledge, meaning no collateral ization, or cross collateral ization?<\/p>\n<p>Everything is done on a signature. And that&#8217;s the only way that we would be discussing or that&#8217;s the only type of I should say, credit that we&#8217;re discussing, and or funding availability, to say nothing to do nothing to do with any type of collateral ization?<\/p>\n<p>Michael Veazey 12:20<br \/>\nobviously, it&#8217;s going to be a lot harder for anyone to police that and if you got UK based residents and had to personally come over and repossess their personal property that could get tricky. So yeah, interesting. That&#8217;s going to be music to people&#8217;s ears; normally , my experience with, you know, with most of the 10K collective [mastermind] members or people of that ilk, if they&#8217;re going to take a substantial loan over, say, $100,000, it tends to be collateralized, although I must just double check, what is cross collateralized? That sounds like a terrible disease? What is that in real life?<\/p>\n<p>Bruce Mack 12:49<br \/>\nWell, you never would want to catch grace collateral ization, because it spreads! Now, what does it mean in English, in normal words, in English, cross collateral ization means, well, let&#8217;s just talk about it from a real estate perspective, this, this, this will be a good example.<\/p>\n<p>Let&#8217;s just say I want to buy a property. And I&#8217;ve been told that not only do I have to have good credit, but I have to cross collateralized, or pledge sign a note saying that in the event, that I do not make payment on the new property that I&#8217;m getting funding for, that you are given the right to take one or more of my other properties that I currently own.<\/p>\n<p>So that&#8217;s using collateral as a way to securitize the credit that&#8217;s being given to you. And this could be other things other than real property. I&#8217;ve seen across collateral ization work with things like people&#8217;s jewelry, collections, stocks, bonds, and other types of equities and or valuable items. So it doesn&#8217;t necessarily need to be property. But in most cases, it usually does mean property.<\/p>\n<p>Michael Veazey 14:09<br \/>\nOkay, interesting. So that makes a lot of sense. So it&#8217;s another way basically, if it&#8217;s security for the bank or not, for us as the people taking the loan.<\/p>\n<p>That sounds like good news. So to summarize, then you could probably lend a Brit at least $50,000 USD. So Brits, &#8211; I don&#8217;t know what to call people &#8211; UK based people. I mean, you know, whatever the right word is people in the UK, I mean &#8211; they&#8217;re going to be able to get at $50,000, possibly more hundred, maybe even 150,000, unsecured funding, based on a trade line credit.<\/p>\n<p>So just to clarify what is trade line, because I think one of the things I want to get from an expert like yourself is to get people an overview of the terminology that they need to understand, you know, your perspective as a lending person, and to start to speak the language and know the different nuances.<\/p>\n<p>So what is a trade line, as opposed to say, a line of credit? Or presumably, it&#8217;s a special type of a line of credit? And how is that different from, say, credit card?<\/p>\n<p>Bruce Mack 15:03<br \/>\nOkay, well, let&#8217;s start off with talking about the the program I started to jump into, which is the corporate credit program, the basis or ground level type of credit that folks are getting our trade lines, companies that are here in America, such as a let&#8217;s just take you line, there, an office supplies company, and they will pretty much open up anybody who can fog a mirror, if they had the right credentials, which of course, we help people get the right credentials, and they will be given several hundred dollars worth of credit.<\/p>\n<p>And a client, which we teach, when they&#8217;re assigned out to one of our coaching staff there, they&#8217;re taught to make some minimal purchases. And of course, to make payments on those because what ultimately is going to happened is that the person is going to start to increase what&#8217;s called their paid x, which is their Dun and Bradstreet and Intel, a score, which is from Experian, those scores are going to increase over a period of time based upon their payment track record.<\/p>\n<p>So when they get their open to buy, they make a purchase, and then they pay on that purchase. And they pay on that purchase within the first 10 days of receiving that notification.<\/p>\n<p>Now, that&#8217;s critical, because these corporate credit companies look to see when you pay with a credit card, you don&#8217;t get anything good or bad happening. If you pay your credit card bill when you first get it. Actually, the only thing that happens, it&#8217;s bad is if you pay make your payment on a 30 day payment after 30 days, then you get hit with a derogatory because you have a 30 day delay, but you get no reward for paying early.<\/p>\n<p>That&#8217;s just not the case with corporate credit, they actually have a tool that measures if you make your payment within the first 10 days of the invoice on a net 30 basis of pay, you actually get the credit in that case of being what&#8217;s called and rated as a prompt pay, as opposed to the next bracket, which is that 10 to 30 days, which is a paid on time. And then the last bracket, which is a late pay.<\/p>\n<p>So we teach everybody to be a prompt pay, you get extra kudos for being an early or prompt payer. And that&#8217;s a good thing, we show you how to take these trade lines and stack them and over a period of several months. And repeated making minimal purchase is you then move up to the second level. The second level being things such as store cards for places such as Amazon, where you can buy anything, and you&#8217;ll be getting a multi thousand dollar open to buy.<\/p>\n<p>And this is a great thing to help you ascend towards getting the final goal. And the final goal is to be able to get credit cards that are $2500, $5,000, $10,000 credit cards or more.<\/p>\n<p>And this is where you&#8217;re at the highest level. And then you can be utilizing those cards for making inventory purchases to fuel and push and move your business forward at a rapid pace that that program is totally different from a couple of other programs, which I&#8217;m delighted to share with you if you want me to Michael.<\/p>\n<p>But those other programs are really for domestic based people because they do need to have a FICO and a social security number. For those other programs. Those programs are extremely powerful to that audience.<\/p>\n<p>Michael Veazey 19:12<br \/>\nGreat. Well, let&#8217;s address that we definitely definitely want to address that. But let&#8217;s just draw together, what you&#8217;ve just been talking about and maybe reflects as a sort of, I suppose informed amateur, I&#8217;m certainly no professional in credit, but just to make sure that we&#8217;ve understood and give people a chance to absorb this. So basically, we&#8217;ve been talking about corporate credit program, which applies to companies based in the US and the people who own those companies can be based in the UK, or the US or anywhere else. Is that fair summary?<\/p>\n<p>Bruce Mack 19:39<br \/>\nYes, but many of the corporate credit building blocks, those trade lines are domestic companies, but some of these companies that people will be getting credit with our international in scope. So it really depends, it really depends. And that&#8217;s one of the reasons that we have been successful with people that are for nationals that want to get going with corporate credit.<\/p>\n<p>Michael Veazey 20:03<br \/>\nOkay, well, so that&#8217;s in other words, it&#8217;s going to be a worth getting in touch. If in doubt, get in touch with with you guys or similar type of service. I mean, obviously, you guys know masses about this stuff.<\/p>\n<p>But just to summarize, there are basically three types of credit. There&#8217;s the corporates, trade lines, and it&#8217;s really critical and very, very helpful information to know how they get classified by these lending lending companies. So basically, you pay within 10 days you pay within 30 days, or if that&#8217;s what you&#8217;ve agreed is your payment term, or you&#8217;re late.<\/p>\n<p>And so it&#8217;s good to know that you get rewarded for early payment. And then the next level up is the store cards and things like that. And then credit cards, which is by the side of it much more flexible, because you can pay up to the the latest payment date without any penalty. So that&#8217;s the kind of summary in my understanding, is that accurate? Is there anything to tweak that?<\/p>\n<p>Bruce Mack 20:55<br \/>\nAgain, no, I&#8217;d say that you&#8217;re really spot on.<\/p>\n<p>I mean, with credit cards, you&#8217;ve got 30 day basis, open to make payment. And with corporate credit, though, you can take up to 30 days as you&#8217;re trying to establish your credit. And these are invoiced bills that have a what&#8217;s called net 30 basis, meaning you have to pay it within 30 days, it&#8217;s not a revolving line of credit like a credit card is.<\/p>\n<p>So again, we just caution people as part of the training process that you want to put your best foot forward. So you get the highest and quickest possible positive ratings. And one of the ways is to you, I tell people, you, you get an invoice, you pay the invoice, it&#8217;s that simple. Yeah, doesn&#8217;t get that way, it just doesn&#8217;t go into the standard payment. And certainly that doesn&#8217;t slip into being a late payment.<\/p>\n<p>Michael Veazey 21:50<br \/>\nYeah, interesting.<\/p>\n<p>So in a way, what it reminds you of is an Amazon seller is that basically in order to make a profit down the line on Amazon, we need to feed the algorithm, the elements enhanced, everything&#8217;s driven by an algorithm right these days, with the odd human intervention occasionally. But I know from my conversations with friends of mine who&#8217;ve worked in the financial sector in the UK, that basically most of the decisions are made by a credit score or some equivalent process.<\/p>\n<p>So basically, you&#8217;re feeding the algorithm, whereas an Amazon seller to try and get into rank your products. And then over time, while that when they do that, then gradually you can, you know, increase the price and stop spending so aggressively on them, and Amazon ads or whatever your traffic sources. And it feels like a similar process to me, and this is less familiar to most Amazon sellers.<\/p>\n<p>But it feels like the first thing to do is to please the algorithm at this case is the lenders build a profile that says yes, that&#8217;s a good person to lend to, and then gradually over time, then we can start to make that payoff in a more serious way. So that&#8217;s my Amazon seller centric understanding of the you know, making coming back to a familiar process for us. So<\/p>\n<p>Bruce Mack 22:53<br \/>\ntotally, totally agreed, Michael, actually, the the and to add to what you&#8217;re saying, There ranking just like you said, and it starts off at zero, and zero is just as zero does, it&#8217;s zero, and then 100, at being at the pinnacle, or at the top being the ultimate best ranking that you can get.<\/p>\n<p>And anything that&#8217;s an 80 or above is a very solid ranking. And that&#8217;s what we&#8217;re working for. And that&#8217;s what we&#8217;re working towards is working with the client to get them an ad paid x and then telescope or better ranking in his few months as possible, so that they&#8217;re going to have more credit offered to now.<\/p>\n<p>Michael Veazey 23:39<br \/>\nI mean, I think what&#8217;s interesting to me is that I meet people at all levels, those who wish to sell and those who are, you know, the million pound mastermind, I guess, there&#8217;s a couple of people are doing, say 6 million $7 million a year equivalent. So not vast businesses by the wider scheme of things.<\/p>\n<p>What&#8217;s interesting is that they&#8217;re normally very patient about being willing to spend spending a lot of money and effort just to rank for keywords for products, because they know the value of that over time. And I guess what we need to educate ourselves on is the value of credit over time, and just to have the similar level of patience to build that rather than just banging on the door of the bank and kind of hoping so which seems to be the strategy that even some reasonably robust sellers use. So this more sophisticated strategy makes a lot of sense.<\/p>\n<p>So listen, let&#8217;s move over to what you were calling the domestic loans. If you&#8217;re a US based that will be you or if you&#8217;re UK based, that would mean US based people, because I know you have some other programs that you educate people in there. So tell us a little bit more about what&#8217;s available to those folks?<\/p>\n<p>Bruce Mack 24:40<br \/>\nWell, we&#8217;ve got several of the programs that depending upon who the individual is, might be a perfect fit. So let me start with if I&#8217;m a our revolving lines of credit program and our revolving lines of credit program. As a really, really great tagline. Our tagline is zero percent APR, that&#8217;s annual percentage rate paid zero percent APR for up to 21 months on that program, if you qualify. And qualifying is really not that difficult if somebody&#8217;s got a 700 or better FIFO score.<\/p>\n<p>And ideally, they have at least one or more credit cards that has a $5,000 credit limit. And currently, their utilization on their credit cards in their store cards Is it 30% or less on each of their cards, likely they&#8217;re qualified to go through that program. Now somebody might say, Well, you know, I&#8217;m not there, I have a 620, I have a 630 FIFO score, darn it, well, don&#8217;t despair, you still want see if we can get you to qualify because they&#8217;re there are some if buts and exceptions with that.<\/p>\n<p>Let me give you  some of &#8220;the ifs and the buts&#8221;, we actually have an external funding department to pay down people&#8217;s high utilization cards, so that they get their FICO scores to go north, or increase. So FICO penalizes people, greatly, a third of your entire FICO score is derived from credit utilization. And once you start creeping over the imaginary brick wall, and that imaginary brick wall is a 30% utilization. Once you start creeping over that imaginary brick wall, unfortunately, FICO starts to penalize you and your credit score start to erode. Let me give you an accent.<\/p>\n<p>Imagine first of all that you&#8217;ve got a $10,000 credit card credit limit. And let&#8217;s just say that you bought a lot of product. And therefore it&#8217;s and you use credit cards. And it&#8217;s it&#8217;s 70% utilization or your current today&#8217;s balances at $7,000. That&#8217;s 70% utilization. And that would absolutely disqualify you today from going through the program. Because as I said earlier, you need to be 30%. So what to do? Well, you can rob, Rob your own bank account, and or trying to find funds to pay down your card.<\/p>\n<p>So we can get you into this program. Or depending we will take a look at the account and likely lend you the money so that you can pay down your current credit cards. And over a 30 day period of time your FICO score will go through the moon, and you&#8217;ll end up with a FIFO score above 700. Once those payments have reflected, and you&#8217;ve got your utilization ratios down into the conformity of 30% or less, this is a great program and an excellent way for us to be able to work with individuals.<\/p>\n<p>The other question people oftentimes disqualify themselves on Michael, is they say, Well, my situation is different. I had some, you know, I had I had a bankruptcy, I had a charge off, I had, I have a lien. And those are still on my credit report, because credit reports reflect information, in most cases for seven years, and in certain cases up to 10 years years. Now it was in my past, but it&#8217;s affecting my FIFO. Let me say that we have an attorney that we work with, I used to own a licensed and bonded Credit Repair Company, and I and there are no exacts or guarantees in credit repair because you can&#8217;t make them.<\/p>\n<p>However, I&#8217;ve never seen an individual have more successes, consistently removing inquiries and bankruptcies and any types of derogatory is that their collections and charge offs? The attorney that we work with is magical. She&#8217;s very inexpensive. And that&#8217;s the other way that we can go about increasing your credit scores so that we get you to where you need to be to go through the program where the average client gets funded 75 to $80,000, in a matter of weeks, from the time that we get them put through as much as $150,000 on a first round.<\/p>\n<p>And then we can come back into a second brown months later, where we can pick up as much as another hundred thousand. So this program can get over a period of time and individual as much as 250 plus thousand dollars. We&#8217;ve seen this time in and time again. Great. It&#8217;s a great program.<\/p>\n<p>Michael Veazey 30:28<br \/>\nThat sounds extraordinary. Yeah, I mean, that&#8217;s really going to move the needle because the people if you&#8217;re selling half a million a month or something you want to expand you need, you&#8217;re needing to look at numbers in in in the hundreds of thousands. So that would actually really move the needle. So that&#8217;s pretty significant results, to say the least. So let me just reflect again, just go over what I&#8217;ve heard, just to make sure that I&#8217;ve understood investing, and<\/p>\n<p>Bruce Mack 30:46<br \/>\nthen we&#8217;ll move on to the other funding program that we&#8217;ve got and want to share that with you as well.<\/p>\n<p>Michael Veazey 30:51<br \/>\nFear not, we will cover everything. But I just want to make sure that people can absorb this because I was fine with it with anything technical, certainly with internet marketing stuff. It&#8217;s familiar to me for Matt now. And whenever I go out with somebody new have a bright day is just you forget Oh my god, this is steep learning curve.<\/p>\n<p>So let me just reflect. So broadly speaking, we&#8217;re looking at revolving lines of credit. So the difference between that and the term loan, I guess is you take some money out, you pay some back, you keep taking them out again, you go back and forth. So the crucial things to fight this goal first first question, just remind us what FIFO stands for means, especially for the non Americans amongst us.<\/p>\n<p>Bruce Mack 31:25<br \/>\nIt&#8217;s the bear Isaacs Oh my gosh. Yeah,<\/p>\n<p>Michael Veazey 31:32<br \/>\nblah, blah. It&#8217;s basically credit score, right? It&#8217;s not money.<\/p>\n<p>Bruce Mack 31:35<br \/>\nIt&#8217;s the American credit score. There are many, many different models. There&#8217;s the Vantage score, there&#8217;s the this score, there&#8217;s the that score, but it is your score from the three different bureaus, Trans Union, Equifax, and Experian. And and that is your, the credit score that one has.<\/p>\n<p>Michael Veazey 31:55<br \/>\nOkay, so broadly speaking, but in simple terms, it&#8217;s kind of your Experian Credit Score, but obviously not just experienced, but Okay, fine. So yeah, very interesting what you were saying about the credit card thing, and it reminds me actually of the old advice about speakers, like if you don&#8217;t have a really good quality speakers concert, because my background, as a musician, I&#8217;ve done the opposite of gigs like that.<\/p>\n<p>And most it was classical piano, but so if you&#8217;ve got a massive amp system, and you only use a certain percentage of that power, you get a very good quality experience. Whereas if you&#8217;re running it right to the like redlining a car, you&#8217;re going to damage things quite quickly. I guess that&#8217;s a probably a better analogy. Right? So it sounds like what we what we need broadly is high credit limits, and then a modest utilization of them at any given point is that is that a fair summary?<\/p>\n<p>Bruce Mack 32:38<br \/>\nIt&#8217;s a very fair summary. And I really liked the analogy. FICO, on the credit, the credit scoring companies get very concerned, once you have high utilization, that you&#8217;re going to blow yourself up, get major distortion, and not be a good pay big, there&#8217;s too much financial pressure on you, which is why they start to erode your score, once you get over 30% utilization. And we happen to have a fix for it.<\/p>\n<p>Like I said, we can lend clients the money to pay down their cards so that their scores will zoom up so that they are not affecting their current business. It&#8217;s a solution. And it&#8217;s been a really, really good workaround. But I couldn&#8217;t agree with you more, Michael, that&#8217;s a very good analogy.<\/p>\n<p>Michael Veazey 33:30<br \/>\nBut let&#8217;s face it, but I mean, I think he&#8217;ll say it&#8217;s a bit more I mean, more realistic is a bit more like him a car where if you&#8217;re redlining it all the time, you just going to shorten the life of the at the car, it&#8217;s going to be an unpleasant bumpy ride, and the passenger you got with you aren&#8217;t lights, if you&#8217;re a professional taxi driver, he wouldn&#8217;t get you on people coming back. And I guess if we treat the lenders as a core part of the business, which I think we kind of need to because the money is so critical, that we got to give the lenders the kind of ride that they want, right.<\/p>\n<p>And if they want to feel like you, you&#8217;re going along your car could do 7000 resumes, but you&#8217;re going along at 1500, smoothly cruising along, and that keeps them happy, then that&#8217;s I guess, a mentality again, that we have to adjust to in our business. And again, it&#8217;s almost like a mentality shift from us and sellers or any entrepreneurs because we tend to be pedal to the metal, as you would say, it&#8217;s another car metaphor. And we tend to want to rev everything to the max, we burn ourselves out interns working 16 hour days, we put all the money and we <a href=\"https:\/\/tembomoney.com\/learn\/mortgage-acronyms-explained\">mortgage<\/a>, our house, whatever.<\/p>\n<p>But suddenly, we have to kind of be aware of a different mentality in relation to money with the lenders, it seems to me so it&#8217;s not just mechanics is also mine, like a mind shift that we understand. People come up with quite a different mindset where actually burning the midnight oil is not always good.<\/p>\n<p>Bruce Mack 34:40<br \/>\nI would totally agree with you. Would you mind if I shared just going on that and taking that a little bit further? Would you mind if I share a strategy that&#8217;s going to help your clients not burn themselves out on their FIFO? Yes, show of course. Okay. So there are some new newer scoring models that some of the credit grand tours are adapting. And in those new scoring models, they are actually tracking the amount of utilization that clients are keeping themselves at chronically. And they&#8217;re getting penalized if they&#8217;re consistently reading, as you said, or redlining. And always at a high limit.<\/p>\n<p>Now, again, I told you, you can pay down your you can pay down your cards and your score is going to go up. But with some of these new models, if you&#8217;re chronically redlining, redlining redlining month in month out, that can have a damaging effect long term to your FIFO. So one of the things and my tip is pretty simple. My tip is get business cards that don&#8217;t end because all business cards, but with one exception, do not, do not report on your FIFO.<\/p>\n<p>So if you want to read and do the red line, which I totally get, let&#8217;s do it strategically, let&#8217;s do it with business cards that don&#8217;t report on your FIFO keep those utilization ratios up at 60, 7080, or 90%. And it will not affect your credit score at all. And conversely try and keep your personal cards at 30% or lower as much of the time as possible. And you&#8217;re going to end up having the best of both worlds now.<\/p>\n<p>Michael Veazey 36:37<br \/>\nSo basically, I&#8217;m just going to double check, sorry to interrupt, I just want to just just make sure that we&#8217;ve got a chance to absorb this stuff. Because I mean, some people might say, yeah, it&#8217;s obvious, but a lot of people going well, let me just get my head around this. So basically a business card as in the card in the name of your business, your LLC, or whatever the the entity is, you can basically redline those with some degree of impunity, ie the FICA court score and be badly affected. But anyway, so cause you basically keep below 30% utilization, and then you&#8217;re safe.<\/p>\n<p>Bruce Mack 37:05<br \/>\nIs that Is that a fair summary? In a perfect world? That is apps, that is absolutely the case. Which begs the question, when we work with people, not only do we give them this, this education, but we go one step further, many of the clients that we work with, even though they&#8217;re in business, they may not have a business entity.<\/p>\n<p>And one of the things that we can do and one of the things that we help with is getting them an entity so that we can get them the business cards that are attached to the entity so that they can read line all they want on those business cards, which by the way, also usually get approved at a 10 to 15% higher straight across the board open to buy or credit limit. So it&#8217;s that there&#8217;s a secondary reason that we love to go after those business cards.<\/p>\n<p>Michael Veazey 37:56<br \/>\nyeah. So high up high credit limit. Okay, makes a lot of sense. So thank you for for letting me still reflect back on I just want to make sure we can absorb this and sort of absorb more chunks. So that&#8217;s the revolving says that would would that be the revolving lines of credit program that you then offer then?<\/p>\n<p>Bruce Mack 38:12<br \/>\nYes that really that really summarizes revolving lines of credit program that we&#8217;ve got a super<\/p>\n<p>Michael Veazey 38:19<br \/>\nsmart Okay, super smart. That&#8217;s so American. I&#8217;m Speaking to so many Americans that I&#8217;m becoming Americanized here!But that is very smart. I love the fact that you know, whether the red lines are if you like, or the do not cross lines, I need to step carefully around those and, and maintain that pressure score. So it&#8217;s just like Amazon rankings, just the same kind of mentality actually, like, whatever you do you look after the ranking and that that&#8217;s kind of then everything else good flows from it.<\/p>\n<p>Thanks for listening to the 10K collective podcast. I really hope you found this show helpful.<\/p>\n<p>I mentioned the London based masterminds we&#8217;ve been running since September 2017. Members of the 10 k collective mastermind making minimum about 480,000 pounds a year, whatever 600 thousands of dollars. To find out more about that mastermind, go to www.amazingfba.com\/10KC.<\/p>\n<p>Million pound mastermind members make a minimum of 4.2 million pounds a year that&#8217;s about 1.5 million US dollars or euros. To find out more about that mastermind. Go to www.amazingfba.com\/MPM.<\/p>\n<h3><strong>Watch my full interview with Bruce Mack<\/strong><\/h3>\n<p>[video_page_section type=&#8221;youtube&#8221; position=&#8221;bottom&#8221; image=&#8221;&#8221; btn=&#8221;light&#8221; heading=&#8221;&#8221; subheading=&#8221;&#8221; cta=&#8221;&#8221; video_width=&#8221;1080&#8243; hide_related=&#8221;false&#8221; hide_logo=&#8221;false&#8221; hide_controls=&#8221;false&#8221; hide_title=&#8221;false&#8221; hide_fullscreen=&#8221;false&#8221;]https:\/\/www.youtube.com\/watch?v=3OzASxZpxOQ&amp;feature=youtu.be[\/video_page_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_007-bruce-pt1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fbusiness-credit-for-small-business-with-bruce-mack-of-platinum-financing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-5\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_007-bruce-pt1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9670-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_007-bruce-pt1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_007-bruce-pt1.mp3\">Download<\/a> (Duration: 39:43 &#8212; 27.3MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_007-bruce-pt1.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fbusiness-credit-for-small-business-with-bruce-mack-of-platinum-financing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-6\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_007-bruce-pt1.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9670-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_007-bruce-pt1.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_007-bruce-pt1.mp3\">Download<\/a> (Duration: 39:43 &#8212; 27.3MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 39:43 &#8212; 27.3MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 39:43 &#8212; 27.3MB)Subscribe: Spotify | Email | TuneIn | RSS<\/p>\n","protected":false},"author":1,"featured_media":6601,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1550],"class_list":["post-9670","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Business Credit for small business with Bruce Mack of Platinum Financing - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Business Credit for small business with Bruce Mack of Platinum Financing - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 39:43 &#8212; 27.3MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 39:43 &#8212; 27.3MB)Subscribe: Spotify | Email | TuneIn | RSS\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-06-17T17:40:38+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-06-29T10:21:34+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k007.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"32 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Business Credit for small business with Bruce Mack of Platinum Financing\",\"datePublished\":\"2019-06-17T17:40:38+00:00\",\"dateModified\":\"2021-06-29T10:21:34+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/\"},\"wordCount\":7392,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k007.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/\",\"url\":\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/\",\"name\":\"Business Credit for small business with Bruce Mack of Platinum Financing - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k007.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-06-17T17:40:38+00:00\",\"dateModified\":\"2021-06-29T10:21:34+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k007.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k007.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"Business credit for small business with 10K Collective Amazon FBA Podcast and Amazing FBA Podcast\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Business Credit for small business with Bruce Mack of Platinum Financing\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Business Credit for small business with Bruce Mack of Platinum Financing - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/","og_locale":"en_GB","og_type":"article","og_title":"Business Credit for small business with Bruce Mack of Platinum Financing - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 39:43 &#8212; 27.3MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 39:43 &#8212; 27.3MB)Subscribe: Spotify | Email | TuneIn | RSS","og_url":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-06-17T17:40:38+00:00","article_modified_time":"2021-06-29T10:21:34+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k007.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"32 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Business Credit for small business with Bruce Mack of Platinum Financing","datePublished":"2019-06-17T17:40:38+00:00","dateModified":"2021-06-29T10:21:34+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/"},"wordCount":7392,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k007.png?fit=1280%2C720&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/","url":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/","name":"Business Credit for small business with Bruce Mack of Platinum Financing - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k007.png?fit=1280%2C720&ssl=1","datePublished":"2019-06-17T17:40:38+00:00","dateModified":"2021-06-29T10:21:34+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k007.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k007.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"Business credit for small business with 10K Collective Amazon FBA Podcast and Amazing FBA Podcast"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/business-credit-for-small-business-with-bruce-mack-of-platinum-financing\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Business Credit for small business with Bruce Mack of Platinum Financing"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k007.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2vY","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9670","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9670"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9670\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6601"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9670"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9670"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9670"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}