{"id":9671,"date":"2019-06-14T06:00:32","date_gmt":"2019-06-14T05:00:32","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6568"},"modified":"2021-02-01T15:50:14","modified_gmt":"2021-02-01T14:50:14","slug":"protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/","title":{"rendered":"Protecting The Product Design with Ryan Shaffett of XQ Manufacturing"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_006-ryan-pt2.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fprotecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_006-ryan-pt2.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9671-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_006-ryan-pt2.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_006-ryan-pt2.mp3\">Download<\/a> (Duration: 34:52 &#8212; 23.9MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_006-ryan-pt2.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fprotecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_006-ryan-pt2.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9671-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_006-ryan-pt2.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_006-ryan-pt2.mp3\">Download<\/a> (Duration: 34:52 &#8212; 23.9MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><!--more--><\/p>\n<h1>Protecting The Product Design<\/h1>\n<h2>The role of Patents in protecting your product design<\/h2>\n<p>Protecting your <a href=\"https:\/\/mammothpackaging.com\/5-product-label-design-trends-to-watch-in-2021\/\" target=\"_blank\" rel=\"noopener noreferrer\">Product Design<\/a> doesn&#8217;t necessarily start with  patent protections.<br \/>\n<span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\">One key is to minimise the chance of your supplier selling your product to other retailers. <\/span><br \/>\nRyan&#8217;s team works hard on the selection of and relationship with suppliers to ensure that their factories don&#8217;t do that.<br \/>\nIf you have your own Mold,  nobody else will use that, so that creates a lot of protection against getting copycat versions of your product out there.<\/p>\n<h2><b>How to Protect your Product Design by Keeping a <\/b><b>very close relationship  with your <\/b><b>main suppliers<\/b><\/h2>\n<p>The key is a  a very, very close relationship with middle supplier is that we consider Ryan considers them part  of his company and his mother calls the boss her Chinese son.<br \/>\n<span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\">Keeping the molds locked away is also part of protection against being copied. <\/span><br \/>\n<span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\">They have for example a very specific set of patterns for a client, which <\/span>are in locked tubes for when they are needed.<\/p>\n<h3><b>How about the “no” vs. Honesty thing?<\/b><\/h3>\n<p>Mostly suppliers will tell you they can do something when in reality they can do ⅔ of what you want.<br \/>\nPin down the suppliers &#8211; make them repeat things in contracts and in writing.<br \/>\nTo be  sure they can hit your specifications &#8211; put in testing!<br \/>\n<b>Solution:1<\/b><br \/>\nSample sample sample!<br \/>\nCore QC point &#8211; make sure the supplier don&#8217;t mass produce a product until you’ve approved the sample!<br \/>\nChinese mentality of “cha abs dour”-&#8216;close enough&#8217; &#8211; is the biggest enemy.<\/p>\n<h3><b>Quality control and protecting your product&#8217;s quality<\/b><\/h3>\n<p>Traditionally been so cheap to make stuff that the mentality is that it&#8217;s cheaper and faster to make an approximate version initially. Then they will try to get the samples approved by the buyer. And if they have to, just redo it.<\/p>\n<h3><b>QC &#8211; not just Pre-Shipment Inspection<\/b><\/h3>\n<p>Process &#8211; Say do a tent, custom plastic:<\/p>\n<ol>\n<li>Send client fabric strips<\/li>\n<li>Make prototype with factory<\/li>\n<li>Then if think understand what client was after and custom weave hundreds of rolls<\/li>\n<\/ol>\n<p>Be part of the process &#8211; sometimes prototype throws up new issues, eg,<br \/>\nDidn’t think about how thick the fabric would need to be.<\/p>\n<h2><b>Where are you at in the process? <\/b><\/h2>\n<p>Prototype<br \/>\nSample<br \/>\nOrder process<br \/>\nProduction sample<br \/>\nThere is always a tension there<br \/>\nEg need tent in very specific colour etc.<br \/>\nminimum to weave or dye a fabric &#8211; $1000s<br \/>\nHow approx do you need your prototype to be?<br \/>\nRyan has even been developing a product with his daughter!<\/p>\n<h2><b>What sort of Custom Manufacturing service do you offer at XQ?<\/b><\/h2>\n<p>Our service advantages help navigate some of the challenges associated with <a href=\"https:\/\/10kcollective.com\/custom-manufacturing-for-amazon-with-ryan-shaffett-of-xq-manufacturing-part-1\/\">custom manufacturing<\/a>:<\/p>\n<h3>Protecting your Product Design<\/h3>\n<p>1- We do not sell privately developed products to other parties like many China based factories.<\/p>\n<h3><b>Do you deal with freight?<\/b><\/h3>\n<p>Usually to ship the smallest thing ocean you will pay over $700 due to the 1 time costs of import export, but we take on all these fees as part of the total container cost.<br \/>\n2 &#8211; we have monthly consolidated ocean containers that allow give our clients low shipping cost options to our US warehouse.<br \/>\n3 &#8211; We have a US company that acts as the importer so thus our US clients can pay our US company and not have to deal with international transfers, customs importing, shipping logistics, etc.  We can ship all the way to FBA for our clients.<br \/>\n4- We are familiar with duty rates and import restrictions and can advise on all this or for our clients who wish we can quote them with all duties considered including new Trump Tarriffs so they do not have to worry about that. We are also familiar with things like Children&#8217;s Product safety Testing requirements and can navigate all that for our clients.<br \/>\n5 &#8211; as a US run company in China it allows us to have superior communication compared to other Chinese factories and better understand our client&#8217;s needs.<\/p>\n<h3><b>Contact details<\/b><\/h3>\n<p><a href=\"http:\/\/Xqmanufacturing.com\">Xqmanufacturing.com<\/a><br \/>\n<a href=\"mailto:rs@Xqmanufacturing.com\">rs@Xqmanufacturing.com<\/a><\/p>\n<hr \/>\n<h2>Transcript<\/h2>\n<h3>Protecting your Product Design<\/h3>\n<p>So let&#8217;s move on to a very different point. But obviously, one that again, anyone who&#8217;s been around the block with the Chinese factories generally will be very conscious of not to say that America as a whole is conscious of because that was one of Trumps probably very accurate claims. The Chinese have very little respect for intellectual property, or at least, the often, in many cases, tell us how you deal with that kind of whole pain of basically intellectual property theft? (Protecting your Product Design)<\/p>\n<p>Ryan Shaffett 1:23<br \/>\nI mean, there&#8217;s not only theft, but they&#8217;re just I mean, there&#8217;s no, there&#8217;s long if you have a very common product was no patent protections. There&#8217;s no law that says that that company can&#8217;t sell it to someone else. And of course, if you&#8217;re just sourcing, they&#8217;re already selling multiple people, our company, we try to not sell to people that would be competing against our competitors. It&#8217;s not something that we can always perfectly balanced.<\/p>\n<p>But our goal, in Protecting your Product Design,  is to work with a smaller number of larger clients and try to be respect the off of their their social places in the market. And now of course, in a mold, no else is going to use that more. So unlike some Chinese factories, and they don&#8217;t want to say all but I&#8217;m like some Chinese factories, you know, we&#8217;re not going to be selling your product, out the back door to other people. Yeah, guarantee that some other third party might see it on Amazon to develop their own molds. That&#8217;s something we can&#8217;t prevent. No, of course, I things that people are investing in, that were directly involved in. That&#8217;s just trust is a big thing. We try to build with our clients and offers unique distinctive.<\/p>\n<h3>Protecting your Product Design by Owning the mold<\/h3>\n<p>Michael Veazey 2:27<br \/>\nSo I guess owning a mold is is a kind of interest in seeing balance between the purely legal protection of the patent, which of course, one should probably try and get, but it is way more expensive traditionally than just the mall cost you like $1,000?<\/p>\n<p>Ryan Shaffett 2:43<br \/>\nnot always possible and all product situations either.<\/p>\n<p>&nbsp;<\/p>\n<h3>Protecting your Product Design by avoiding &#8220;Back Door Sales&#8221;<\/h3>\n<p>Michael Veazey 2:46<br \/>\nYeah. But I mean, obviously, we&#8217;d get lawyers on to talk about that. I&#8217;m sure we will. But your side of it is if you own the mold, and its unique mode, at least you&#8217;ve got a physical kind of limitation for people just copying it to and Protecting your Product Design.<\/p>\n<p>And yes, sure, if they get it off Amazon and send it to Chinese factories, they make a mold for this, then I guess you&#8217;re going to get some people copying you. But that&#8217;s quite different from the whole thing of, as you said him sending it out the back door. So how do you deal? I mean, do you even have any way of handling that situation?<\/p>\n<p>How do you deal with the back door sales, as it were, say, I&#8217;ve created some plastic mold for you know, sort of, let&#8217;s say key fobs or something for the sake of argument or key sized objects. I&#8217;ve got a mold that has 20 cavities in it, so I can use lots of variations. They&#8217;re selling really well. And I paid you guys, you know, $10,000 to get the mold made? What sort of protection? Would I have around that? If any?<\/p>\n<p>Ryan Shaffett 3:38<br \/>\nYeah, so for all the key processes that we commonly do, we have we work directly with just the same manufacturers that we have a very, very close relationship with middle supplier is that we consider them part of our part of our company by my mother calls the boss or her Chinese son, as a way of Protecting your Product Design.<\/p>\n<p>So yeah, we Yeah, just an extension of our factory, our mold maker, we is we is the same way ever in the room, within their factory, a locked room where all our our molds are cap, for we have some very specific camouflage patterns that we work with the clients that we they paid a few thousand dollars to develop for textile printing.<\/p>\n<p>And we have those in, in locked, locked tubes for when they&#8217;re needed for screen printing on the from the fabric. So we don&#8217;t actually own the fabric, but the factory that does the printing on the textiles, but we make sure that our brains are locked up there.<\/p>\n<p>Michael Veazey 4:38<br \/>\nMake sense? So in other words, Protecting your Product Design comes down to the quality of the relationships and then having procedures in place that are common sense, like physically locking things away. And I guess like anything else, if somebody wants to break in, I always think of the famous story of the Concorde. Development back in the 60s.<\/p>\n<p>And in Paris, there was just some Soviet spy, he was a chief engineer or something. I mean, you know, any, any system can be abused, you really want to but I guess, you know, look that was conquered that was worth stealing.<\/p>\n<p>Whereas, you know, some moderately successful products on Amazon is probably less of an incentive to break through so many barriers, right? I guess people would just go, you know what, this isn&#8217;t gonna happen. Let&#8217;s do something different.<\/p>\n<p>Ryan Shaffett 5:15<br \/>\nThe National Government wants to get ahold of your mold. I might not be able to prevent that. Yeah, sure. But<\/p>\n<p>Michael Veazey 5:21<br \/>\nyeah, that&#8217;s fair enough. But yeah, I think it&#8217;s it&#8217;s good to get a sense of proportion about this stuff. They&#8217;re not all things that equally, have, you know, I suppose is just very much the sort of things you were just saying. It&#8217;s a bit like the kind of common sense police advice is like, you know, most burgers are opportunists. So don&#8217;t leave your windows open and make sure you double lock your door, and then they&#8217;re probably try something else.<\/p>\n<p>And I&#8217;d imagine, there&#8217;s probably going to be true for your Protecting your Product Design in China as well, right? If there&#8217;s somebody else&#8217;s mold, it&#8217;s easy to steal, they don&#8217;t have a close relationship with the person who&#8217;s helped develop it, they don&#8217;t really care about them. And they don&#8217;t have proper procedures in place to look after it. And of course, it&#8217;s going to be much easier to get that one and just produce products out the back door. Right.<\/p>\n<p>Ryan Shaffett 6:00<br \/>\nYeah, I mean, it&#8217;s for some of the factories out there. That&#8217;s just the the the mo for business, that&#8217;s, you know, that anyone comes willing to offer money, they&#8217;ll they&#8217;ll make those products, regardless of who paid for the mold. Again, not every factory in China is like that. But there&#8217;s enough that it&#8217;s a concern.<\/p>\n<h3>Close relationships as the foundation of Protecting your Product Design<\/h3>\n<p>Michael Veazey 6:18<br \/>\nYeah. So I guess it comes down to again, one reason to work with somebody like yourself is is just because you have those close relationships. And that trust them.<\/p>\n<p>And and this is another thing that came up in the conversation is that the obsession with getting somebody on the ground in China, you can trust them mostly will come back down, whether rightly or wrongly, and I suppose that can be accusations of racism here that that might be fair as well.<\/p>\n<p>But rightly or wrongly, people are tending to think about British people or Americans on the ground, I guess, partly because, culturally, you know, there&#8217;s a connection with the British or American person who understands, judicial.<\/p>\n<p>Unknown Speaker 6:53<\/p>\n<h3>The &#8220;I&#8217;m just a girl (guy) can&#8217;t say no&#8221; problem with Chinese factories!<\/h3>\n<p>Michael Veazey 6:54<br \/>\nand yeah, and things that are familiar and ways of operating. And I suppose a culture as well as of operating, for example, this is one of the things that I&#8217;ve always experienced and being seen to talk to you about this, that when I speak to them for Chinese manufacturer, sometimes I still forget that in East Asian culture in China or Japan, it&#8217;s basically very rude to say no.<\/p>\n<p>So if I say, Can you do this for x, y, Zed date, if I phrase things in crass way, for an American particularly, that&#8217;s very normal for Brits, that&#8217;s still a bit aggressive, because we are a little bit like the Asians in the sense of no one&#8217;s be rude. But yeah, will ultimately Sam, I&#8217;m so sorry, old chap, I can&#8217;t do that. But the Chinese would just say yes, and then not do it. So is there a way around that? Is that a cultural difference we can overcome in some way?<\/p>\n<p>Ryan Shaffett 7:34<br \/>\nI think that&#8217;s definitely a Chinese cultural thing. Yes. Saying saying no, it is not common in, in business. I mean, I don&#8217;t know how much that&#8217;s going to play a part in business. But I guess what I what I see a lot is that if a factory can&#8217;t do something, yeah, there&#8217;s because of the financial incentive as well, they&#8217;re going to want to come back to you and say, Sure, we can do that.<\/p>\n<p>But they&#8217;re going to get you something that&#8217;s that&#8217;s two thirds of the way, what you actually wanted, would be a more common situation, as you say, both because of the cultural reason. And because the financial incentive, what would I recommend for someone trying to get around that problem? And just really pin down your supplier really talked them very, you know, make them repeat over and over and write a contract?<\/p>\n<h3>Protecting your Product Design by getting specifications in writing<\/h3>\n<p>No contracts, of course, are very hard to enforce internationally. But still, I&#8217;m going to put it down in writing when you know, you&#8217;re sure you specifications, you&#8217;re sure that&#8217;s not going to be a problem, right? The purchase in order for me, so that we can all see it there later.<\/p>\n<p>Michael Veazey 8:40<br \/>\nYeah. Okay. So like getting things done in writing and being very specific. I think they would pin down is the phrase that always springs to mind for me. And this is only mind you with private label products with minimum tweaks? Is it still an issue? like, Okay, can you make this?<\/p>\n<p>I&#8217;m just thinking about so things like, Can you make this with the satin finish? Yes, no problem at and then they produce it with a sort of hard plastic shiny last finish, for example, the plastic product that had made them and you think, sorry, which bit of the conversation Didn&#8217;t we get here? So I guess it comes down to getting photographic<\/p>\n<h3>Protecting your Product Quality by getting lots of samples<\/h3>\n<p>Ryan Shaffett 9:13<br \/>\ncommunication issue? Or it could have been that the issue you were referring to a moment ago, it&#8217;s it&#8217;s hard to say, but yeah, that&#8217;s a lot of my life, waiting through those problems. Sample sample samples, actually, that&#8217;s, that would be my strong advice, just, you know, don&#8217;t don&#8217;t get the 10,000 pieces, and then inspect them get that sample, making sure that that&#8217;s that&#8217;s actually the are our businesses, core quality control. Key Point is just about we&#8217;re not going to make something you&#8217;ve approved the sample.<\/p>\n<p>That&#8217;s all right, I&#8217;m sure it&#8217;ll be fine. Send it to me anyway. Or just send me the mass product anyway, get it on the ocean first. Yeah, you know, I, I tried to really resist that at all costs. And just really, you needed to get the sample in hand and the teller, it&#8217;s okay, after you get the sample in hand and make sure if you say it&#8217;s okay, we can ensure that all the rest of this product is going to be manufactured to the same specifications as that.<\/p>\n<p>So for a buyer who&#8217;s dealing with another Chinese party, I would, I would strongly recommend that as well, most of the communication issue, or for that is a phrase in Chinese called chop the door, which means close enough. But it&#8217;s a very, very dangerous phrase in the manufacturing world.<\/p>\n<p>Michael Veazey 10:27<br \/>\nYeah, I agree with you. And I think you&#8217;re, you know, I&#8217;m sure that you&#8217;re resistant, hard, hard experience of many, many years. I mean, absolutely. I&#8217;m one of these classic impatient people and say all it will be good enough, because I&#8217;m used to Western levels of quality control, which generally there&#8217;s so much regulation in the European Union, and I guess, in America around this stuff, it doesn&#8217;t guarantee you&#8217;re going to get great stuff, either. But I mean, I think that, you know, or Japan, I mean that they got such high quality control built into the processes.<\/p>\n<h3>The issue of QC in China<\/h3>\n<p>Now, thanks to people like Denning and then Toyota, Toyota, and that&#8217;s come back from the deadening idea in America went over to, you know, the Japanese bought at wholesale, and then it&#8217;s gradually come back into, for example, American car manufacturing, but yet somehow just isn&#8217;t built in with Chinese stuff on that. And I guess, as spoiled Westerners humans, we forget that I can&#8217;t agree more that whenever I&#8217;ve tried to speed the process up and skip stuff, it&#8217;s always bitten me so hard, and the bomb, I&#8217;m never going to do that. Again.<\/p>\n<p>If for example, even skipping pre shipment inspection, my my partner and I just imported like 200 units or something is just a little test order. And we can be bothered to pay for QA QC, but they may spend six hours going through some boxes yesterday or whatever day before just finding a bunch of defects that we got it in specs in China, somebody on a much lower wage, would have caught those, say another example.<\/p>\n<p>Yeah, the way your you have to weigh your risks with everything, you know, is it the risk of it all turning out terrible, you know, having very few sellable products is that is that worth the cost of inspecting for a small small project, obviously, for larger projects, it&#8217;s worth it. Even small projects.<\/p>\n<p>And it&#8217;s been a bosses surprised me in that tiny little example, the 200 units or something that is private label, somebody else is doing the manufacturing, somebody else has dealt with everything. And we just kind of, you know, got a special arranged with somebody to just get a few units of it to test out new products.<\/p>\n<p>But the point being, even in that silly little scenario, it still wasn&#8217;t worth giving QC, even though it seemed like it wouldn&#8217;t, how could it possibly be worth spending 100 bucks on this thing that was only going to cost us a few hundred. So it is an example. That&#8217;s all never were skipped with,<\/p>\n<h3>Chinese mentality regarding Quality<\/h3>\n<p>Ryan Shaffett 12:29<br \/>\nwith custom manufacturing and QC that every product is also very different, again, as it is, again, true here. I mean, if you have a plastic part that&#8217;s just out of a plastic mold, really checking, I can&#8217;t say it&#8217;s universally true, but checking one and checking them all of them is generally going to be the same, there are issues that could go wrong. So I don&#8217;t want to say that absolutely.<\/p>\n<p>But a batches of batches of batch shipping over you off of that batch serves serves the purpose largely but then again, if you really want want to be 100%, sure, then QC inspection might still be appropriate. And that that you have to make that that call yourself.<\/p>\n<p>I noticed one thing in the Chinese just economy that&#8217;s that&#8217;s kind of where some of this mentality is derived from is the cost of manufacturing has traditionally been so cheap, obviously, it&#8217;s a little more expensive than it was 10 and 15 and 20 years ago, but a lot of the factories have a mentality of it&#8217;s going to be cheaper and faster to just take a swing at this and hope we understood that.<\/p>\n<p>It was after here that we&#8217;re doing this cheaper way that we know the client didn&#8217;t really want, but we&#8217;re still going to try it this cheaper way. Send them some samples, send them some products, see if it&#8217;s approved, that we can make some better margin. And if it&#8217;s not, we&#8217;ll come back and we&#8217;ll redo redo the whole thing.<\/p>\n<h3>Dealing with the QC mentality &#8211; practical measures<\/h3>\n<p>Michael Veazey 13:46<br \/>\nAnd that makes sense.  I guess that&#8217;s why the the pre shipment inspection is so important, because because of that mentality, you know, it does make sense. Clearly, there is a logic that drives all these situations. I mean, culture comes from I think necessity, sometimes men discuss, okay, this is a very different anthropological question.<\/p>\n<p>But I do think, yeah, you&#8217;re right about the cost of labor super cheap, you just throw more labor at it. And that&#8217;s why I guess having the traditionally with the private label products anyways, that the way that I&#8217;ve always done it, the usual 7030 split so or whatever, you can get 30%, down up front, and then you old 70% until they&#8217;ve actually got it right.<\/p>\n<p>But the downside, of course, is you got to be prepared for them to take the the whatever time it takes to produce the new run and replace that stuff. Right. So that&#8217;s kind of a crude solution. do you suggest having quality control or inspections earlier in the process? When you&#8217;re dealing with custom manufacturing?<\/p>\n<h3>Quality Control Process for Custom Manufacturing<\/h3>\n<p>Ryan Shaffett 14:36<br \/>\nYes, for sure. Every project is different. Yeah, we try to savor the same ourself cost and risk, we try to do different checks at as many steps as possible. So if we&#8217;re doing let&#8217;s say, let&#8217;s just say a tent with maybe some custom plastic that so yeah, we&#8217;ll, we&#8217;ll show the client, the CAD drawings for it, have them approve those.<\/p>\n<p>And then we&#8217;re getting into fabric and maybe, so we&#8217;re going to send the client fabric strips, or at least you know, we&#8217;re going to talk through them send pictures, maybe make a prototype with that fabric before we go off and, and run the hundreds of rolls or whatever it might be for that.<\/p>\n<p>Because we do if we think we understand what the client was after, and we do, and we custom custom weave, hundreds of rolls of fabric and then the client says, Oh, no, I didn&#8217;t we didn&#8217;t talk about about the how thick this fabric needed to be.<\/p>\n<p>Well, you know, we&#8217;re all in trouble at that point. So yeah, as much as you can be a part of the process, confirming the materials confirming different, different steps. That&#8217;s great. You know, sometimes there&#8217;s a prototype involved. Sometimes there&#8217;s, yeah, we&#8217;ve got our final product or raw materials, every projects different.<\/p>\n<h3>The more communication with supplier, the better the QC<\/h3>\n<p>But yeah, more communication, the better chance you have of not ending up with the wrong thing when it shows up at your door or, because even when you are even when you go for a quality inspection, and you&#8217;ve got 10,000 pink t shirts, when you wanted 10,000 red t shirts, that&#8217;s a problem for both of you still, you know, you put 30% down and, you know, ideally that manufacturer is going to say sorry, and rerun it all. But as you pointed out already, at the least you&#8217;ve lost time, which might be very critical for your your business model.<\/p>\n<p>Michael Veazey 16:23<br \/>\nYeah, so as you say, it comes down to that old thing that carpenters used to say, which is measure twice cut once.  I guess that in the case of manufacturing a custom manufactured products with a serious number of run of pieces or units measure like 10 times better.<\/p>\n<p>The other thing to say is:  this concept that actually appears talks about who&#8217;s a member of the 10 k collective, so he&#8217;s actually doing relatively modest numbers relative to that sort of stuff. He was talking about probably, and what sorts of turnover, but he had 100 k Christmas, you know, last year, so you know, but he&#8217;s got a manufacturing background, he was talking about the way that he would do it. He talked on a podcast episode at some length about different subjects.<\/p>\n<h3>The Bronze, Silver, Gold Sample approach to product development<\/h3>\n<p>But one thing was he said, I think he basically Nick the idea for the test goes or some British company, which is that you have a bronze silver and a gold sample. So in other words, you don&#8217;t even go in with the mentality as the buyer of the products of thinking, that is going to be right first time or even second time you go with the mentality.<\/p>\n<p>Okay, here&#8217;s a rough sample that comes back after the initial discussions and you go, Okay, well, this is good, this is good. This is good that that is rough. That&#8217;s the wrong material that&#8217;s actually not flexible enough, it doesn&#8217;t perform its function.<\/p>\n<p>And by the way, I&#8217;d forgotten that, like you said, You know what, I completely forgot to talk about the thickness of the fabric, that&#8217;s really stupid of me, what can we make it a millimeter thicker or whatever, they go back, you have to sell the sample to come back.<\/p>\n<p>But it needs this, this this, these are some rough edges here, blah, blah, blah. And then they bring back the gold sample, which in theory, if life is neatly played ball, and that is your manufacturing sample. So presumably, that&#8217;s just another way of putting all the stuff you&#8217;ve been implying the whole time, right? So to sample like you said,<\/p>\n<h3>Where are you on the process to a custom manufactured product?<\/h3>\n<p>Ryan Shaffett 17:57<br \/>\nWhen we start talking with the client, we are, I&#8217;d have to try to figure out and sort through in my mind, what are they ready for here? Are they ready for prototyping? Are they ready for sampling? Or are we ready to move into an order, which is going to include a sample process, but we need to put 30% down we&#8217;re going to do, we&#8217;re going to move towards what we might call a production sample.<\/p>\n<p>If all the details are clear, then we&#8217;re into a production sample where we&#8217;re buying the raw materials in bulk and making that happen. Now there&#8217;s, there&#8217;s always going to be some tension there. How do we through that if we&#8217;re doing a tense and you need a very custom material, that&#8217;s, that&#8217;s very unique in a very specific color. And we&#8217;re, and we&#8217;re trying to do a prototype without putting our 30% down, there&#8217;s going to be there&#8217;s going to be a problem there.<\/p>\n<p>Because the minimum to weave and die of fabric is going to be you know, maybe it&#8217;s going to be thousands of dollars worth of product at least. So no one wants to spend thousands of dollars on your typical prototype. So there&#8217;s some tension about how to balance that how approximate Dean need your, your prototype to be your sample to be in some trouble sample, before we get to a production say,<\/p>\n<h3>Speed vs. Quality &#8211; the big tension<\/h3>\n<p>Michael Veazey 19:09<br \/>\nI think the the tension between these different things, it&#8217;s just part and parcel of I think if the entrepreneur, if they&#8217;re really standing back from the process and thinking in a properly businesslike way that back and forth is part of the decision of what&#8217;s the product line to pursue, right?<\/p>\n<p>I mean, you let you think this fabric, this type of tennis with a really differentiated look and feel could really be differentiated from the house out there is going to be unique customer and manufacturing. So therefore, it&#8217;s going to be defensible, that sounds great.<\/p>\n<p>The budget looks like x y On paper, but then you go in. And actually one barrier to entry that that could be too big a risk would be spend $10,000, just to get the prototype done, and the discovery is not gone. That that&#8217;s part of the investment of your time and money that your company should be making that I think is the right word for money.<\/p>\n<h3>Back and forth discussion, not linear process<\/h3>\n<p>In other words, I&#8217;m going to put this thing together go in a linear way they go right idea towards the manufacturer, make the prototype, do the next thing, do the next thing do the next thing done. It&#8217;s a back and forth process. And part of that process is discovering in the nuts and bolts way of actually, you know what we shouldn&#8217;t be doing this, this doesn&#8217;t make sense for a company.<\/p>\n<p>Ryan Shaffett 20:18<br \/>\nThat happens.<\/p>\n<p>Michael Veazey 20:19<br \/>\nYeah, and then just less real life. And I just think it&#8217;s hard, how long that life should be linear and go from A to Z in one nice way, how long that that mentality persists. And what I think that means is even for a good entrepreneur, that they end up giving themselves a hard time because they haven&#8217;t got a product out the door, because they gave themselves six months to do it when they didn&#8217;t allow for the fact that six months is a good goal.<\/p>\n<p>But we aren&#8217;t obsessed with that being a reality. And also this product line may not pan out. And that&#8217;s fine, because that&#8217;s part of life. As long as you&#8217;ve got more than one island fire, it&#8217;s okay. Right?<\/p>\n<h3>Making changes slows down production<\/h3>\n<p>Ryan Shaffett 20:50<br \/>\nYeah, when those kind of things happen. Most of my clients, you know, they know they&#8217;re part of the process, and we&#8217;re part of the process, but occasionally, you will have the clients to they&#8217;re making changes.<\/p>\n<p>They&#8217;re saying, Yeah, okay, we do the prototype that they want, they&#8217;re making changes, we&#8217;re redoing a prototype, you know, there&#8217;s, there&#8217;s some minor costs involved in all the back and forth. Then they get frustrated with the timeline when they didn&#8217;t come to us with all the details. They&#8217;re making changes as they see things and play with things in their hands. Sadly, they just can&#8217;t handle the timeline that that&#8217;s resulting from it. And that&#8217;s,<\/p>\n<p>Michael Veazey 21:24<br \/>\nas you say, just part of the one of the entrepreneurial challenges that we have to balance and see how fast we can push through this with still getting, getting everything we want. Absolutely, I mean, I just think just to come back to that, again, I mean, just to hammer this home, one of the definitions of economics is the allocation of scarce resources.<\/p>\n<p>In other words, there is a limited amount of time and money available and the art is allocating it in other words, so that implies is not always going to work out and it&#8217;s the decision of where to put it is I think the ultimate entrepreneurial or even investing decision.<\/p>\n<h3>Continuum between speed and quality<\/h3>\n<p>But if you&#8217;re going to move the goalposts yourself and not my god I&#8217;ve been that person some of the time so I feel a bit guilty now but I&#8217;ve been the person making the process last longer and another thing might my coach Jason miles he&#8217;s not a custom manufactured person but runs Shopify training and Shopify store he says look, there&#8217;s a continuum between speed and quality.<\/p>\n<p>Again that&#8217;s another decision on entrepreneurs to make if you think it&#8217;s Christmas is coming up in nine months time and you can get a product after Christmas and make a killing even if it&#8217;s not the most amazingly produce products in the world then that&#8217;s the speed you know pushes water speed in a very calm business lead decision, impatient patients versus if something&#8217;s out there already and the market you know, the minimum viable product needs to be very very good then you&#8217;re just going to have to take longer and you&#8217;re right to reject sample of the sample.<\/p>\n<p>I guess as you say, you know, the cost of that is it takes you 18 months to get out the door and that&#8217;s that&#8217;s how it is so and we deal with a lot of different clients and you know, there&#8217;s there&#8217;s both sides of the spectrum of that we&#8217;ve dealt with some that are just meticulous meticulous and and some that are just whatever doesn&#8217;t matter just give me something out the door. So we try to balance both of those out and<\/p>\n<p>Ryan Shaffett 23:16<br \/>\nat a good pace but<\/p>\n<h3>The danger of the entrepeneur&#8217;s &#8220;Get it out of the door&#8221; mentality<\/h3>\n<p>Michael Veazey 23:17<br \/>\nI&#8217;m in the whatever get out of the door mentality of and the only thing I can say about that is that the amazon customer as we all know is not very good at whatever it does the job if there&#8217;s some tiny wrinkle on the packaging and they&#8217;re having a bad hair day.<\/p>\n<p>Suddenly you got a one star review looking at you right and then it&#8217;s gonna take a lot of work and expense to get a five star review particularly now it&#8217;s so hard to get reviews without risking your so yeah.<\/p>\n<p>Ryan Shaffett 23:43<br \/>\nIt&#8217;s also I&#8217;ve had with that type of client before is that you know the little say, any colors fine, Nicole, whatever color color you think best. Okay, make it whatever color we make, and then they get a couple negative reviews. Pink, why do you do it and paint their? They come back to me? Why do you do it in pink?<\/p>\n<p>Michael Veazey 24:04<br \/>\nYeah, passing of bucks. Number one, right. Yeah. I mean, yeah, if you fail to make a decision, you basically you&#8217;re responsible for what it results, I think. And then they Yeah, I guess I get a lot of it comes down to entrepreneurial responsibility, right, you&#8217;re in charge, but you&#8217;re also responsible. So like, if you make a stupid decision, then it&#8217;s good to be grown up enough.<\/p>\n<h2>Dealing elegantly with exporting and freight<\/h2>\n<p>The final area that I think you guys deal with, which is the whole question of freight, because obviously, as you said, supply chain is the right word. So again, earlier in the supply chain, but once you&#8217;ve created the mold, and all the prototyping all the pain and excitement, of all of that stuff, you&#8217;ve got 10,000 units waiting somewhere on the edge of a Chinese factory.<\/p>\n<p>Obviously, the rest of the supply chain is not inconsiderable, both in terms of the cost and the time, we&#8217;ve talked about those two key metrics save money in time, is that something you guys deal with?<\/p>\n<p>Ryan Shaffett 24:54<br \/>\nAbsolutely, we that&#8217;s another one of our unique values, we try to offer our clients we do monthly shipments to our warehouse in the US, we also the US company that we own the we shipped to our warehouse there where we can break up our shipments for various clients, it creates a lot and we handle the importing there as well.<\/p>\n<h3>Minimum viable unit numbers for Freight<\/h3>\n<p>So first smaller clients that are importing a couple, two, three pallets at a time, it saves them a ton a ton of money, because you know, your minimum costs for importing a single paperclip ship at Ocean might might cost you around around 700 800 US dollars just to import that one thing is the paperwork and the warehouse, I know the idea of see shipping and paychecks.<\/p>\n<p>Michael Veazey 25:38<br \/>\nFor that it&#8217;s like the Rorschach test of the basic raw number. Right? That&#8217;s that&#8217;s the kind of fun experiment $700 costs there.<\/p>\n<p>Ryan Shaffett 25:47<br \/>\nAnd so for that client that needs us to ship a paperclip? Well, we&#8217;ll tell them go away. But in theory, but I quietly was the small shipment that, you know, we can save them six $50 off of that, because we&#8217;re sharing those costs models amongst one or multiple containers in a shipment.<\/p>\n<p>Michael Veazey 26:07<br \/>\nAnd that&#8217;s real. Actually, I want to underscore just how absolutely huge that is. Because I mean, otherwise minimum order quantities on so much about the manufacturer side is what what would the container and you can do all sorts of very complex math to to figure out the optimization of stuffing a container.<\/p>\n<p>But in the end of the day, if your minimum shipping unit is a container, you have to be done in rather frightening amounts of bulk and that that increases risk, right?<\/p>\n<p>Unknown Speaker 26:29<br \/>\nYeah, definitely.<\/p>\n<h3>What XQ Manufacturing can take care of in freight<\/h3>\n<p>Ryan Shaffett 26:31<br \/>\nIf our clients choose to have our company be the importer, then then we can handle all the importing process, we can advise on the probable tax rates beforehand. We were the importer, we handle all those paperwork. So we ship our clients products directly to FBA as they request.<\/p>\n<p>Yeah, send us all your labels and line that up beforehand. But we can slap labels on everything and get it to your FBA warehouse when you&#8217;re just shipping in in smaller pallet size.<\/p>\n<p>And then yeah, tariffs, tariffs and the import duties, we do our best to navigate that if you want us to commit to, to a delivered door to door price with tariffs we can commit to that for you might actually, you know we&#8217;re going to if it&#8217;s not a clear categorization, we were going to add a few percentage points in there, if it is a clear categorization of what the expected cost there is.<\/p>\n<p>But if you want to, if you want to pay those yourselves, we can just advise on on what it&#8217;s probably going to be and we&#8217;ll see what it is after it&#8217;s important.<\/p>\n<h3>Dealing with the Trump trade wars<\/h3>\n<p>You know, right now with the Trump China trade wars, there&#8217;s a lot of uncertainty there as well, whether that&#8217;s dating or conversation right now, and how that&#8217;s gonna, that&#8217;s going to work out in the short term, you know, it might all go away next month, or it might get a lot more intense.<\/p>\n<p>But we try to we try to be on top of that as well and could advise our clients about what they expect. If they start the project right now versus January fed be re there&#8217;s going to be some shifts in that if they don&#8217;t work things out.<\/p>\n<h3>The Chinese Currency &#8211; USD balance<\/h3>\n<p>The nice thing about the the trade war, though, is the Chinese currency has gone down 10%. And so a lot of the tariffs right now or 10%, the currencies a little more complicated in this and the effects of it. But if you&#8217;re ordering your product last year that you&#8217;re still ordering this year, and you haven&#8217;t inquired with your supplier about Hey, can I can we get a lower price on this based on the US dollar price, because<\/p>\n<p>Michael Veazey 28:26<br \/>\nChinese currency is down. Interesting. So presumably, that&#8217;s down against the dollar, by the way, I checked it against the pound, because<\/p>\n<p>Ryan Shaffett 28:33<br \/>\nagainst the dollar, the Chinese currency is generally down because of the trade war. So product prices in Chinese currency in, in any currency should be, should be lower than than last year, of course, in the long term that starts to affect raw materials. And it&#8217;s a complicated thing.<\/p>\n<p>Michael Veazey 28:51<br \/>\nSort of also, team member recording something that&#8217;s I guess that&#8217;s very hard to do, because I really thought that one through and I thought, okay, other competition on the internet, the economics, he was selling on Amazon, for that matter anywhere else in the US are going to be adding, you know, whatever the net amount is of the terrorists, and that&#8217;s the part of the market price of the whole will go up. And then basically, the competition will be around same price probably.<\/p>\n<p>And it turns out to be true in some markets and others. But what I hadn&#8217;t really thought about is the effects in the Chinese currency, and that ultimately that balances back out. So that&#8217;s a really important insight you just gained so you get so it&#8217;s really worth getting back to your money.<\/p>\n<p>Ryan Shaffett 29:32<br \/>\nThanks for a moment where we&#8217;re down. Yeah, we&#8217;re down about 11% versus the US dollar versus before the trade wars started. And most of the tariffs are at 10%. And at least getting 5% cheaper out of your manufacturer should be a should be a strong possibility.<\/p>\n<h3>Starting with a sketch on a napkin is possible for a custom product idea<\/h3>\n<p>Michael Veazey 29:48<br \/>\nExcellent. Well, that&#8217;s a really, really top tip and talk about tactical tip with a massive impact. That&#8217;s fantastic. So thank you for pointing that out. It just really sounds like you can do almost as a project. It seems you can create a product from a sketch on a back of a napkin and an idea, and then get it all the way through manufacturing and get it across the US and into Amazon or anywhere else.<\/p>\n<p>Ryan Shaffett 30:11<br \/>\nWe have made products that started with clients napkin sketches,<\/p>\n<p>Michael Veazey 30:14<br \/>\nthat is amazing. I think if I were looking for an answer now and this is not some kind of plan this isn&#8217;t this is real is not just an observation made out via via, we&#8217;re looking for an answer to this person saying God, I just really need an American manufacturer or American contact on the ground in China to help me develop my best product.<\/p>\n<p>And if I&#8217;ve learned by that point, it would have been great normal things to say, you know what, actually, you should check these guys out wine shopping, they see manufacturing, they seem to know their business. That&#8217;s a British way of saying they&#8217;re awesome, by the way. And that sounds rather understated to American as I&#8217;m sure but there is their businesses, there&#8217;s a high praise as far as I&#8217;m concerned.<\/p>\n<h3>How do sellers work with XQ Manufacturing?<\/h3>\n<p>Do tell us a little bit more about if somebody wants to get in touch with you or find out more about excuse me, sure. Get it right. You manufacturing? How did they get it?<\/p>\n<p>Ryan Shaffett 31:03<br \/>\nYeah, visit our web page at execute manufacturing. com, send me an email at Rs at excuse manufacturing. com love to start a conversation, you know, all projects start with a good conversation trying to understand what you are after we try to move to general quotes pretty quickly pending on the project.<\/p>\n<p>And we can go out on your project or at least giving you a ballpark at what you might be expecting. And it will help you evaluate if this is something I&#8217;ll save time as you evaluate. This is something you want to continue pushing forward with or maybe find another product that might pencil out better.<\/p>\n<p>Michael Veazey 31:41<br \/>\nYeah, and I think that&#8217;s one of the things that always strikes me is that if somebody like yourself is willing to have a conversation with somebody, that conversation in itself, is very, very valuable, because you&#8217;ve been hearing and bought the T shirt on to all the radios and you know, all the other cliches you&#8217;ve done this a million times.<\/p>\n<p>Whereas, for most people, even those who are relative to private label manufacturers, quite big players doing a few million dollars a year in the wider scheme of things, they have very, very little experience of custom manufacturer unless they happen to be doing it. So even if we me with a conversation with you nothing else.<\/p>\n<h3>Advising on options<\/h3>\n<p>Ryan Shaffett 32:13<br \/>\nYeah, and even for those clients who have a fairly good direction about what they want, just as a manufacturer, we we love the you know, hopefully we&#8217;re still able to advise them about you know, have you considered this or that that might save you a lot of a lot of purpose cost on this or allow you later flexibility down the road. And just from a manufacturer&#8217;s perspective, be able to hopefully chime in and add to the conversation even for those who already have a pretty solid direction about what they want to see as an end product.<\/p>\n<p>Michael Veazey 32:42<br \/>\nYeah, that makes a lot of sense. And here&#8217;s the other thing that always always strikes me if you look at some like Tiger Woods, and he&#8217;s probably not the flavor of the month he was from the last few years. But he was a gatekeeper at one point he had seven coaches. And that&#8217;s not guys, the guy can&#8217;t play golf. The guy can play golf because he had seven catches.<\/p>\n<h3>Ask the experts for their opinion &#8211; an all-too-rare habit among entrepreneurs<\/h3>\n<p>So in other words, if you&#8217;re humble enough to ask an expert in an area where it&#8217;s manufacturing or get your cost accountant in or you know an intellectual property lawyer, whatever it is, you&#8217;re humble enough to ask an expert their opinion. They may well tweak processes you&#8217;ve been doing for a decade and save you a ton of hassle money.<\/p>\n<p>It&#8217;s always worth asking and exploit. That&#8217;s why we have you on the show. So Ryan just remains to me it&#8217;s a very insightful I&#8217;m probably asked a lot of dumb newbie questions.<\/p>\n<p>But I guess that at least a certain percentage of the listeners, even if they&#8217;re doing what by by our lights are some decent numbers on Amazon are still going to have some of those questions, but also some very clear minded answers on some quite complex topics.<\/p>\n<p>And also, obviously, you sound like a very, very good person who just have a conversation with at the very least, considering doing custom manufacturing. So thank you very, very much for coming on the show.<\/p>\n<p>Ryan Shaffett 33:48<br \/>\nThank you. It was a pleasure to do this. And thanks for giving me the opportunity.<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_006-ryan-pt2.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fprotecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-5\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_006-ryan-pt2.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9671-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_006-ryan-pt2.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_006-ryan-pt2.mp3\">Download<\/a> (Duration: 34:52 &#8212; 23.9MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_006-ryan-pt2.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fprotecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-6\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_006-ryan-pt2.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9671-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_006-ryan-pt2.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_006-ryan-pt2.mp3\">Download<\/a> (Duration: 34:52 &#8212; 23.9MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 34:52 &#8212; 23.9MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 34:52 &#8212; 23.9MB)Subscribe: Spotify | Email | TuneIn | RSS<\/p>\n","protected":false},"author":1,"featured_media":6577,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1845,1838],"tags":[1550],"class_list":["post-9671","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-custom-product-design","category-running-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Protecting The Product Design with Ryan Shaffett of XQ Manufacturing - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Protecting The Product Design with Ryan Shaffett of XQ Manufacturing - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 34:52 &#8212; 23.9MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 34:52 &#8212; 23.9MB)Subscribe: Spotify | Email | TuneIn | RSS\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-06-14T05:00:32+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-02-01T14:50:14+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/Custom-Manufacturing-for-Amazon-with-Ryan-Shaffett-of-XQ-Manufacturing-blog-post-image.jpg?fit=560%2C315&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"39 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Protecting The Product Design with Ryan Shaffett of XQ Manufacturing\",\"datePublished\":\"2019-06-14T05:00:32+00:00\",\"dateModified\":\"2021-02-01T14:50:14+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/\"},\"wordCount\":8028,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/Custom-Manufacturing-for-Amazon-with-Ryan-Shaffett-of-XQ-Manufacturing-blog-post-image.jpg?fit=560%2C315&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Custom Product Design\",\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/\",\"url\":\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/\",\"name\":\"Protecting The Product Design with Ryan Shaffett of XQ Manufacturing - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/Custom-Manufacturing-for-Amazon-with-Ryan-Shaffett-of-XQ-Manufacturing-blog-post-image.jpg?fit=560%2C315&ssl=1\",\"datePublished\":\"2019-06-14T05:00:32+00:00\",\"dateModified\":\"2021-02-01T14:50:14+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/Custom-Manufacturing-for-Amazon-with-Ryan-Shaffett-of-XQ-Manufacturing-blog-post-image.jpg?fit=560%2C315&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/Custom-Manufacturing-for-Amazon-with-Ryan-Shaffett-of-XQ-Manufacturing-blog-post-image.jpg?fit=560%2C315&ssl=1\",\"width\":560,\"height\":315,\"caption\":\"Custom Manufacturing for Amazon with Ryan Shaffett of XQ Manufacturing on the 10K Collective Podcast with Amazing FBA Podcast\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Protecting The Product Design with Ryan Shaffett of XQ Manufacturing\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Protecting The Product Design with Ryan Shaffett of XQ Manufacturing - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/","og_locale":"en_GB","og_type":"article","og_title":"Protecting The Product Design with Ryan Shaffett of XQ Manufacturing - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 34:52 &#8212; 23.9MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 34:52 &#8212; 23.9MB)Subscribe: Spotify | Email | TuneIn | RSS","og_url":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-06-14T05:00:32+00:00","article_modified_time":"2021-02-01T14:50:14+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/Custom-Manufacturing-for-Amazon-with-Ryan-Shaffett-of-XQ-Manufacturing-blog-post-image.jpg?fit=560%2C315&ssl=1","type":"image\/jpeg"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"39 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Protecting The Product Design with Ryan Shaffett of XQ Manufacturing","datePublished":"2019-06-14T05:00:32+00:00","dateModified":"2021-02-01T14:50:14+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/"},"wordCount":8028,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/Custom-Manufacturing-for-Amazon-with-Ryan-Shaffett-of-XQ-Manufacturing-blog-post-image.jpg?fit=560%2C315&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Custom Product Design","Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/","url":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/","name":"Protecting The Product Design with Ryan Shaffett of XQ Manufacturing - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/Custom-Manufacturing-for-Amazon-with-Ryan-Shaffett-of-XQ-Manufacturing-blog-post-image.jpg?fit=560%2C315&ssl=1","datePublished":"2019-06-14T05:00:32+00:00","dateModified":"2021-02-01T14:50:14+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/Custom-Manufacturing-for-Amazon-with-Ryan-Shaffett-of-XQ-Manufacturing-blog-post-image.jpg?fit=560%2C315&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/Custom-Manufacturing-for-Amazon-with-Ryan-Shaffett-of-XQ-Manufacturing-blog-post-image.jpg?fit=560%2C315&ssl=1","width":560,"height":315,"caption":"Custom Manufacturing for Amazon with Ryan Shaffett of XQ Manufacturing on the 10K Collective Podcast with Amazing FBA Podcast"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/protecting-the-product-design-with-ryan-shaffett-of-xq-manufacturing\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Protecting The Product Design with Ryan Shaffett of XQ Manufacturing"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/Custom-Manufacturing-for-Amazon-with-Ryan-Shaffett-of-XQ-Manufacturing-blog-post-image.jpg?fit=560%2C315&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2vZ","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9671","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9671"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9671\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6577"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9671"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9671"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9671"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}