{"id":9673,"date":"2019-06-11T06:00:17","date_gmt":"2019-06-11T05:00:17","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6564"},"modified":"2020-06-29T08:41:38","modified_gmt":"2020-06-29T07:41:38","slug":"vision-and-goals-for-e-commerce-with-ashley-pearce","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/","title":{"rendered":"Vision and Goals for e-commerce with Ashley Pearce"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_004-ashley-pt3.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fvision-and-goals-for-e-commerce-with-ashley-pearce%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_004-ashley-pt3.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9673-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_004-ashley-pt3.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_004-ashley-pt3.mp3\">Download<\/a> (Duration: 30:55 &#8212; 21.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_004-ashley-pt3.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fvision-and-goals-for-e-commerce-with-ashley-pearce%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_004-ashley-pt3.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9673-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_004-ashley-pt3.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_004-ashley-pt3.mp3\">Download<\/a> (Duration: 30:55 &#8212; 21.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><h1><b>Vision and Goals for e-commerce<\/b><\/h1>\n<p><!--more--><\/p>\n<h2><b>It’s got to be lead by aspiration\/vision and goals<\/b><\/h2>\n<p>The aspiration was to be an employer of choice &#8211; this is a big aspiration for a small business.<\/p>\n<p>It sets a mindset &#8211; it’s not just about people as a resource to get a task done.<\/p>\n<p>If you can get them to operate within operating principles, that will be fantastic.<\/p>\n<p>But you need to live it, not just things on a powerpoint.<\/p>\n<p>&nbsp;<\/p>\n<h2><b>What are your goals for the next year? 3 years? <\/b><\/h2>\n<h2><b>And what is the time frame you plan in?<\/b><\/h2>\n<p>Financial planning has been really good and they now have effective systems for this.<\/p>\n<p>Now <a href=\"https:\/\/www.futurestatemedia.com\/how-to-drive-traffic-to-your-amazon-product\/\" target=\"_blank\" rel=\"noopener noreferrer\">generating organic traffic<\/a> is a big active goal: using social media and publishing own content.<\/p>\n<p>The vision is about securing the current brand and having sustainable sales.<\/p>\n<p>Partly to avoid having Amazon pull the rug on them.<\/p>\n<p>Partly driven by the cost of Amazon sales including commission versus<\/p>\n<h2>Off-Amazon goals<\/h2>\n<p>One goal is to get 1 million visitors to the brand website per year.<\/p>\n<p>It sounds massive but it’s quite attainable when you run the numbers.<\/p>\n<p>At the moment, Ashley has set out goals for the next year for revenue.<\/p>\n<p>But the vision of really growing into an <a href=\"https:\/\/www.futurestatemedia.com\/seo-vs-growing-organic-traffic-whats-the-difference\/\" target=\"_blank\" rel=\"noopener noreferrer\">organic traffic magnet<\/a> is big.<\/p>\n<p>3-5 year planning is still in the works.<\/p>\n<p>The team is going through a planning phase now &#8211; by mid June there will be more of a 3-5 year vision.<\/p>\n<h2><b>Richard Koch: Star Principle<\/b><\/h2>\n<p>Ashley’s personal vision is driven by the Star principle.<\/p>\n<p>The growth rate of 50-80% makes it a star business.<\/p>\n<p>That puts the revenue at about $10 million dollars in 5 years!<\/p>\n<p>In another 5 years, that would be at $65 million!<\/p>\n<p>The goal is to be brand that never dies!<\/p>\n<p>A question Ashley loves is: “Where do you want to be in 100 years’ time?”<\/p>\n<p>&nbsp;<\/p>\n<h3><b>How does the Star Principle work in your business? <\/b><\/h3>\n<p>Ashley read the book then realised they were doing quite a lot of the right things.<\/p>\n<p>The growth rate of e-commerce makes this possible for a business.<\/p>\n<p>You’ll never have no competitors nipping at your heels.<\/p>\n<p>So going out of stock can lead to losing a dominant position in the market.<\/p>\n<p>&nbsp;<\/p>\n<p>They’ve also admitted in some areas that they don’t have star products. As long as they are cash cows, that’s all good as that funds the star products.<\/p>\n<p>&nbsp;<\/p>\n<h3><b>What’s your view of keeping on product lines that aren’t “stars” or cash cows?<\/b><\/h3>\n<p>True, having products in the household gets the name out there.<\/p>\n<p>Sometimes, “dog” products lead on to “star products”.<\/p>\n<p>You can’t really do it based on Amazon data.<\/p>\n<p>&nbsp;<\/p>\n<p>From the logistics perspective, the overhead management of making sure you minimise cost of container logistics is a fine balance.  By now, they are filling containers with no problem so they can be more critical of what they put into containers.<\/p>\n<p>There can be loss leader products that allow you to upsell or cross-sell other products.<\/p>\n<p>It’s harder to do on Amazon. Also, it’s hard to conceive of completely stepping away from Amazon.<\/p>\n<h3><b>Organic traffic: <\/b><\/h3>\n<p>If an average e-commerce store could convert average 3% &#8211; they did 30,000 conversions last year on Amazon. To achieve that, they would need 1 million visitors!<\/p>\n<p>If growing sales 50-80% on Amazon, it’s hard to achieve<\/p>\n<p>There are lots of people selling Chatbots , FaceBook ads etc. If you want 1 million visitors with ads, that could cost you $300-400,000! That could theoretically generate $1 million worth of sales.<\/p>\n<h2><b>The concept of “Profitable variation” (from Richard Koch’s “The Star Principle”)<\/b><\/h2>\n<p>They realised this was what they were doing with their product.<\/p>\n<p>You need to either sell at same price as competition at lower cost so higher profits; or sell at a higher price (premium pricing) for higher profits.<\/p>\n<p>&nbsp;<\/p>\n<h2><b>Premium positioning on Amazon<\/b><\/h2>\n<p>The sellers going after FaceBook ads at $350 a year to drive $1 million in sales, their costs are very high.<\/p>\n<p>But Ashley believes he can get costs down to $30-60,000 cost for 1 million visitors a year.<\/p>\n<p>Plus there is cumulative benefit.<\/p>\n<p>If you amortise over a long period, the cost is lower.<\/p>\n<h2><b>Asymmetric gain principle: <\/b><\/h2>\n<p>We’ve talked about projections and managing velocity.<\/p>\n<p>The asymmetric gain piece is about answering the question: how do we push ourselves?<\/p>\n<p>How far can we push some SKUs? They’ve held back sales on some SKUs because of a lack of cash. Now it’s more affordable to go from say 300 units a month to 600 units for one SKU for example.<\/p>\n<p>One way to assess the risk is to calculate the downside versus the upside.<\/p>\n<p>Looked at cost of putting a couple of SKUs into storage (couldn’t afford to do with all SKUs).<\/p>\n<p>What’s the worst case? Cost of storage &#8211; which can be calculated on spreadsheets.<\/p>\n<p>If they DO achieve the stretch target &#8211; what is the upside in terms of profit over the next 6-12 month period?<\/p>\n<h2>Example of cost-benefit analysis:<\/h2>\n<p>Analysis was: worst case scenario is $10,000 in extra storage.<\/p>\n<p>The upside would be $30,000 on the bottom line just to start with.<\/p>\n<p>This is just for the first “stretch” target.<\/p>\n<p>This was on one order. But this could have big upside for other SKUs<\/p>\n<p>“We’re creating the financial freedom to take risks and be creative”<\/p>\n<p>When there is more cash around, it’s a more exciting place to work &#8211; Richard Koch.<\/p>\n<p>“If you’re in the game, you’d better enjoy it!”<\/p>\n<p>When people talk about financial freedom, it’s about themselves.<\/p>\n<p>&#8220;It’s about financial freedom for my team, which is my extended family.&#8221; &#8211; Ashley Pearce<\/p>\n<p>To hear from Ashley about e-commerce team building, <a href=\"http:\/\/www.10kcollective.com\/building-an-e-commerce-team-with-ashley-pearce\/\">click here<\/a>.<br \/>\nFor the overview of his journey to $1 million run rate in three years, <a href=\"http:\/\/www.10kcollective.com\/10k-002-how-ashley-pearce-got-to-1-million-a-year-on-amazon\/\"> click here<\/a>.<\/p>\n<hr \/>\n<h2>Transcript<\/h2>\n<p>Michael Veazey<br \/>\nObviously, actually, you&#8217;ve got a great vision of being the employer of choice. And I think that&#8217;s entirely possible, by the way for small business. Because, as Jim Collins said, in his book, good to great and things since then and small, does not mean bad and big does not mean great. I think you can be small and wonderful, you know, kind of that Swiss thing and as small as beautiful. I think in many ways, the biggest firms aspire to a kind of family atmosphere that the best small firms can create anyway. But obviously, there&#8217;s going to be more to them just being a great employer. So what would you say your main visions and goals for your business that you&#8217;re trying to inspire your team members, and indeed yourself over the next year, and maybe the next three, five years? In fact, one question is what sort of planning and goal horizon do you use?<\/p>\n<p>Ashley Pearce<br \/>\nYeah, it&#8217;s an interesting question, because we&#8217;re actually going through a process now of understanding how we do it in an effective way. And we were very good as you can, as you&#8217;ve heard it, kind of doing our financial planning and predictions and linking that all back down to kind of the tactics and maneuvers that we&#8217;re doing on a weekly and monthly basis, we&#8217;ve kind of had a real real think about sort of where we want to be from, where our sources of income and how we&#8217;re going to manage those sources of income and minute, minimize our risks and things are going to be in the future. And that&#8217;s where we&#8217;ve, we&#8217;ve kind of really set up a solar around generating organic traffic, and like I say, doubling down on social media, Pinterest, and publishing a lot of content and and actually, some real pushes towards publishing more. But I mean, that those are the things that we&#8217;re actively doing, to move towards, at the moment, the vision is around securing the current brand, making sure that we have sustainable status sales, and that we don&#8217;t feel massively at risk of having the rug pulled from underneath us by Amazon. And this was all kind of inspired by a bit of a thought on the cost of cost of traffic versus that we were generating versus the cost of traffic that we were getting from Amazon, obviously, everyone knows that you pay your commission, whatever that might be 15% of a sale on Amazon. And so we&#8217;ve kind of used that also to kind of set ourselves a bit of a bit of a budget and a bit of a vision of where we want to go and what we want to do. And one of the things that the team have been kind of clued into and kind of part of is this whole idea behind it behind a million visitors strategy. So the million visitors visitors, aspiration is about having a million visitors through our website per year, which sounds sounds massive, and actually is quite attainable when you we reverse engineer the numbers. And we are going to do another episode on organic traffic where we can actually dive into those numbers and the costs associated with them. And we can do a bit of a deep dive of comparison of organic versus paid and all those types of things. But yeah, we&#8217;ve we&#8217;ve kind of at the moment, set ourselves out some some kind of some visions or visions for the next year, revenue, but I will not necessarily simply our call is a principal vision just a bit of a target. But the vision of really growing into an organic traffic magnet is is quite significant for us. three and five years is kind of where we&#8217;re putting together at the moment. That&#8217;s that&#8217;s still in the works. It&#8217;s funny actually the my fantastic team, and I won&#8217;t get away with not saying that on the podcast, my fantastic team. There we are. So you guys, I said it twice. Or actually, they&#8217;ve been with me for a few minutes or a couple of months actually. And we&#8217;re going through a planning phase. So come the beginning of June and mid June, we&#8217;ll have more more kind of vision setting for the next three to five years. But we&#8217;re I&#8217;ve personally come at it from his inspiration from rich cash and the star principle. And I&#8217;ve mentioned I kind of growth rate between 50 and 80%. That would in in Richard cautious definition at least be deemed a star business. Especially if you look at the the market and the growth of the market just in e commerce in general is seeing therefore, you know, our aspiration is to fall in line with with Richard cautious star principle and then continue on that path to 5050 to 80% growth. I think the phenomenal numbers are if we grew 50% per year for the next 10 years, we would be a $75 million business. And even if we did that for the next five years, we&#8217;d be a $10 million business. And that&#8217;s, you know, those are real big numbers. Those are sustainable company numbers, you know, companies, they&#8217;re going to be here in 100 years time. And that&#8217;s that&#8217;s our vision, the in the simplest and highest form, we want to we want to be an employer for the rest of the for our teams working lives in the working lives of those teams that follow on behind them. So and the overall goal is to Yeah, to be in business and continue to be in business and be a be a brand that actually never dies. And when that goes on to grow and grow and be sustainable. And that that&#8217;s taking you from kind of the real minute, minute should detail of this year will do $1.25 million, right the way through to where do you want to be in 100 years time? Well, we want to still exist, and we want to be successful. And hey, we&#8217;re, we&#8217;re paving the path in between. So watch this space. Yeah.<\/p>\n<p>Michael Veazey<br \/>\nAmazing. Where do you want to be in 100 years time? I like the thinking. So yeah, the goal is to be a brand that never dies. So that&#8217;s one hell of a hell of a different time scale. I mean, that apparently back in the 80s, there were Japanese companies that had hundred year plans, which always struck me is kind of insane. But maybe maybe it forces you to think seriously longtail I mean, famously, Jeff Bezos, himself, of course creator of Amazon, or a co creator or founder, but thinks in terms of seven year plans, and I guess most people around and thinks in terms of three to five, which automatically puts you ahead to some degree, at least on paper. And what did you say the number was a growing growth rate of 50 to 80% a year? What did you say that puts the revenue at $10 million? A year in five years? Or what? What was that number?<\/p>\n<p>Ashley Pearce<br \/>\nYeah, so yes, rate of 50% per year, but we put it about $10 million in in five years?<\/p>\n<p>Michael Veazey<br \/>\nYeah, it adds up, doesn&#8217;t it?<\/p>\n<p>Ashley Pearce<br \/>\nimpact of the compound effect is that within another five years, the revenue would have grown by 65 million. So yeah, it that&#8217;s the power of of that 50% growth per year. Such a massive difference between that and, and the numbers that so far between it. So yeah, yeah.<\/p>\n<p>Michael Veazey<br \/>\nWow. Yeah, that&#8217;s that&#8217;s kind of insane, isn&#8217;t it? I mean, I guess the trick is to sustain a 50% growth rate when you&#8217;re a $10 million company, rather than when you&#8217;re a $1 million company. But on the other hand, if you&#8217;re in a place like cameras in an e commerce at the moment, anyway, those kinds of growth rates are not inconceivable. So just reminds me of your understanding of the star principle? And how is that really being part of your growth story so far?<\/p>\n<p>Ashley Pearce<br \/>\nYeah. So it&#8217;s interesting, because I&#8217;ve read the book kind of after I&#8217;d applied many of the principles and then reverse engineer the fact that actually that they were the principles we were playing. So when we were when we looked at the market, we looked at where we were going to apply our differentiation or in the way that Richard cash describes it, our profitable variation. And our profitable variation was the fact that we were offering a premium product, it was costing us more. But through offering a premium product, we were charging more, and overall, generating more profit. So that was our original incarnation of source of profitable variation. And the oldest part of the kind of the growth component, there&#8217;s demand demanded from Richard crushes that whole growing at more than 10% per year. And if you just look at the e commerce space, and the amount of people that are just coming online, every year, globally, growth rate of 10% is not going to be a short for, you know, the hundreds of years, but in my foreseeable career, there&#8217;s definitely a growth rate of more than 10%. To be to be taken after for the next foreseeable years. And yeah, the the dominating the market peace, well, that&#8217;s where that that differentiation and profitable variation comes into. As I said, you know, you&#8217;re never going to be in a situation where you haven&#8217;t got competitors trying to snip it unit hit snip at your heels. Hence, once again, you&#8217;re coming back to the whole thing about not going out of stock, you got a stock, and that gives your competitors an opportunity to steal a match, you are no longer the star business because you&#8217;re no longer generating any revenue with that line or with that skew or with with your brand if you&#8217;re out of stock. And so you can very quickly overnight, lose your your star positioning in the market, your dominant position. So yeah, that that&#8217;s, that&#8217;s a principle we take to heart. And we&#8217;ve, we&#8217;ve also admitted in some areas where we&#8217;re not winning or haven&#8217;t Scott star products, but that&#8217;s fine. Because if we&#8217;ve got some cash cows, that&#8217;s something that we can something we can work with. But also equally if you&#8217;ve got some question marks or dogs, those are the ones that we need to be seeking to replace with either cash cows in the short term or or aspiring to replaced with some stars. And if you haven&#8217;t read the book, I would definitely advise reading it and kind of getting that understanding. Because it&#8217;s a it&#8217;s a good framework to just think about business and, and even down to thinking about specific skews about so<\/p>\n<p>Michael Veazey<br \/>\nyeah, absolutely. Yeah, I mean, so this is just to create quickly summarize, for people aren&#8217;t familiar with it. Yeah. 100%, read the book, I&#8217;m always banging on about it. And now you seem to be kind of, you know, flying the flag for Richard crosses star principle, even more than me, which is fantastic. Because I do think it&#8217;s really simple, but it&#8217;s robust. And it&#8217;s maybe simple, but it&#8217;s one of those wonderful bits of wisdom that is simple, but not simplistic, ie the principles easy, but to implement it is difficult and takes some guts, but really rewards people who do it because we see it in the masterminds all the time. Right? The people are doing really well dominate their markets, if there&#8217;s no question and the internet is all about niche market. So if it holds true for business in general, I think it&#8217;s probably doubly true for internet based because it&#8217;s a growing rapidly growing medium. So a small business can become a very valuable business quite swiftly. But then also, yeah, because it&#8217;s about niche. And you can you can fulfill niches online, which would make no sense if we did it in a small town. So yes, the the other functions of products, the other things in products, I should say they&#8217;re high growth, high profitability products, where you are the leader in your niche, a star products, the cash cows, were your leader in low growth niche, and then the dogs are where the niche is growing slowly, and you&#8217;re not the leader. So get rid of those and an awful lot of banners and products, even though a lot of otherwise successful businesses come under that heading, I would say. So a lot of people could do with a good hard look at their product mix. So I&#8217;m really glad that you take him and that that was originally why the Boston Consulting Group created that by the way, it was a tool for analyzing, not so much if you got a great business full stop, great. Let&#8217;s go home and drink cocktails and celebrate it was more like okay, let&#8217;s look at the spread of your products. Where do they fall in this sort of matrix and most important thing in some ways to be aware of what the dog products are that have no future, therefore should be dealt with rather, you know, toughly and got rid off. And there&#8217;s always an interesting resistance about that, when I talked to even pretty experienced e commerce sellers. Right. I mean, what&#8217;s your view on that? Do you think there&#8217;s a place for having some products that help you keep your brand out there, but otherwise? Not good products? Or do you think you just have to have cash cows and, and start products and cut everything else?<\/p>\n<p>Ashley Pearce<br \/>\nYeah, it&#8217;s an interesting, interesting topic. And it&#8217;s one that we&#8217;ve we&#8217;ve kind of danced back and forth with actually, we&#8217;ve thought about the fact that actually, when we sell products, we we are, regardless whether we&#8217;re selling them on Amazon, we are generating an audience. And those are people who&#8217;ve got our products in their households. And many of our customers actually go and purchase not just one of our products, but then go on to purchase other parts of the range. And so as a result, and you can&#8217;t necessarily understand the full lifetime customer value and the impacts of bringing somebody in who might conceivably buy what you might refer to as a dog product. But they end up then going on to buy three UV star products, but they wouldn&#8217;t have found the side products had they not found dog product. So there&#8217;s kind of a difficult analysis that an impossible analysis that can can be done, it can&#8217;t be done there when it comes to us utilizing Amazon data. But that and and that&#8217;s kind of like from the front end perspective, from the back end and logistics perspective. As I said, going back to the podcast kind of 12 months ago, the overhead management if you like, making sure that you&#8217;re minimizing the cost of logistics for every product in the container versus chopping off the the dog products and losing, you know, basically having to swallow the overhead with a smaller number or a smaller range of products is abundant fine balance, you&#8217;ve got a strike, we&#8217;ve actually now reached the point where we are filling containers without a problem. So we&#8217;re actually in a position where we we are being more critical of, of the products we&#8217;re keeping on just because they filled space, and they made it made our logistics and everything else cheaper. Now, now we&#8217;re moving more towards that thought process of you know, actually how many of these products are getting products, ones that get us into, into people&#8217;s houses and into people&#8217;s lives that then allow us to, to grow and expand the lifetime customer value of that that customer.<\/p>\n<p>Michael Veazey<br \/>\nIt&#8217;s interesting, I&#8217;m guessing that like everything in life, there&#8217;s probably an 8020 curve. So you&#8217;ll never get away from at 20. But the curve might be, as it were, if I&#8217;m visualizing a container of 10 product lines, or you know, whatever plus variations, let&#8217;s keep it simple, that maybe the NC 20 curve starts to drop off slightly outside of your container. In other words, there could be a multitude of potential products you&#8217;re cutting out, which wouldn&#8217;t be very profitable, but most of the products you&#8217;ve got are profitable or very, very profitable. And those are the ones that you stock in a container. So in other words, if you&#8217;ve got limited space, and in your container, but actually pretty decent sales of what you&#8217;ve got in there, you can actually you have to be selective, and that means it&#8217;s very profitable. Whereas probably earlier on in the product, sales lifestyle cycle, you&#8217;ve got a bit of a jewel problem, because you&#8217;ve got lower sales per skew. So you probably need to pack the container with more. So yeah, it&#8217;s probably one of those things that there is probably a way of modeling it mathematically. But to put it in simple terms, I guess the early on you are the less optimal a lot of your processes and parts will be and as you can gradually approach optimal sales per skew, you can start optimizing everything else as well to eventually just focus on Star products in cash cow products. But it is a very, very instant question by and then when you look into it deeply, there is no simplistic answer to it that the very smart guys and gals of there, the partner masterminds have found so far anyway.<\/p>\n<p>Ashley Pearce<br \/>\nYeah, and like I say when it when it when it comes to, to kind of off Amazon and knowing a little bit more about your customer and lifetime customer value, you can understand which products may be are your loss leader products, because they&#8217;re the ones that bring people in, but then allow you to remarket further on and you know that that&#8217;s that&#8217;s a that&#8217;s obviously a business model that other people are using outside of Amazon, it&#8217;s something that you could potentially integrate towards. But the the difficulty and it is getting to that point where you&#8217;ve generated enough interest, enough traffic that justifies kind of going down that route and stepping away from from the Amazon side of things. And it&#8217;s very difficult to conceive of a time where you would want to step entirely away from Amazon, if I&#8217;m perfectly honest, it for us as a business. It is cost effective traffic for what it is. And it&#8217;s a fantastic platform to kind of get you started.<\/p>\n<p>Michael Veazey<br \/>\nYeah, the same thing. So just going back to what you say, because I know from conversations with you that you&#8217;re obviously got a massive focus on developing organic traffic, like a million blog visitors a year or website, visitors years, obviously quite a target. But I guess the question is what you do with that traffic? And I know in your case that you&#8217;re probably going to be pushing it back towards Amazon, rather than just your own Shopify site. Is that a fair summary?<\/p>\n<p>Ashley Pearce<br \/>\nYeah. So I mean, you know, in brief numbers, if you were to say that an average e commerce store could convert, say, 3% of visitors is a million visitors, that&#8217;s 30,000 conversions. And 30,000 conversions is what we did last year. So this year will do more than that, just to achieve what we achieved last year, with an e commerce store, we would need a million visitors. And that that gap is going to grow unless we start to close that gap by by really going after big aspirational numbers like a million business.<\/p>\n<p>Michael Veazey<br \/>\nOkay, so what is the objective with the organic traffic then? Are you sending it to Amazon? Are you going to use that to run your own e commerce store?<\/p>\n<p>Ashley Pearce<br \/>\nSorry, Yeah, we are. Yeah, we definitely we utilize in because because of that traffic, even if we hit a million visitors, actually, we don&#8217;t eat just about reach. And that&#8217;s where the 3% conversion rates are pretty decent conversion rate, and e commerce. So we don&#8217;t need just reach the level of sales that we achieved last year. And if we&#8217;re growing our sales 50 to 80% per year on Amazon, the realities of the situation on the Amazon is always going to outstrip that, that that number, it made me We will catch up, maybe we might overtake in the future. But it&#8217;s something that you&#8217;ve got to invest heavily in something we are investing heavily in. And we definitely want to get that organic traffic, but we we don&#8217;t necessarily see it as an off Amazon strategy, we see it as an as well as Amazon strategy, that something that will be our secret sauce, our profitable variation if you like. So there&#8217;s loads of people out there selling chatbot courses, chatbot ads, Facebook ads, Instagram ads, and all these other things that you&#8217;ve got to do. And you&#8217;ve got to go and get expensive video assets for and all these other things. Right. So you want to get yourself a million visitors without SEO now that could cost you upwards of 350 $400,000 potentially, you want those kinds of conversions. You know, if you&#8217;re paying those sorts of that sort of money here Yeah, that&#8217;s that&#8217;s pretty serious e commerce territory. But equally, you know that that could only that could theoretically generate you about a million dollars worth of with a sales. So it&#8217;s not some guys out there spending 350 grand a month in the quantum world, you know that that&#8217;s that&#8217;s the expensive of traffic, right? So the secret sauce for us is we&#8217;re we&#8217;re looking, you know, coming back to the Richard cash star principle, we&#8217;re looking for profitable variation in our traffic as well. And so tell me more about this concept of profitable variation. Because you mentioned a couple of times, I think it&#8217;s probably worth digging into what what does it really mean?<\/p>\n<p>Michael Veazey<br \/>\nThey say<\/p>\n<p>Ashley Pearce<br \/>\nthat Yeah, yeah. So so it essentially, when cautious talking about going outside the main market, what&#8217;s going to make you more profit than the main market? Because if it doesn&#8217;t mean, if your niche doesn&#8217;t make you any more profit than the main market, why? Why are you even doing it. So you need to sell something for the same price. But do it for a lower cost. So you can increase your profit margin, or you sell something for a greater price and greater cost, but you still manage to increase your your profit margin. So that&#8217;s the latter one, there is the version we used in our premium product placement, we increase the price in the market and people people still bought. But we also obviously increased our cost to kind of provide that premium feel. But the the profit margin in the middle is is also bigger than what the other guys were getting at the lower price. And in this version of profitable the profitable variation, where I&#8217;m actually saying is that the guys are going after the their Facebook and Instagram ads 350 grand a year see to get their million dollars in sales and their costs, right up there. Whereas I based on our strategies and believe that we can get that sort of traffic for a lot cheaper than that. And so what sort of<\/p>\n<p>Michael Veazey<br \/>\nwhat&#8217;s the cost is the obvious question. Yeah, so somewhere between six to<\/p>\n<p>Ashley Pearce<br \/>\n10 times smaller, so it&#8217;s somewhere between basically 35 and $60,000 should get us that kind of traffic<\/p>\n<p>Michael Veazey<br \/>\nfor a million visitors a year.<\/p>\n<p>Ashley Pearce<br \/>\nYeah. And, and wow. And that&#8217;s not many, we&#8217;ll have to throw at it again. And again, whereas obviously, with ads, there&#8217;s no cumulative benefit, you switch off the ads, you start getting the traffic with organic traffic, you invest the cash, and then the benefits can be cumulative. And so in theory, you could throw that money at it, but then you essentially, you&#8217;re not assured that traffic, but you can, you can get that traffic this year, next year, and maybe even the year after. So when you amortize it over a long enough period, the cost of traffic, organic wise is miniscule in comparison with the cost of traffic, using ads. So So that&#8217;s our, that&#8217;s our innovation and our kind of, like I say, our version of profitable variation at the moment, we should be able to afford to sell our product at the same price we&#8217;re selling out right now, but will increase our profit margins<\/p>\n<p>Michael Veazey<br \/>\nhere. Interesting, I was just making rough calculations have you got $60,000 cost 4 million visitors, that&#8217;s the cost of six cents per visitor. So if your conversion rate is it, then you can probably afford quite a low conversion rate. That&#8217;s like like, like, say it&#8217;s, you know, 2%, that&#8217;s going to cost you $3 per sale. I mean, that&#8217;s actually you know, it&#8217;s not that far off, what you might end up saying, paying for Amazon ads or something, it was ad driven sales, but it&#8217;s a whole new source of them, right. So you can just, you know, increase the traffic a great deal, it&#8217;s going to cost you money. But then of course, the damage in everything is about tweaking the algorithm into action. So if you can drive some ad driven sales, with Amazon ads, it&#8217;s conventional wisdom that you do that aggressively to start with, and then you push the algorithm to action, and it takes over it starts ranking your product. But if you can do that, again, at a similar cost, that suddenly becomes quite a viable addition to your arsenal right now, it&#8217;s going to be interesting to follow. And we have to get you back on in a few months to to give us an update on that. And of course, we are going to delve into that as well, like ever these things are persuaded to you into hopefully not against your best judgment into coming on for a series of interviews, because I think there is so many things to dig into. I know from discussions at the thinker collective meetings that there&#8217;s lots to get into. So let&#8217;s begin to bring this baby home because we both probably can do other things. The asymmetric game principle, I know something that you&#8217;ve mentioned, and I want I&#8217;m Branson principles rather than worrying too much about ranking and stuff, we can get into that in another podcast. But what would you say has been the implication or the implementation of this principle in your business over the last 12 months or so?<\/p>\n<p>Ashley Pearce<br \/>\nYeah. So yeah, actually, it&#8217;s a it&#8217;s a really big one, because we&#8217;ve been talking about obviously, projections, forecasts and managing to a forecast with Amazon sales last year management. And like I say, if you maybe made the connection there between building organic traffic and Amazon sales last year management, you probably also know starting to think I can see how all this stuff kind of starts to work together. The asymmetric game pieces actually slightly slightly pushing us towards how do we stretch this now? How do we push ourselves, we&#8217;ve got some operating capital. And we want to see, in some cases, how far we can push some of our skews, we&#8217;ve been in many cases holding back some skews probably for 18 months, just because we haven&#8217;t had the cash to keep them as in stock as we&#8217;d like to have kept them. And you can see that they&#8217;re operating three 400 sales per month, actually, we think theoretically, they might be be able to go to six 700. Now that&#8217;s a that&#8217;s a problem. When it comes to capital and cash flow management and all those types of things. If you take those sorts of bets, you you risk, having all sorts of inventory implications and not having the cash available to place further orders, you know, all the stuff we&#8217;ve just been talking about. But one of the things that we&#8217;ve we&#8217;ve most recently done in thinking about this, like, say, asymmetric gains. And what&#8217;s thinking about what&#8217;s the downside versus what, what&#8217;s the upside, one of the things we&#8217;ve done is we&#8217;ve calculated exactly how much it costs us to basically put some of our skews, the ones that we want to see, we want to test how fast those babies can run. And we&#8217;ve managed to cost of how much it will be to put them into storage and made sure that we&#8217;ve got the cash liquid cash available to, to kind of stretch a couple of skews, and we couldn&#8217;t afford to do it with every school. So we&#8217;ve chosen ones that we believe have the potential. And then we&#8217;ve done a calculation to say Well, hey, you know, if these skews, continue to sell at the they&#8217;re selling, and we completely wrong about this theory, this hypothesis that they can sell a lot faster. What&#8217;s the worst case, it&#8217;s going to cost us some more money in storage, right? So we, as you might have gathered by now we&#8217;ve got some detailed spreadsheets that will tell us exactly how much that will cost us in storage. And then on the flip side, if we do manage to achieve the sales velocity that we&#8217;re talking about this stretch target, what&#8217;s the upside? And what would it deliver to us in additional profit, and not just in that quarter, but then over this maybe six months or 12 month period? And then and the way we we kind of did that analysis was to say, Well, hey, worst case scenario, this is going to cost us 10 grand to keep these things in storage, we wouldn&#8217;t otherwise and purchase them and all these other things that we wouldn&#8217;t otherwise have done that. So right. Okay. But what&#8217;s the upside? Well, the upside was 30. Grand, what right on the bottom line? And that&#8217;s just to start with, if we start to get into exciting conversations about well, you know, if we&#8217;ve not tested the headroom on these products, how far can they go, this is just the first stretch target. Just on this one order, we were like, well, the The upside is 30. The downside is 10 I&#8217;ll take that bet every day, I&#8217;ll take that bet all day long. And, and that that for me is kind of one of the best examples of the asymmetric gains that we&#8217;re looking at minimal downside uh, but the the the upside could be exponential, the upside could be could be big, admittedly, in that particular example, I, you know, put an upwards number on it, I&#8217;ve said that the benefit to our bottom line could have been 30 grand. But in reality, if we test this test this idea, we can then run it out across other skews. And that actually just started that chain reaction off of ability to, to throw 30 grand on the bottom line, that allows us to reinvest that cash and go and do this where the other skews and and the flywheel the asymmetric gains, that the momentum, whatever you want to call it, the the potential starts to grow and starts to get quite exciting. So that that&#8217;s how we kind of apply in that in our business at the moment. And then, I mean, well, one of the things that we we kind of operate by and something my team should should recognize when I say it is that we&#8217;re creating the financial freedom to take risks, and be creative. And that&#8217;s what my business is all about. And we&#8217;re looking to create financial freedom for the business. Because then when there&#8217;s more cash around, and the cash says this, again, his work, when there&#8217;s more cash around, it&#8217;s a far more of an exciting business to work in. So that&#8217;s that that&#8217;s kind of, yeah, where we&#8217;re going with that. And asymmetric gains are a key part of making sure that we, we do have those have that income and have those risks being taken. But you know, they creative and they could pay off.<\/p>\n<p>Michael Veazey<br \/>\nAmazing, I really like that. And I think we got a we got to wrap up on that. Because it&#8217;s such a perfect phrase, the first week, quote, we&#8217;re creating the financial freedom, to take risks and be creative. And I think you&#8217;ve just shown just how, and this is so consistent with the way you are And your curiosity and excitement about business and the creativity that you can have. And this has been one of the surprises for me coming into business. I mean, my motivation was originally to, you know, make a million dollars as quickly as possible, and then find an orchestra. And I kind of, you know, that didn&#8217;t happen for me and I miss him. But what I did discover is that business can be an extraordinarily creative, and fun thing, if done with the right mentality, but your mentality is not really about taking risks, and then getting financial freedom for yourself it&#8217;s taking is create the financial freedom for the business to take the risks and be creative. So in other words, the end of it is you&#8217;re about being creative, and being able to take risks. And that&#8217;s what you do as an entrepreneur. And that&#8217;s what&#8217;s fun, right? That&#8217;s, that&#8217;s the impression I get. And that&#8217;s so summed up in that statement. So in other words, really, the reason to be an entrepreneur is to be an entrepreneur, because it&#8217;s cool and fun, rather than because you might make money and sit on the beach, tapping our laptop, just to reference, the thing we mentioned our last podcast about a year ago, and we find the beach is pretty lousy and the same that&#8217;s in the keyboard, I don&#8217;t recommend it to anybody.<\/p>\n<p>Ashley Pearce<br \/>\nIt&#8217;s a great game, and you know, the you, if you&#8217;re in the game, you better enjoy it. And that&#8217;s the that&#8217;s the key bit for me. And it maybe it was a difficult message initially, because whenever anybody talks about financial freedom is typically about for themselves. And I think, again, I always like taking a bit of a contrarian view or a surprising view. I think that&#8217;s why I basically copied that phraseology, because because it&#8217;s right, I&#8217;m not just about creating financial freedom for me and my family. It&#8217;s about financial freedom for me and my team, who are my extended family. So yeah, it&#8217;s, it&#8217;s a principle that will keep keep going by and then, like I say, hopefully those asymmetric gains will start to pay off, I&#8217;ll be able to tell you maybe in a couple minutes time, whether that bet was a good one or not.<\/p>\n<p>Michael Veazey<br \/>\nExcellent. Well, like I said, we&#8217;re going to leave it on that that is such a positive message. Thank you so much for coming on to share your Desert Island Discs. And we look forward to having you back on the show soon to delve into all these exciting things that you&#8217;ve been mentioning. So that&#8217;s going to include organic traffic, I think you&#8217;re going to talking about predicting stock and cash flow management, some more than nitty gritty stuff, but for now, many many thanks for coming on.<\/p>\n<p>Unknown Speaker<br \/>\nNo problem, Michael, thank you very much.<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_004-ashley-pt3.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fvision-and-goals-for-e-commerce-with-ashley-pearce%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-5\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_004-ashley-pt3.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9673-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_004-ashley-pt3.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_004-ashley-pt3.mp3\">Download<\/a> (Duration: 30:55 &#8212; 21.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_004-ashley-pt3.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fvision-and-goals-for-e-commerce-with-ashley-pearce%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-6\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_004-ashley-pt3.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9673-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_004-ashley-pt3.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_004-ashley-pt3.mp3\">Download<\/a> (Duration: 30:55 &#8212; 21.2MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 30:55 &#8212; 21.2MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 30:55 &#8212; 21.2MB)Subscribe: Spotify | Email | TuneIn | RSSVision and Goals for e-commerce<\/p>\n","protected":false},"author":1,"featured_media":6545,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1550],"class_list":["post-9673","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Vision and Goals for e-commerce with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Vision and Goals for e-commerce with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 30:55 &#8212; 21.2MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 30:55 &#8212; 21.2MB)Subscribe: Spotify | Email | TuneIn | RSSVision and Goals for e-commerce\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-06-11T05:00:17+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-29T07:41:38+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"35 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Vision and Goals for e-commerce with Ashley Pearce\",\"datePublished\":\"2019-06-11T05:00:17+00:00\",\"dateModified\":\"2020-06-29T07:41:38+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/\"},\"wordCount\":7199,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/\",\"url\":\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/\",\"name\":\"Vision and Goals for e-commerce with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-06-11T05:00:17+00:00\",\"dateModified\":\"2020-06-29T07:41:38+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"building an e-commerce team with Ashley Pearce of Future State Media on the 10K Collective Podcast with Amazing FBA Amazon Prodcast\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Vision and Goals for e-commerce with Ashley Pearce\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Vision and Goals for e-commerce with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/","og_locale":"en_GB","og_type":"article","og_title":"Vision and Goals for e-commerce with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 30:55 &#8212; 21.2MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 30:55 &#8212; 21.2MB)Subscribe: Spotify | Email | TuneIn | RSSVision and Goals for e-commerce","og_url":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-06-11T05:00:17+00:00","article_modified_time":"2020-06-29T07:41:38+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"35 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Vision and Goals for e-commerce with Ashley Pearce","datePublished":"2019-06-11T05:00:17+00:00","dateModified":"2020-06-29T07:41:38+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/"},"wordCount":7199,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/","url":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/","name":"Vision and Goals for e-commerce with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","datePublished":"2019-06-11T05:00:17+00:00","dateModified":"2020-06-29T07:41:38+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"building an e-commerce team with Ashley Pearce of Future State Media on the 10K Collective Podcast with Amazing FBA Amazon Prodcast"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/vision-and-goals-for-e-commerce-with-ashley-pearce\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Vision and Goals for e-commerce with Ashley Pearce"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2w1","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9673","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9673"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9673\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6545"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9673"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9673"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9673"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}