{"id":9674,"date":"2019-06-07T06:00:47","date_gmt":"2019-06-07T05:00:47","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6561"},"modified":"2021-07-07T04:49:52","modified_gmt":"2021-07-07T03:49:52","slug":"building-an-e-commerce-team-with-ashley-pearce","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/","title":{"rendered":"Building an e-commerce team with Ashley Pearce"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_003-ashlet-pt2.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fbuilding-an-e-commerce-team-with-ashley-pearce%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_003-ashlet-pt2.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9674-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_003-ashlet-pt2.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_003-ashlet-pt2.mp3\">Download<\/a> (Duration: 35:34 &#8212; 24.4MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p><!--more--><\/p>\n<h2><b>How does Cashflow projection tie in with sales\/stock prediction?<\/b><\/h2>\n<p>At a simple level: the sales velocity you’re managing to will deliver a revenue a month.<\/p>\n<p>That is then shared between your business and Amazon, and you’re left with those cash surpluses every two weeks.<\/p>\n<p>Meanwhile you either have stock on order, on the water or in Amazon.<\/p>\n<p>So at any one time,  you’ve got capital tied up in product or in money in the bank.<\/p>\n<h3>Cashflow example<\/h3>\n<p>Say you’re aiming to sell 500 units per month of something and trying to manage that over 3 months (placing  orders every 3 months) &#8211; so you’re replenishing at a rate where you know you’ll have the cash in the bank to pay.<\/p>\n<p>That only happens if you’re importing in the same amount of stock as you sell &#8211; 3 months of stock in container; 3 months’s sales. That’s where stock prediction ties in with Cashflow projection.<\/p>\n<p>This does require some complex modelling.<\/p>\n<p>If you import 3 months’ worth of stock and it’s not sold through yet when new stock turns up, you’ll have a cashflow bottleneck.<\/p>\n<h3>Think in terms of liquid cash<\/h3>\n<p>Think in terms of cash locked up vs. Liquid cash.<\/p>\n<p>Ask yourself the question: how many times are you going to turn your stock this year? (Again, the stock prediction piece)<\/p>\n<p>Ashley’s company’s target is 4 months a year (3 months’ stock plus a bit of overstock)<\/p>\n<p>Buffer stock is not liquid!<\/p>\n<h3><b>Inventory Perform Index &#8211; what is it and how does it affect the discussion?<\/b><\/h3>\n<p>Introduced about 12 months ago (mid May 2018) in the USA by Amazon to manage the velocity of stock turnover.  The main metric in the IPI turns out to one of the more important metrics, especially if you’re storing a lot of products at FBA: the <b>sell-through rate. <\/b><\/p>\n<p>This means that stock prediction is more important than ever.<\/p>\n<h3><b>Sell-through Rate (IPI)<\/b><\/h3>\n<p>If you sold all of your stock in 12 months, that would be a “sell-through rate of 1”.<\/p>\n<p>The formula is:<\/p>\n<p>Sell-through rate= stock you sell ÷  stock you have.<\/p>\n<p>If you put 3 months’ stock in amazon and sold through in 3 months, that’s a sell-through-rate of 1.<\/p>\n<p>That’s the lowest acceptable performance in Ashley’s case. If you can turn stock 4 times a year, you’re doing very well.  If your sell through rate drops really low plus storing quite a volume of product, that can impose limitations on the amount of stock you can store at Amazon.<\/p>\n<p>The magic number is “350” on the IPI. Anything over the limit is charged at 10 times the normal rate. They have a forward forecast of what IPI would be every month &#8211; this shows what you can keep at Amazon and what is externally stored.<\/p>\n<h2><b>Building an e-commerce Team <\/b><\/h2>\n<h3><b>At what point do you start expanding an e-commerce team?<\/b><\/h3>\n<p>The simple answer is when you run out of capacity!<\/p>\n<p>However Ashley felt that there was a need to start building an e-commerce team early.<\/p>\n<p>The freedom to make those decisions was based around accurate cashflow and sales projections.<\/p>\n<p>The questions were: Can we afford to take a team on? At what point?<\/p>\n<p>What tasks will my e-commerce team need? What skill sets needed?<\/p>\n<h3><b>Ecommerce Marketing Team Structure<\/b><\/h3>\n<h3><b>How do you justify that financially? <\/b><\/h3>\n<p>In Nov\/Dec 2018 the e-commerce team structure looked like this:<\/p>\n<p>Ashley &#8211; ran Amazon<\/p>\n<p>Ole &#8211; marketing assistant (UK based works alongside Ashley) &#8211; was managing all off-Amazon things &#8211; website, social media etc.<\/p>\n<p>They used a VA (Virtual Assistant = remote assistant) at one point for social media.<\/p>\n<p>On Nov 21 Ashley  had his first child! (Rosalie)  &#8211; so got busier\/needed people.<\/p>\n<h3>More key questions to ask before building your team:<\/h3>\n<p>What do we want to achieve?<\/p>\n<p>How much can we afford?<\/p>\n<p>They had discussions  with Sadie, project manager, expert at hiring.<\/p>\n<p>She helped draft role outlines and hired people in the Philippines.<\/p>\n<h3>&#8220;Building a Team&#8221; not &#8220;hiring VAs&#8221;<\/h3>\n<p>Ashley&#8217;s approach is to hire “team members” not “virtual assistants”<\/p>\n<p>Their saying in ads is “we hire for life!”<\/p>\n<p>It comes down to understanding budget and your aspirations.<\/p>\n<p><b>Traps around team building<\/b><\/p>\n<p>You don’t necessarily have to create an SOP then hire someone to work like a robot.<\/p>\n<p>Also the “get it off my plate” mentality can work short-term but gets frustrating quite fast.<\/p>\n<p>Used team for:<\/p>\n<ul>\n<li>Finding non virtual assistant (listen out for new episode on this)<\/li>\n<li><a href=\"https:\/\/www.futurestatemedia.com\/how-to-drive-traffic-to-your-amazon-product\/\" target=\"_blank\" rel=\"noopener noreferrer\">Organic traffic<\/a> (listen out for new episode on this)<\/li>\n<li><a href=\"https:\/\/www.futurestatemedia.com\" target=\"_blank\" rel=\"noopener noreferrer\">Influencer marketing<\/a><\/li>\n<\/ul>\n<h3><b>What is the best ecommerce team structure ?<\/b><\/h3>\n<p>Sadie, Project Manager<\/p>\n<p>Ola stayed &#8211; to Ashley’s surprise &#8211; as executive assistant<\/p>\n<p>Katrina, Kat, MJ are in the Philippines &#8211; digital marketers<\/p>\n<p>They investigate methodologies and pull them into the business.<\/p>\n<p>Then plan it and implement those things.<\/p>\n<h3><b>Why the Philippines?<\/b><\/h3>\n<p>Because taking someone on in the UK is pretty expensive for a small business.<\/p>\n<p>That doesn’t mean that hiring people in the Philippines isn’t serious. Just more affordable.<\/p>\n<h3><b>What kind of money does it cost to have a team like that? <\/b><\/h3>\n<p>The range is about $400-800 a month for full-time equivalent.<\/p>\n<p>In<a href=\"http:\/\/onlinejobs.ph\"> onlinejobs.ph<\/a>  this is a standard range.<\/p>\n<h3><b>Do you want to hire very experienced people?<\/b><\/h3>\n<p>Ashley is happy to hire people and train them. At least you can teach them good habits.<\/p>\n<p>But they were hiring degree qualified.<\/p>\n<p>If you just want a problem solved, it could be a problematic approach.<\/p>\n<p><b>What is Ola’s role now?<\/b><\/p>\n<p>Her position has developed. Last year was investing in discovery.<\/p>\n<p>It wasn’t really about Amazon hacks. It was about creating more levers for Amazon Sales Velocity Management.<\/p>\n<p>Ole built up a lot of knowledge in the “influencer marketing” space but not necessarily for the main reasons.<\/p>\n<p>For example, they create photos that are not only high quality, but authentic with users.<\/p>\n<p>Plus backlinks and SEO &#8211; being part of the drive to organic growth.<\/p>\n<p>So because of accumulating this knowledge, Ola became a Brand and Collaboration manager.<\/p>\n<p>She understands the company’s values &#8211; getting value, giveaways and new reviews on their blogs.<\/p>\n<p>Ashley is very proud of the work she’s done.<\/p>\n<h3><b>Any other thoughts on team?<\/b><\/h3>\n<p>Ashley had  the luxury of working in the same room as Ola. This really helps communication and rapport.<\/p>\n<p>She’s now down in London whereas Ash is in Northampton.<\/p>\n<p>He was conscious that bringing new team members into the fold, there would need to be mechanisms to recreate the  informal conversations you have sitting next to someone.<\/p>\n<h3>Dealing with remote e-commerce teams<\/h3>\n<p>The solution was a forum &#8211; (team site)<\/p>\n<p>Sharing best practices e.g great training on social media, categorised well and ongoing conversations.<\/p>\n<p>The main page reinforces company aspirations and flip through slideshows and videos to see the goals for the next 12 months.<\/p>\n<p>Ashley feels he informs his team better now despite them being remote workers.<\/p>\n<p>In summary, preparation and planning behind team building &#8211; but it’s the ongoing maintenance of principles in your business and reinforcing those is critical.<\/p>\n<p>For example, learning is a core value, and because that&#8217;s so, staff are encouraged to teach others too.<\/p>\n<p>The team seems to be liking this new way of working very much.<\/p>\n<p>To get the overview of Ashley&#8217;s journey to $1 million run rate, <a href=\"http:\/\/www.10kcollective.com\/10k-002-how-ashley-pearce-got-to-1-million-a-year-on-amazon\/\">listen to his other interview with us. <\/a><\/p>\n<hr \/>\n<h2>Transcript<\/h2>\n<p>Michael Veazey<br \/>\nSo how does cash flow then tie in with sales and stock projections, because that&#8217;s obviously the the lifeblood, the liquid fuel, as you said, that fuels everything else.<\/p>\n<p>Ashley Pearce<br \/>\nYeah, of course. So trying to keep it as simplistic as possible, the sales velocity that you&#8217;re you&#8217;re managing to, will ultimately deliver a revenue per month into your Amazon account. Obviously, that revenue is then shared between you and the lovely guys at Amazon. And you, you get the scraps that are left over those scraps and deposits that you get once every every two weeks, ultimately feed feed the beast, that&#8217;s your that&#8217;s your cash flow. That&#8217;s your influence of cash. Meanwhile, you&#8217;ve got either stock on order or you&#8217;ve got stock on the water waiting to arrive at Amazon and you&#8217;ve got obviously stock in Amazon. Anyone time you&#8217;ve got assets tight, you got a cap capital assets tied up, either physically in product or sat in as money in the bank. When we manage, say, for instance, you&#8217;re trying to sell 500 units per month of something, we&#8217;re trying to manage that over a three or four month period, because we&#8217;re we&#8217;re consistently getting our deliveries every three months. And we&#8217;re placing orders every three months, like a bit of a daisy chain, to be honest, you place an order and you receive an order at the same time sort of thing, the situation you can get yourself into is your replenishing at a rate that makes the placing of the order a sure thing and you can, you can happily be convinced that that three month mark, you&#8217;ll have the cash in the bank to do it. But that only happens if you&#8217;re selling and turning over that stock as quickly as you&#8217;re importing it. So there&#8217;s no point importing in 12 months of one thing and two months of another and woman from another you need to know that that in my particular situation, obviously, you&#8217;d have to there&#8217;s some complex modeling you need to do to get to these levels of certainties about numbers. But we know that we have to put three months of stock into a container, and he needs to have three months of stock around. And that&#8217;s where the Amazon sales last year management really comes in if we leave. So for instance, we import a 40 foot container that&#8217;s got our three months of stock in it. And by the end of the three months, we haven&#8217;t quite sold all that stock, that&#8217;s going to mean that we&#8217;ve got a cash flow bottleneck because the this the cash that we were expecting to have back in the business back setting up our bank account ready to purchase, the next batch of stock is actually still locked up as product sat in an Amazon fulfillment center. So it&#8217;s about basically turning through that stock in a predictable manner to make sure that you&#8217;re turning that stock into liquid cash in a in a predictable and controlled manner. And I&#8217;m not saying it&#8217;s an easy task. And it&#8217;s it&#8217;s a difficult thing to achieve. And there are many leavers, you need to pull them out. I think we&#8217;ll talk about the leavers within Amazon sales last year management though the ones that we use anyway, under the podcast. But yeah, I think just thinking about it in terms of cash locked up versus liquid cash. And what it is you&#8217;re trying how quickly is you&#8217;re trying to turn your your stock around is a really important thing. And just to ask yourself the question, how many times you turning your stock stock this year and through through various reasoning, one of which being the inventory performance index in the States, but mainly because of the cash flow requirement. And we have a target of turning our our stock four times in a year. So like I say, three months worth of stock at a time. And we do carry a bit of buffer stock to ensure that we can ward off any issues with slight over performance on askew, but we can&#8217;t afford to keep too much buffer stock because again, that&#8217;s that&#8217;s the is it in liquid cash, or is it in physical form? And we need to kind of strike that balance?<\/p>\n<p>Michael Veazey<br \/>\nYeah, this is such an important question, I think you&#8217;ve been asked about the fact that involves some complex modeling. So we will try and sort of reverse engineer some of this. I guess at some point I&#8217;m going I have to persuade you to simply you know, sell your spreadsheet to to the more advanced sellers out there. Because I do think, honestly, that the value of getting this right versus wrong is probably for somebody doing a million dollars a year or something worth probably at least 10s of thousands of dollars, I think it&#8217;s probably that important based on the conversations I&#8217;ve had with people who do go out of stock, as you said, and, and the effects on it. And the more competitive your market is, the more you&#8217;ve got to fight to get your market share, but also to keep your market share, which is one of those things that I think people overlook quite quickly, they feel like launches so exhausting, it must be done by that point. But no. And in that context, then having predictability becomes more and more critical than ever. And obviously, cash flow projections. So business life critical isn&#8217;t it is basically like monitoring blood pumping around the system. And if the heart runs out of blood to pump, that&#8217;s when you end up hospitalized basically as a person and as a business runs out of cash. That is when bankruptcy back ends, right. So is obviously critical. But having as a sophisticated model for doing it, I think is so important. So we we&#8217;ll dig into detail about that. So if you&#8217;re curious about it and go, but what about the detail, we&#8217;ll get there, we&#8217;ll get there. But it&#8217;s always interesting also to see what people peg is that stock, desirable amount. And there&#8217;s some people that the upper limits probably live Mark backup of people, you know, in the masterminds who probably want to up to 12 months with a stock, which is kind of the opposite extreme. And you&#8217;re kind of more typical. Tell us a little bit about the, again, briefly, the inventory performance index, for those who haven&#8217;t come across, it has not had the luck to not come out of it yet. What is that? And why why is that important? How does that affect the discussion?<\/p>\n<p>Ashley Pearce<br \/>\nYeah, so it&#8217;s a school that Amazon have introduced in the United States to introduce it was about 12 months ago now. And essentially, it&#8217;s a way of them, trying to make sure that sellers manage their inventory in a way that keep stock flowing. And end of the day, Amazon don&#8217;t want to just warehouse lots of stuff in their warehouses and a fulfillment center, sorry, they want to see stop turning round. So they have particularly one metric within the inventory Performance Index, which turns out to be to be one of the more important metrics, especially when you are storing serious volume of product, which is the sell through rate. And then the sell through rate basically takes your if you the way to think about it is if you have three months worth of stock at the beginning of the three months, and at the end of the three months, you have no stock. So you&#8217;ve managed to turn around your all of your stock in three months, you would have a salary rate of one that&#8217;s on the scale actually poor to really poor. In my mind, if you turn around your stock four times in a year, you&#8217;re doing pretty well from the logistics perspective, especially when it takes 90 days from order placement to get in something into Amazon. And that&#8217;s if you&#8217;ve got your your kind of logistics and stuff really nailed. So yeah, the the IPA is is a way of keeping people in line, the issue can occur if you&#8217;re, for instance, if you sell through rate really drops 2.0 point something, and like I say, in combination with storing quite a volume of product as we are and as we do that, basically can impose limitations on the amount of stock that you&#8217;re allowed to keep at Amazon, the magic number is 350 on the ipi inventory performance index. And if you drop below that you get a nasty email that comes through to see where you&#8217;re going to get limited. And anything over that limitation is going to be charged at a rate of probably 10 times I think it was 10 times the amount that you should be paid. So yeah, it&#8217;s, it&#8217;s a pretty important thing, it could cost you a lot of cash if you if you get it wrong. And we actually do it for again, as you would imagine, we have a forward forecast of what our API will be over every month. And that allows us to understand what we need to keep at Amazon in storage, but also what we need to keep externally to Amazon in an external storage facility. And we manage our IPO basically. And that&#8217;s, that&#8217;s it if you want to go and have a look at it best to Google a few things on it, and then you&#8217;ll you&#8217;ll soon see it if you haven&#8217;t suffered it yet. And you&#8217;re selling in the UK, apparently they are introducing it into the UK in the short term. So when you&#8217;re soon become well acquainted.<\/p>\n<p>Michael Veazey<br \/>\nYes, I remember you going through this in great detail. It must have been in Boston, we had a meeting in Barcelona, which happens once a year. So that will be what june july? June, July. Yeah, well, I remember we dug into this in huge detail, because there was a great panic. And I think it&#8217;s one of those, was it a 90 day trailing metric metric or something like that? Yes, we concluded. So yeah, it&#8217;s one of those things that won&#8217;t immediately change overnight, like a lot of critical things. So just just the sell through rate, which is obviously one of those important metrics, the sell through rate of one means what, again, that you&#8217;re selling your product, you&#8217;re selling all your products in 12 months or something Is that right? Or,<\/p>\n<p>Ashley Pearce<br \/>\nas basically as the sale three rate is, your the way to think about it is it&#8217;s your it&#8217;s a ratio of how much you&#8217;re selling and how stock you&#8217;ve got. Yeah, so the way that I simplify it down, almost, if you put three months worth of stock in to Amazon on day one, and you sold through all of that stock within those three months, and you would have a, a sell through rate of one. If however you sold through that same amount of stock that you put in on day one in six months, you would actually have a sell through rate of point five, because you&#8217;ve actually, you actually had six months worth of stock in there. So three months worth of stock in in Amazon is essentially a sell through rate of one.<\/p>\n<p>Michael Veazey<br \/>\nOkay, so that&#8217;s basically what they want, that they&#8217;re just pushing us to what this is stuff that&#8217;s stored in the<\/p>\n<p>Ashley Pearce<br \/>\nFBA warehouses or the fulfillment centers. Okay. So basically, that implies that you&#8217;re going to keep any much more stock than that, apart from maybe better safety stock, you You better be looking for third party warehouses. Yeah, what one is kind of the lowest before acceptable performance. So if you start drop below one, one vote from experience, that&#8217;s where we start to have problems. Like I say, there&#8217;s a bit of a complexity around that mechanism, because Amazon are very clear on exactly how they calculate ipi. This is<\/p>\n<p>Michael Veazey<br \/>\nnot clear about how they calculate anything. They never have it, I&#8217;m sure they&#8217;re super clear about how they calculate it. They just don&#8217;t communicate it. Something about communicating. But yeah, you&#8217;re right, we have to guess. But that&#8217;s a good rule of thumb. I mean, for anyone who&#8217;s got the appetite, you have further maths and modeling, then they can try and model it but a rule of thumb of cell three once every three months, or you&#8217;re going to get into trouble in America and probably coming to an Amazon warehouse near you, if you&#8217;re selling in the UK, or for that matter, the rest of Europe. It&#8217;s it&#8217;s a good rule of thumb. And if nothing else, if you&#8217;re getting close to that, then it warrants further investigation, if you&#8217;re miles away from it, probably not worth fussing, right? So you have at 20 Okay, so that we&#8217;ve dealt with some some pretty serious micro micro management, but but you know, detail projection that you&#8217;ve dealt with, let&#8217;s zoom right back out now. And we&#8217;ve talked about a hell of a lot of different stuff. One thing we haven&#8217;t mentioned is you mentioned team, briefly. Let&#8217;s talk about that. So obviously, you said that you you too quickly said something like you need to expand your team sometimes before you actually need them. So I guess that ties in with the cash flow question, doesn&#8217;t it? At what point in your philosophy of business, which I think is a bit different for some people&#8217;s? Do you start expanding the team? How do you justify that expense? Let&#8217;s start with those two questions.<\/p>\n<p>Ashley Pearce<br \/>\nGood questions. And so the obvious answer would be to say you&#8217;re when you start running out of capacity, but to be perfectly honest, I don&#8217;t feel like I&#8217;ve had an overt amount of capacity spare anyway. And it is all down to prioritization, essentially. But yeah, so we last year, had a look at where we were, where we were going in terms of kind of linking back to the projections and what our budgets were going to look like and what we can afford to do. And as a result, I took a took a view that actually we could afford to take on some people that would make life easier, it also allow us to start doing things that were de prioritized, or, or taken off the table, because we simply don&#8217;t have enough time, or not done enough research about and didn&#8217;t really understand enough. And that that kind of freedom was provided by the fact that we had some visibility of what our next 12 months was going to look like. So this isn&#8217;t something we just kind of one day woke up and decided, hey, I&#8217;ve run out of capacity, we need to go and hire somebody, this is something What can we afford to take these people on? At what point can we afford afford to take them on? And we&#8217;ve got a plethora of things we know we can get them to work on. But what sort of skill sets does does that actually does actually demand that we we put in place as it happens. And we do something actually slightly weird in that. We took a look at what we were doing inside the business. And it&#8217;s worth saying give you a bit of an idea of what the team structure looked like back sort of November, December last year. And actually, yeah, it&#8217;s worth saying also at point that November last year, my my firstborn child, little Rosalie was, was born in November 21. So yeah, it things got quite busy towards the end of last year. And but yeah, the team consisted of, of myself, and I managed pretty much everything within the Amazon account and those types of anything Amazon related really, I had my marketing assistant, Allah, and she&#8217;s, she&#8217;s a UK based assistant who works works alongside me. And she was managing basically everything off of Amazon, so websites and social media, and she was utilizing a virtual assistant to help with social media at one point, but that that again, was came out in the wash with the team restructure that we basically kind of looked at each other and said, Well, what what do we aspire to do not just from a kind of the Amazon perspective, but the bigger the bigger picture, what can we afford, within the budget based on what it is we want to achieve? So as a result, instead of looking to the task list and saying, Well, I can hire this person to take this thing off me from an Amazon perspective, actually took the executive decision, rightly or wrongly, to keep hold of a lot of the Amazon stuff, and, and keep myself very involved in everything, Amazon and the team that we we expanded out was a team that was designed to expand our social media, expand our website and all get our clinic traffic, namely our organic traffic through through the website and through to Amazon. And this was something that was discussed with with CD my my project manager and she&#8217;s she&#8217;s an expert at hiring people. Yeah, she she basically helped us draft some some role outlines and figure out what it is we needed to do. And got us hiring people in in the Philippines and approach has been very much to hire team members, not virtual assistant. So that is another driving principle for you. When it comes to Team hiring and team building. We certainly not hiring virtual assistant, isn&#8217;t it? It&#8217;s a case of we need to bring people on, that we&#8217;re looking to to employ forever, we openly say that we within our adverts that we hire for keeps that that&#8217;s our that&#8217;s our kind of tagline if you like so we&#8217;re trying to attract the right kind of people and so far, so good. But yeah, that in terms of the the original question around it, how do you know when and how do you go about doing that sort of thing. It comes down to two for me understanding your budget and understanding your aspirations. And those those two things need to be quite clear before you can go go hell for leather into doing these things, I think it&#8217;s quite easy to fall into the trap of thinking, particularly with the the kind of conventional wisdom that&#8217;s out there about you need to sob everything. And then you can just hand it off to somebody who can go and complete it like a robot. That&#8217;s not that&#8217;s not the way to go about these things. And I think Unfortunately, the conventional way of thinking about all I&#8217;ve run out of capacity, I need somebody to take these, these tasks off me and just completely those tasks, get it off my plate. Yeah, okay. It can work for a short time. And I&#8217;m sure there are lots of people who are having success out there with with very capable virtual assistants doing that taking that sort of approach. But I much prefer the approach that we&#8217;re taking.<\/p>\n<p>Michael Veazey<br \/>\nYeah, very interesting. And I think the there&#8217;s a lot to think about here. I mean, one of the things which strikes me is that, on one hand, you were talking about financial constraints in terms of new skews. But I&#8217;ve noticed over the last whatever, yes, four months, I guess, since we last spoke on the podcast, I&#8217;m noticing in the meetings in following your journey that you&#8217;re very keen to you find it quite easy to justify to yourself spending some money on hiring team members. So can we are so a couple of read questions, what sort of money it&#8217;s going to cost to? Well, first of all, what is your current team now then? And what sort of money? Are we looking at? Just to get some ideas? You&#8217;d have to reveal that anyone&#8217;s individual salaries? Obviously, if they&#8217;re listening, but<\/p>\n<p>Ashley Pearce<br \/>\nno, of course, yeah, the team now and we&#8217;ve got we&#8217;ve got a team Stadium, project managers still there, Allah is still here, the actual original intention was that we would be hiring a replacement for Allah because Allah was with me working. Yeah, for minimum wage, essentially, in the UK. And that was all to gain experience. And but she, she decided to stay which, which was brilliant, because, again, you wasn&#8217;t in the predictions or the cash flow forecast, but something we managed to to adapt and work around. And so yeah, sad. And Allah is still there. And we&#8217;ve actually taken on three Filipino ladies, Katrina, cat, and mg. And they essentially employed in the digital marketer role. And there&#8217;s lots of stuff within their role outlines that that&#8217;s quite broad based and gives them a lots of creative freedom to, to investigate and research new methodologies that we should be using, and and basically learn from the best in the best in the industry, and pull all that research and data led stuff that you&#8217;re going to find, you know, easily on Google, and actually give them the opportunity to put together a plan and implement that for for the business and for the brand. And yeah, that that&#8217;s the that&#8217;s the team in terms of sort of the the costs of a team. The the obvious question is straightaway would be well, what why the Philippines. And part of that is because hiring somebody in the UK is quite an expensive endeavor for a small business, it is an endeavor, you can&#8217;t take on on lightly, not to say that is any less of a an in an endeavor that you should take lightly in the Philippines at all. And like I say, if there was any risk that we couldn&#8217;t pay our team members on a monthly basis, I would be absolutely distraught. And that&#8217;s not a risk I&#8217;m willing to take, you know, these are people that we&#8217;re bringing into the team, as family members. And like I say, these people, hopefully these guys will be working with me for the rest of their working lives. And that&#8217;s my aspiration. But yeah, we in terms of hiring in, in the Philippines, we had job ads, that were basically ranging between 400 and 800 US dollars per month. And if you kind of go in and have a search round for for kind of typical salaries and things that that you&#8217;ll see, see that sort of spread, particularly if you go to see online jobs.ph that&#8217;s that&#8217;s sort of the advised levels. And that&#8217;s the that&#8217;s what&#8217;s coming to fruition. We&#8217;ve got some very committed and capable people within that salary range. And that&#8217;s, that&#8217;s a real success, and it&#8217;s something that&#8217;s allowed us to grow.<\/p>\n<p>Michael Veazey<br \/>\nSo the Philippines interesting that you&#8217;re saying you take hiring people in Philippines seriously, and I i think that&#8217;s a responsible approach. And also it&#8217;s one of those two things isn&#8217;t talking about the public victories I&#8217;m in that Stephen Covey principles. If you&#8217;re looking for Win Win, if you communicate the facts to somebody that you take their livelihood as seriously as you want them to take your business, guess what you&#8217;re more likely to have commitment from from them to your business, because you&#8217;re showing commitment from you to them and their their salary high in the future. Salary means just to check a 400 $800 a month, is that for full time equivalent, or what sort of number of hours?<\/p>\n<p>Ashley Pearce<br \/>\nYeah, yeah, no, that&#8217;s, that&#8217;s full year full time, full time equivalent,<\/p>\n<p>Michael Veazey<br \/>\nas we&#8217;re serious people with some some good training and experiences it?<\/p>\n<p>Ashley Pearce<br \/>\nYeah, so yeah, and like I say, you can get a whole range, we were actually quite keen on it sort of a specific profile of people who had had some, some work experience. And we were, we were quite open to the idea of having somebody who wasn&#8217;t as experienced, we&#8217;re quite happy to, to actually do quite a lot of the coaching. And the reason for that is because if you&#8217;re the one that is helping to create the habits, you can at least have some sort of status saying in whether they&#8217;re good or bad habits. And in some cases, obviously, you can, in particular, if you take the approach, so you&#8217;re just hiring somebody to solve a problem. And you don&#8217;t want to get involved with helping them kind of learn and progress. You can get yourself into a situation where you&#8217;re, you&#8217;re handing off to somebody who&#8217;s who&#8217;s not as capable as you, you would wish and hope or potentially even doing something and negative and impacting to your business. So it&#8217;s definitely something to be conscious of. And like you say, we were hiring degree degree qualified people essentially that that was one of the one of the stipulations although we were open to the idea of of just experience based as well.<\/p>\n<p>Michael Veazey<br \/>\nOkay, so degree qualified people for $408 hundred dollars a month. I mean, I have to say that I have some personal experiences of using VA. And I haven&#8217;t used huge numbers, but I&#8217;ve used I&#8217;ve got a podcast editor in the States. I&#8217;ve got a website guy in Serbia, he was in Norway last time I spoke to him. designer in Poland, I&#8217;ve used vas in Philippines, I&#8217;ll have to say there&#8217;s some good people everywhere. But there is some consistently great quality in the Philippines always just amazes me how little it costs. So I think it&#8217;s one of those things that there&#8217;s more of a barrier in people&#8217;s minds than it is in in reality, because you think about the cost of investing in the product line. If it&#8217;s private label and you go to develop it. You measuring it in 10s of thousands a year I knew probably so that&#8217;s quite interesting to put it in before effective. So team building is obviously been in critical thing for you, by the way. Yes. All so that the famous Allah who have heard about and you mentioned it last year. So you started off as your assistant she stayed on. So what is all his role now then? Would you say is it she&#8217;s still your kind of executive assistant? And is that a useful thing to have always is that developed?<\/p>\n<p>Ashley Pearce<br \/>\nSo yeah, so all is honest position was actually developed because throat last year, as you said, we were making investments in in discovery, basically, we weren&#8217;t investing in too many Amazon hacks or trying to understand what what the next Amazon tactic was, we were actually very focused on how we created more leavers from Amazon sales was the management again, we&#8217;ll come back to what those leaders are in another episode. But essentially all it built up a lot of capability, specifically around influencer marketing, but not necessarily for the typical reasons you might expect behind influence marketing, we weren&#8217;t actually as interested in their influences what we were interested in the various levels of value that they could provide. These people, you know, do fantastic imagery, imagery that you&#8217;d pay many 10s of pounds per image for from a photographer, and in those cases, you wouldn&#8217;t have the authenticity and the the actual live interaction and ownership by the the, the influencer or the blogger. Equally, we we look at value in things like the blog and backlinks and all sorts of other SEO stuff that the rated back again to our drive towards more organic growth. So so all those capabilities kind of moved in this direction of brand and collaboration, management. So we thought, Well, if it&#8217;s gone in that direction, let&#8217;s let&#8217;s call you that she&#8217;s the brand and collaborative management manager within the business, and yeah, she&#8217;s she&#8217;s got a strategic viewpoint over what it is that we&#8217;re trying to trying to achieve. She understands the fact that we have a work in principle when it comes to, to influences and anything we do really in the business where we&#8217;re trying to squeeze out as many forms of value from what it is we&#8217;re doing. And so for instance, when working with influencers is about building a long term relationship where we can, we can extract more and more value out of over time as we expand product lines, and we can work with them on whether it be giveaways, new reviews, etc, new reviews on their blogs that is and things like that. So yeah, she&#8217;s she&#8217;s really, we actually had a meeting this morning, and I actually actively said to after the meeting, I was extremely proud of the work that she done. And, and yeah, now I am seriously proud of where she&#8217;s come from, where she the level she&#8217;s delivering at now. It&#8217;s something that I&#8217;d be extremely upset to have lost the opportunity to have continued working with her and the fact that I get to continue work and I feel very lucky about<\/p>\n<p>Michael Veazey<br \/>\nExcellent, well, that sounds like you&#8217;re really it&#8217;s obviously very positive, I&#8217;m now you are generally very, very positive and enthusiastic person, which I&#8217;m sure, as I was saying to your project manager here I&#8217;m considering do but have worked with now as well, as you know, but before you came on that call to serve your ears were burning. Another thing that&#8217;s obviously very important. That&#8217;s a very general thing. But what I think is great is that you have clear strategic objectives. And we&#8217;ll talk about strategy a bit more in a minute, because that&#8217;s the sexy word for me, it&#8217;s not hacks, it&#8217;s not, it&#8217;s not the latest Amazon algorithm where the algorithm is less sexy to me than then strategy because that&#8217;s sustainable, long term. And also under our control, right. But what I think is amazing is that you&#8217;ve got the clarity of strategy, you&#8217;ve got the, you&#8217;re developing things organically, but you really, really value the people, I think, where you put your money where your mouth is, literally I&#8217;m in your situation. So about this time last year, a lot of people would have been spending whatever surplus cash they had on new product lines. And I&#8217;m not saying that&#8217;s wrong, either. There&#8217;s there&#8217;s lots of ways to grow this business as we&#8217;ve seen, which is always what fascinates me. But what&#8217;s so interesting about you is that you&#8217;ve really put a great value on your team. And as a result, you&#8217;ve got a loyalty from somebody who looked like they could very easily have headed off somewhere else for a lot more money. But they didn&#8217;t. And they become a great asset to your business and as a medium and hopefully long term. So not something that&#8217;s going to work for everybody if they&#8217;re not really team oriented. But certainly something that if you are that way inclined is going to be an interesting inspiration, hopefully, for what&#8217;s possible with the team. So have you got any other thoughts on team to wrap that sort of team bit up?<\/p>\n<p>Ashley Pearce<br \/>\nYeah, so I had, I&#8217;ve had the luxury of working in this same very same office, very same room as Allah in the time that I&#8217;ve worked with her. And she&#8217;s now actually working remotely because she&#8217;s actually done in London. And while I&#8217;ve stayed in Northampton, but we and we always knew that was actually probably gonna end up being the case. But I was also very conscious, therefore, of ensuring that if we were going to bring new team members into the fold, we were going to have a mechanism and a methodology behind our communication and our interaction, that couldn&#8217;t necessarily entirely replace the ability of sitting next to somebody because you know, there&#8217;s all those fantastic informal conversations and things that you can learn just by by being sat next to somebody but actually helped me a challenge was how do you create that ability to work like that, but in a virtual environment? And we very simply put our heads together and thought, Well, actually, how about we, we build our very own team site, and as a result, before we even went out to hire anyone, we, we put a team site together that has a forum inside it. And within that forum, we get to do active brainstorming, just like we would if we were sitting across the desk from each other. And then we have best practices shared not just so piece, but literally, hey, here&#8217;s a great piece of training from Ezra Firestone go and do this piece of training if you&#8217;re looking for this. And it&#8217;s all nicely categorized, and, and all these other types of things. So the other key aspect of it is that actually, when you log into the site, you get taken to a page that reinforces what it is that our company is all about what it is that we aspire to be. And any person in the business can very quickly flick through the videos or the slideshows that are on the homepage, just to reinforce or reiterate what it is the goals of the business offer for the next 12 months. And without me being sat there next to them and explaining it that, you know, they&#8217;ve got access to all that information. So, so actually, I feel like my team now are more informed than all or ever was, even despite the fact that she sat next to me for certain for so long. So yeah, the, the key bit for me there, and if I was to kind of sum that up is that, you know, preparation behind and planning behind that type of thing is fantastic. But that that ongoing maintenance of kind of the principles and what it is you&#8217;re doing as a business, reinforcing the things that you think are principles, you know, we kind of really go on about learning being the core of our business, and you should be learning something new every day, every week, and you should be sharing that information. It&#8217;s these are all great things to say. But how do you then demonstrate that principle, and, you know, we kind of saw what he the team site demonstrates that principle actively, and I&#8217;m an active member of the forum on constantly sharing information. And the team so far, I think I really like it. So yeah, and it&#8217;s a different way of working for them. They&#8217;ve certainly not had anything like that in the past.<\/p>\n<p>Michael Veazey<br \/>\nYeah, and as a recent sort of guinea pig for using your team site outside of the e commerce space in using it for the podcast, I have to say that the other day, I was doing some research, for example. And because I&#8217;ve obviously launching the 10 k collective podcast, and we were looking at, I was looking at podcast, SEO and launch strategies very similar to launching an Amazon product. And I gathered it all together, my instinct was to gather it together on the team site. Why because even though it&#8217;s just me at the moment, and I&#8217;m beginning to bring bring people on, and I&#8217;m going to do rapidly, it&#8217;s good to have things that aren&#8217;t just split between the usual places, right, a Skype chat here and email there. And God emails a terrible place to keep information because as soon as you open your emails up to find information, you start responding we actively to a bunch of emails from somebody else, right. I mean, if worst case scenario is it&#8217;s some kind of product, negative review, because that completely throws you off course, because it feels like an emergency. And, you know, but having it in one place, that is your structure, not just google drives, although Google Drive is a fantastic resource and are trying to focus everything there. But I do think is helpful. And what I really like as well as is to not just in terms of the sort of think of things as communication tools structure, but the entire mentality behind it is that you need to sell to external parties, like obviously, your customers who are paying you, but you also need to sell to people who you&#8217;re paying, that includes your Chinese suppliers, you mentioned that they need to be sold on the idea that you&#8217;re going to be placing lots of future orders. So it&#8217;s worth them, investing in things that will smooth the supply chain out. But you&#8217;re also selling if you like the idea of working for your business, and why it&#8217;s a good place to work, and why it continues to be an even better place to work. And building that loyalty by effectively putting an internal focus on selling internally, if you like to your staff and big corporations end up doing that, I guess, because they&#8217;re fighting gets the fact that it&#8217;s probably not cool place to work, because it&#8217;s faceless, and soulless, and have an HR department. So they&#8217;ve got to do something. But what I think is pretty unique in your approach is that you&#8217;re doing all of that hard work right up front instead of when you get so big and sprawling, that everyone kind of hates it and wants to leave. So I think it&#8217;s an incredibly positive thing. And again, in the Amazon space, I think pretty unusual. I don&#8217;t know many other people who have such a conscious team building, sort of emphasis on making it a great place to be and clarity of communication across the piece. So I really think is an example. And I hope that other people will follow your example with the team site thing, because I&#8217;m personally beginning to find it really helpful. And then we&#8217;ll see how that develops over time. It&#8217;s obviously a win for you and your team.<\/p>\n<p>Ashley Pearce<br \/>\nYeah, and I think again, coming back to you&#8217;ve got a, you&#8217;ve got a goal or an aspiration, that&#8217;s what will fuel the ideas and the innovation. So our aspiration, when we decided to go and embark on this idea of let&#8217;s let&#8217;s grow, the team that&#8217;s highest and more people was, we want to be an employer of choice. And we want to be somebody who people actively seek out to on and be employed by. And that&#8217;s a massive aspiration for a tiny business that operates out of a back bedroom in North Hampton, I expect and But hey, you know, there&#8217;s nothing wrong with audacious big games like that. And because it sets a mindset, you know, when you&#8217;re hiring people, then you&#8217;re not just seeing them as a resource that you can utilize to, to just get a task done. You&#8217;re seeing them as an extension of you and and if you can get them to, to operate within the operating principles that you&#8217;re trying to reinforce. And you know, these aren&#8217;t things that you&#8217;re just going to see in bullet points on a PowerPoint presentation. These are things you have to actually live and demonstrate, then that&#8217;s, that&#8217;s the type of vibration you need to start with. Otherwise, it&#8217;ll just wane and you just won&#8217;t have the energy to keep it up.<\/p>\n<p>Michael Veazey<br \/>\nAnd again, that&#8217;s the classic corporate thing isn&#8217;t it is not just things on a PowerPoint. I mean, there are so many books that talks about writing a mission statement for yourself or for the business and think is particularly American books. And of course, they&#8217;ve got a written constitution that they revere, they&#8217;re always saying I&#8217;ll take the fifth on that and what that their amendments Never mind the actual constitution are quoted all the time in everyday life. And we don&#8217;t even have a written constitution in the UK. I mean, we kind of kind of do, it&#8217;s a messy business, I&#8217;m not gonna get into constitutional law. But the point being, we tend to set less door by that and anyone who&#8217;s worked in a corporate, there&#8217;s a good reason why. And the reason is because basically, we don&#8217;t trust it. We think it&#8217;s just hot air, and it&#8217;s just a PowerPoint presentation. So what you&#8217;re going to do is go into a boardroom say, we do this, this, this, this, this, this because it sounds good and the shareholders like it. And then of course, what that means it&#8217;s in practice that everyone just ignores it.<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_003-ashlet-pt2.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fbuilding-an-e-commerce-team-with-ashley-pearce%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-3\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_003-ashlet-pt2.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9674-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_003-ashlet-pt2.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_003-ashlet-pt2.mp3\">Download<\/a> (Duration: 35:34 &#8212; 24.4MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast (10k-podcast): Play in new window | Download (Duration: 35:34 &#8212; 24.4MB)Subscribe: Spotify | Email | TuneIn | RSS<\/p>\n","protected":false},"author":1,"featured_media":6544,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[1838],"tags":[1550],"class_list":["post-9674","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-running-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Building an e-commerce team with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Building an e-commerce team with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast (10k-podcast): Play in new window | Download (Duration: 35:34 &#8212; 24.4MB)Subscribe: Spotify | Email | TuneIn | RSS\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-06-07T05:00:47+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-07-07T03:49:52+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"40 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"Building an e-commerce team with Ashley Pearce\",\"datePublished\":\"2019-06-07T05:00:47+00:00\",\"dateModified\":\"2021-07-07T03:49:52+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/\"},\"wordCount\":8396,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Running An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/\",\"url\":\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/\",\"name\":\"Building an e-commerce team with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-06-07T05:00:47+00:00\",\"dateModified\":\"2021-07-07T03:49:52+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"How to make $1 million a year on Amazon on the 10K Collective Amazon Podcast with Amazing FBA Podcast for Amazon Sellers\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Building an e-commerce team with Ashley Pearce\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Building an e-commerce team with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/","og_locale":"en_GB","og_type":"article","og_title":"Building an e-commerce team with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast (10k-podcast): Play in new window | Download (Duration: 35:34 &#8212; 24.4MB)Subscribe: Spotify | Email | TuneIn | RSS","og_url":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-06-07T05:00:47+00:00","article_modified_time":"2021-07-07T03:49:52+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"40 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"Building an e-commerce team with Ashley Pearce","datePublished":"2019-06-07T05:00:47+00:00","dateModified":"2021-07-07T03:49:52+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/"},"wordCount":8396,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002.png?fit=1280%2C720&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Running An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/","url":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/","name":"Building an e-commerce team with Ashley Pearce - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002.png?fit=1280%2C720&ssl=1","datePublished":"2019-06-07T05:00:47+00:00","dateModified":"2021-07-07T03:49:52+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"How to make $1 million a year on Amazon on the 10K Collective Amazon Podcast with Amazing FBA Podcast for Amazon Sellers"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/building-an-e-commerce-team-with-ashley-pearce\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Building an e-commerce team with Ashley Pearce"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2w2","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9674","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9674"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9674\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6544"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9674"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9674"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9674"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}