{"id":9675,"date":"2019-06-06T06:00:17","date_gmt":"2019-06-06T05:00:17","guid":{"rendered":"https:\/\/amazingfba.com\/?post_type=10k&#038;p=6543"},"modified":"2020-06-29T09:08:40","modified_gmt":"2020-06-29T08:08:40","slug":"how-ashley-pearce-got-to-1-million-a-year-on-amazon","status":"publish","type":"post","link":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/","title":{"rendered":"How Ashley Pearce got to $1 million a year on Amazon"},"content":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_001.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fhow-ashley-pearce-got-to-1-million-a-year-on-amazon%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-1\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_001.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9675-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_001.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_001.mp3\">Download<\/a> (Duration: 37:56 &#8212; 26.0MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_001.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fhow-ashley-pearce-got-to-1-million-a-year-on-amazon%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-2\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_001.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9675-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_001.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_001.mp3\">Download<\/a> (Duration: 37:56 &#8212; 26.0MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>&nbsp;<\/p>\n<h2>How Ashley Pearce made his first Million on Amazon?<\/h2>\n<p>What better way to kick off the $10k Collective podcast than by interviewing an incredibly successful member of the mastermind? In this episode, you will learn how to make $1 million a year on Amazon, or rather <a href=\"https:\/\/www.futurestatemedia.com\/about\" target=\"_blank\" rel=\"noopener noreferrer\">how Ashley made his success.<\/a><\/p>\n<h2><strong>Quick Background<\/strong><\/h2>\n<h3>Engineering background<\/h3>\n<p>Launched 2016<\/p>\n<p>Improved in 2017<\/p>\n<p>Has a part-time job that has parallels with Amazon business building<\/p>\n<p>2018: $750K revenue which was predicted in May 2018<\/p>\n<p>Ashley has made an appearance on the <a href=\"https:\/\/amazingfba.com\/blog-podcast-how-to-sell-on-amazon-uk-2\/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazing FBA podcast<\/a>. You can find those episodes at <a href=\"https:\/\/amazingfba.com\/ashley-pearce\/\" target=\"_blank\" rel=\"noopener noreferrer\">https:\/\/amazingfba.com\/ashley-pearce\/<\/a>.<\/p>\n<h3><strong>Results<\/strong><\/h3>\n<ul>\n<li>Growth since start<\/li>\n<li>currently\n<ul>\n<li>$750K for 2018 calendar year<\/li>\n<\/ul>\n<\/li>\n<li>Growth since May 2018<\/li>\n<li>$370K 2017<\/li>\n<li>56% growth year on year<\/li>\n<li>Plan this year 85% uplift!<\/li>\n<\/ul>\n<h2><strong>At the time of the last podcast, launching into Europe. How have results been?<\/strong><\/h2>\n<ul>\n<li>Didn’t take as seriously as should have &#8211; OOS<\/li>\n<li>Launched in the UK<\/li>\n<li>And Germany and France<\/li>\n<li>Not taken as seriously as should have<\/li>\n<li>Used EFN from Amazon which has hamstrung them -missing out on Pan EU benefits<\/li>\n<li>Rectifying at the moment, VAT registration, etc.<\/li>\n<li>Also into Spain and Italy &#8211; slowly taking on Europe<\/li>\n<\/ul>\n<p>The reason why he took his eye off the ball in Europe was because <a href=\"http:\/\/amazon.com\/\">amazon.com<\/a> in the USA has demanded cash and energy.<\/p>\n<p>We all have limitations resources, cash, mindset. Ashley has tried to work within his cash and energy limitations.<\/p>\n<h2><strong>What’s your view on expanding on two fronts at once?<\/strong><\/h2>\n<p>You need to have the capacity to manage across the marketplaces.<br \/>\neg. Managing hijackers across<\/p>\n<p>Even 10 products &#8211; across multiple marketplaces<\/p>\n<p>There are tools that provide alerts but then you have to resolve each issue.<\/p>\n<p>Also, Amazon changes fulfilment fees. e.g. $2, not $4<\/p>\n<p>One management overhead for <a href=\"http:\/\/amazon.com\/\">amazon.com<\/a><\/p>\n<p>Europe you have to manage 5 marketplaces &#8211; some people don’t have the capacity to resolve it<\/p>\n<p>You need to 80\/20 and double down.<br \/>\nAt some point, you need to scale.<br \/>\nSomeone hired someone to hire someone to manage a brand on Amazon.<\/p>\n<p>You need a presence in all the marketplaces<\/p>\n<h2><strong>Scaling &#8211; could be new marketplaces. Also new SKUs or higher sales per SKU <\/strong><\/h2>\n<h3><strong>How many product lines do you have (SKUs)? <\/strong><\/h3>\n<p>6 MSKUs [separate product lines]plus variations &#8211; about 15 variations last year<\/p>\n<p>Launching one product a quarter this year is the plan &#8211; new MSKU or a variation.<\/p>\n<h3><strong>What’s your reasoning behind that choice?<\/strong><\/h3>\n<p>To a degree, Ashley’s company has fallen into this. To some extent, it’s about financial restraints.<\/p>\n<p>Towards the end of last year, they calculated that they could launch one product a quarter.<\/p>\n<p>It’s about cash flow.<\/p>\n<h2><strong>True cost of going Out of Stock<\/strong><\/h2>\n<p>It’s hard to have peaks and troughs &#8211; it’s so expensive going out of stock. Firstly, you lose ground to existing competition. Secondly, other Private labellers copy you.<\/p>\n<p>Ashley has focussed on not biting off more than they can chew.<\/p>\n<p>They had a profitable product back in May 2018; prediction out of stock 6 weeks; turn into 10-12 weeks.<\/p>\n<p>These days, this could cost you your business, not just some sales.<\/p>\n<p>This is part of the changing nature of Amazon &#8211; in his most recent example, it took about 60 days to regain traction and consistent profit on 2 SKUs from going out of stock in February &#8211; that’s 60 days of heavy expenditure on PPC. If it had been any longer, they might not have ranked again at all.<\/p>\n<h3><strong>Why this happened<\/strong><\/h3>\n<p>That could be a change in algorithm on Amazon.<\/p>\n<p>There’s also competition on Amazon.<\/p>\n<p>12 months ago, differentiation was already critical. Nowadays, there are some more brand builders who take things as seriously as Ashley. So, his brand’s differentiation is not as strong as it was. So, you have to up your game again now.<\/p>\n<h2><strong>What about raising capital or debt to fund more expansion? <\/strong><\/h2>\n<p>Ashley has taken on personal debt to get the business to where it is today.<\/p>\n<p>But he has imposed a limitation on utilising organic growth in the business.<\/p>\n<p>They know how much money they need to grow at 50%+ per year.<\/p>\n<p>They also know calculated much additional resources that will take &#8211; done some serious hiring this year to deal with it.<\/p>\n<h2><strong>Conservative funding approach<\/strong><\/h2>\n<p>Part of the principles articulated by Jim Collins: <em>Great by Choice <\/em><\/p>\n<p>“20-mile march”<\/p>\n<p>And conservative balance sheets.<\/p>\n<h2><strong>Finances<\/strong><\/h2>\n<h3><strong>Planning Finances<\/strong><\/h3>\n<h3><strong>How are you having such accurate sales projections?<\/strong><\/h3>\n<p>Have per month per SKU unit sales projections<\/p>\n<p>Forecasting is great because you can budget and work out if you can afford to pay people.<\/p>\n<p>But it’s not enough in itself.<\/p>\n<p>You also need to practice what Ashley’s team calls:<\/p>\n<p>“Amazon Sales Velocity Management”<\/p>\n<h2><strong>“Amazon Sales Velocity Management”<\/strong><\/h2>\n<p>To be able to calculate if you can afford to launch new SKUs etc. you need accurate figures.<\/p>\n<p>You need a mechanism to check the reality against forecast.<\/p>\n<p>They have a report weekly and then projected forward over the coming month.<\/p>\n<p>ON Mondays there is a team discussion on what management to do on a particular SKU.<\/p>\n<p>If they have an OVER-performing SKU, they don’t actively slow it down, but they stop promoting it and work on UNDER-performing SKUs.<\/p>\n<p>So they maintain sales velocity within an operating window.<br \/>\nThis relates back to the liquid cash in the business &#8211; this fuels the rest of the system.<\/p>\n<p>If you started doubling sales on one SKU, that could create reorder and cashflow issues.<\/p>\n<p>It’s also connected with consistent supply chains. It’s really emphasised with suppliers.<\/p>\n<p>Sometimes suppliers over perform eg last sept delivered 5 days early &#8211; didn’t have cash in the business!<\/p>\n<p>This caused a cashflow issue!<\/p>\n<h2><strong>Supply chains &#8211; how do you get these consistent?<\/strong><\/h2>\n<p>There is the “<a href=\"https:\/\/en.wikipedia.org\/wiki\/Bullwhip_effect\">Bullwhip Effect<\/a>”<\/p>\n<p>[also known as the <strong>Forrester effect &#8211; <\/strong>Research indicates that a fluctuation in <strong><em>point-of-sale demand of +\/- five percent <\/em><\/strong>will be interpreted by <strong><em>supply chain participants as a change in demand of up to +\/- forty percent<\/em><\/strong>.]<\/p>\n<p>If you hide the forecast from suppliers in the supply chain, they’ll add in padding.<\/p>\n<p>So, the best practice is to communicate what you’re trying to achieve and what is realistic.<\/p>\n<p>For example, in Dec.2018, Ashley provided the suppliers with projections of sales.<\/p>\n<p>That was partly in order to try to get supplier credit. This is after a 2 ½-year relationship.<\/p>\n<p>They see a consistent order stream every 3 months anyway.<\/p>\n<p>As a result, they’ve not had massive issues with orders &#8211; they’ve not actually said that the fixtures and fittings used for this product &#8211; but basically, they are ordering a year in advance in bulk.<\/p>\n<p>Importantly, this is not a financial derisking mechanism, it’s a relationship management mechanism.<\/p>\n<h2><strong>So, this is a projection not a commitment to your supplier or an option?<\/strong><\/h2>\n<p>No, it isn’t.  From Ashley’s experience working as a supplier, one of the biggest frustrations is that clients don’t communicate properly.<\/p>\n<p>Managing the customer otherwise costs a lot of time and effort.<\/p>\n<p>Ashley aspires to be the opposite and be a great customer to suppliers!<\/p>\n<p>He wants to be on the top ten list not just based on revenue but easy to deal with.<\/p>\n<p>Visibility end to end is critical to achieving this.<\/p>\n<hr \/>\n<h2>Transcript<\/h2>\n<p>Michael Veazey<br \/>\nladles and jelly spoons Welcome to the 10 k collective Podcast the place to be for strategy and big picture focused ecommerce business grows and scalars today I&#8217;m really delighted to welcome a member of the 10 k collective mastermind for about 1820 months now, Ashley Paris, who&#8217;s also of course a pretty serious ecommerce scalar of businesses and has grown as business very rapidly to some impressive numbers in a pretty short time. So, Ashley, welcome to the show. Great to be here, Michael. And thank you for having me back on it doesn&#8217;t feel like it&#8217;s quite been a year since I was on but it apparently has. Absolutely. It&#8217;s funny how the Time flies, isn&#8217;t it? I guess that&#8217;s all people say that and it sounds really old when you&#8217;re young. So I guess I&#8217;m becoming one of those colleges. I&#8217;ll start saying youngsters to people seeing on those all over. So.<\/p>\n<p>So actually, we had you on our sister podcast, the amazing FBA podcast just about a year ago, so mid May so late May 2018. So give us a bit of a quick reminder of yourself and who you are, and then fill us in a bit on what you&#8217;ve been up to you to grow your business.<\/p>\n<p>Ashley Pearce<br \/>\nSince then, of course, yes, so I&#8217;m an engineer by trade. I&#8217;ll just start off with that one because actually listening back to the episode I had on the other podcast, we actually went on about that for a little while. But it made sense. I&#8217;m it puts me in a uniquely qualified position, or it did when I was starting the business, I had quite a broad range of skills, which, which suited me quite well for getting an Amazon e commerce business off the ground. I launched the business in the end of 2016, and achieved some pretty stellar results. So to the blocks, then went on to to, again, improve that performance throughout 2017. And, and then again, further improve that throughout 2018. In 2018, we did about $750,000 in revenue, and which actually, funnily enough, was what we predicted we were going to do when I was on the podcast back in May 2018. So I&#8217;m quite quite proud of our ability to predict going forward there but<\/p>\n<p>Yeah, I&#8217;m a I&#8217;m a pretty serious ecommerce entrepreneur, but overall general entrepreneur, and I have a part time job and that I also work in and that has some interesting parallels with what i what i do outside of outside of my work. And so, so yeah, that&#8217;s a pretty, you know, whistle stop tour of me right now on what I&#8217;ve, where I&#8217;m from, and what I&#8217;m doing, got aspirations to, to kind of grow my e commerce portfolio and my entrepreneurial portfolio further and further over time as well. Excellent. Say when kept things to take out of that first for the engineering background? Yes.<\/p>\n<p>Michael Veazey<br \/>\nWe talked extensively about that. And for those who haven&#8217;t heard, it, will put links in the show notes to back to the a couple of episodes that Ashley did with us in the amazing FBA podcast. But yeah, the engineering background obviously was something like e commerce where your engineering or mass producing manufacturing products is really helpful. What&#8217;s particularly interesting couple of things first of all, that you&#8217;re What is it two and a half years in now?<\/p>\n<p>Two years to eight months, something like that. Yeah, something like that. Yeah. What&#8217;s interesting is a couple of things. First of all, you got a part time job still. So that&#8217;s a bit of a reality check for some people who just want to quit their day job. And I think actually, a lot of the time, if you enjoy your day job, which I know you&#8217;ve, you&#8217;ve talked about the fact that it&#8217;s interesting, and we can talk about that a bit later. But you know, it&#8217;s not necessarily the objective, if all you want to do is quit your job, it could be that you just have a terrible boss, and you could change jobs rather than starting an entire business. I mean, that&#8217;s kind of a sledgehammer to and not in my opinion, I guess I&#8217;m preaching to the converted for the month members of the you know, the the community that listen to this kind of podcast. But the other thing that I think is really interesting is that you predicted back in May 2018, that you were going to earn $750,000 in revenue. And you achieve that when you looked at your numbers, presumably early this year. So that&#8217;s quite impressive prediction ability. So that&#8217;s something we&#8217;re definitely going to dig into. So let&#8217;s talk about we&#8217;ve already talked about results. You&#8217;ve got $750,000 put it in context, how much is that growth been? Yes, it&#8217;s a year before and how much has it been since you&#8217;ve started off? Give us an idea of their sort of growth curve.<\/p>\n<p>Ashley Pearce<br \/>\nYeah. So we were about a 56% growth from 2017. Through to 2018. We did about $370,000. And then in 2018, like I say, 750,000. So is it a 56%? Gross, I&#8217;m pretty happy with that being said, I&#8217;m a bit of a relentless numbers man and relentless growth, man. So our actual plan for this year is an 85% uplift from 2018 to 2019. So yeah, that&#8217;s, that&#8217;s sort of where we&#8217;re heading. And so far, so good with our predictions.<\/p>\n<p>Michael Veazey<br \/>\nExcellent. Now, another thing that you were doing a year ago, so instead of haven&#8217;t had the luxury of doing this, but it&#8217;d be great to revisit things on a yearly basis with f1. Really, um, so year ago, you were just launching into Europe. And so how&#8217;s that how the results been for that since you started that?<\/p>\n<p>Ashley Pearce<br \/>\nYeah, Europe. I&#8217;ve seen an interesting challenge. We were in the UK, and we moved into the UK. And that delivered some good results and some early sales. We didn&#8217;t really take it as seriously as we should have standard, same old story of going out of stock, and things like that. But we decided to launch quite a number of products in the UK all at once. Then once we once we got back into stock. Subsequently, we also launched into Germany and France. Again, I feel slightly guilty and saying we haven&#8217;t taken those regions as seriously as we should have. We&#8217;ve been using the FN European fulfillment network program from Amazon. And so I feel like that has hamstrung us slightly, because we&#8217;ve missed out on the benefits of the pan EU program. But that&#8217;s something that we are at this moment rectifying and we&#8217;re sorting out our Penny you status invite registrations and all the headache that comes along with that. But that will mean that we also go into Spain and Italy and so we&#8217;re slowly taking on on Europe.<\/p>\n<p>I&#8217;ve got to be honest, the reason probably why we&#8217;ve had us is slightly off the ball in European is that amazon.com in the States has been a an absolute animal in terms of falling on requirements of cash and energy. So it&#8217;s something that we&#8217;ve kind of almost purposely done but I like I said, I wish we&#8217;d done slightly more in Europe. But hey, we all we all have limitations in business, whether that&#8217;s resource capital or or mindset is this things that you needed to deal with?<\/p>\n<p>Michael Veazey<br \/>\nExcellent. So just before we move on before beyond that, those same we all have limitations, so resources cash or mindset, this is very interesting to try and figure out which ones are there right. Yeah, interesting. So not doing European Penny you yet By the way, just for anyone who&#8217;s newest to the Amazon space, even though you&#8217;re an established retailer. I mean, don&#8217;t just go plunging into panda you don&#8217;t have to because you have to get VIP registered in I believe is eight European countries now, right? So it&#8217;s not actually Your thing to do, because you&#8217;ve got to add the key to everything. So who on the selling side, but that&#8217;s an interesting thing. That&#8217;s, we&#8217;ll dig into that a bit more. But just quickly, you&#8217;re not the first person to say that one or other marketplace is where they found that they had his focus their money and energy. I know, there&#8217;s a couple of people in the 10 k collective podcast, he was quite serious at selling in America, maybe not efficiently. But they shut that down. And they just purely Europe and doing, you know, quite big numbers there. And as in several million a year, and I know other people who just shut down a European operation and just focus on American again, people are doing, say 345 million dollars a year, so not small fry. So what&#8217;s your view on that? I mean, do you think that is a distraction from America to be in Europe? Or do you think that it&#8217;s possible to expand on to France at once?<\/p>\n<p>Ashley Pearce<br \/>\nI think it&#8217;s possible, I think, and I both probably would agree to a certain degree, it&#8217;s a distraction. You need to have the capacity to be able to manage across The marketplaces. And I mean, even if you just take into account things like managing your hijackers and things like that, actually, when you have, say, 10 products, all of a sudden you have to check 10 listings in several different marketplaces. And I know, you know, there are tools out there that will provide you with alerts and things like that. And that&#8217;s great. Well, I mean, then you&#8217;ve got to do take action against that alert, when that pops up. And that still takes time. And so it&#8217;s not just about finding the issue. It&#8217;s about then going forward and resolving the issue. And not to mention the fact that you know, Amazon&#8217;s classic, sort of changing your fulfillment fees on you because they&#8217;ve measured your product, and it&#8217;s three times the size that it actually is, and now they&#8217;re charging you $4 instead of $2 for the privilege of shipping it and all these other things. These are all things that need to be managed in every single marketplace and amazon.com It&#8217;s a huge marketplace, and there&#8217;s one management overhead of that type of stuff is in Europe when you take the whole European marketplace into account. Yeah, okay. It&#8217;s apparently bigger than amazon.com. But then I have to manage all of those things in all of those individual marketplaces. And that&#8217;s just a, it&#8217;s just a headache that, that some people can&#8217;t afford the capacity to resolve. And as a result, if, if that is the situation you&#8217;re in, and you need to prioritize whether it&#8217;s one marketplace over another, I&#8217;m quite in favor of, of kind of doing that at 20 piece and saying, well, actually 80%SKUof my results are coming from 20% of the efforts, let&#8217;s just double down on that. That being said, you know, at some point, the business, if you&#8217;ve got a business that you want to grow, and you want to exist for the long run, I think it&#8217;s a bully kind of bite you&#8217;ve got, you&#8217;ve got to think, you know, Where, where, where next, how are we, you know, establish ourselves in in those marketplaces. Interestingly enough, I was listening to a podcast just the other day where somebody had actually moved away from Amazon was managing their own store, but still understood the fact that they needed to manage their brand on and on Amazon, so they actually employed somebody, despite the fact that they weren&#8217;t actually selling on Amazon, to manage their brand on Amazon, which just highlighted to me again that you can&#8217;t just choose to be ignorant and bury your head in the sand, this is increasingly going to become the case, you&#8217;ll need presence in all the marketplaces. Maybe in the short term, it makes sense to make that prioritization. But in the long run, I think there&#8217;s always got to be a plan for that level of expansion.<\/p>\n<p>Michael Veazey<br \/>\nRight. So you got a fairly clear philosophy on this. I mean, so it&#8217;s interesting how that varies. So you talked about the number of SKUs. So scaling can be new marketplaces, as you&#8217;re obviously doing can be new SKUs or higher sales per SKUs, I guess the obvious one. So just to give us a flavor, how many SKUs are you dealing with to make your $750,000 last year?<\/p>\n<p>Ashley Pearce<br \/>\nThat&#8217;s a good question. And I&#8217;m going to just remind myself, I was Yes, six, six m SKUs. So we have variations that sit underneath those, those major SKUs. So that probably accounted for about 18 maybe 15 last year. So yeah. Last year, we were steadily launching one product a quarter this year. So we&#8217;ll and when I say one product, and that&#8217;s either an MC or a variation, and so we&#8217;re not putting ourselves under tremendous pressure in terms of product development. But yeah, that&#8217;s, that&#8217;s the kind of scale that we&#8217;re talking about here.<\/p>\n<p>Michael Veazey<br \/>\nOkay, so since So, I guess you&#8217;re going down the route of small number of SKUs relative to the turnover you&#8217;re doing but actually quite a few different marketplaces. So quite different from some people, you know, in the in the masterminds you&#8217;re doing, you know, launching 60 SKUs a quarter or whatever, but they&#8217;re mostly focused on the UK or maybe to some extent, Germany. So, what&#8217;s your thinking? What&#8217;s your reasoning behind that?<\/p>\n<p>Ashley Pearce<br \/>\nThat choice, it&#8217;s to a certain degree, something we&#8217;ve fallen into, to a certain degree, something that&#8217;s just come about by talking about limitations in capacity. We&#8217;ve got the capability financially to launch one product quarter that&#8217;s that&#8217;s essentially what we calculated back towards the end of last year. We got to live within our financial limitations and the cash flow limitations that are imposed on our business.<\/p>\n<p>It&#8217;d be great you know, I think one of the guys in the in the group is currently planning to launch 100 hundred new products this year or something Oh, this quarter even it was something obscene from from my perspective, obviously from my little bit my small business. Yeah, I physically couldn&#8217;t afford to cash flow, that amount of product launches. I mean, we could come up with endless number of products, but we need to keep ourselves in stock and we need to deliver consistent product and not have those peaks and troughs because it&#8217;s so goddamn expensive to go out of stock and then have to re rank a product.<\/p>\n<p>Once you get back into stock Malema. Never mind the fact that you&#8217;ve just blazed a fantastic trail that a bunch of other private labels will be following in your footsteps on and and potentially just eating your lunch whilst you&#8217;re away. And then you&#8217;ve got to then compete against them to get back in the market. So yeah, we&#8217;re very focussed on ensuring that we don&#8217;t bite off more than we can chew and don&#8217;t put ourselves in a situation.<\/p>\n<p>Same situation as we find ourselves in in that I described in the podcasters. On last, where, you know, we had a profitable product, we had lots of stock at Amazon. And we were desperate to place an order. And our prediction was, we were going to be out of stock for six weeks, and it turned into 10 to 12. Those sorts of things now will cost you your business, not just a few sales. So we take it all very seriously. And we managed within in those cash flow limitations, pegs and so there&#8217;s lots of interesting things to think about<\/p>\n<p>Michael Veazey<br \/>\nhere. So the first thing is the question of limitations versus sort of going actually crazy pedal to the metal. And that&#8217;s partly a question of each individual entrepreneur&#8217;s DNA almost, but that will the DNA of your business. But let&#8217;s dig into this first. So costing your business, not just some sales. Let&#8217;s think a bit more about the cost of going out of stock them because I think this is something that people don&#8217;t consider as part of the mix and other a balance between different factors. Talk to me about the cost of getting out of stock.<\/p>\n<p>Ashley Pearce<br \/>\nYeah, so we&#8217;ve got some data on this, but it more it is empirical. And because the changing nature of Amazon on a weekly and monthly basis, what&#8217;s true, this quarter won&#8217;t be true next quarter, and certainly not next year. But our most recent example of this is it&#8217;s taken us 60 days to regain traction and consistent profitable sales on a couple of SKUs that went out of stock, just after must have been just after Christmas, or in February, that 60 days of heavy expenditure on PBS PPC, and other forms of traffic that we try and generate for the site and very much directed at those SKUs, I&#8217;ve got to be honest, it&#8217;s one of those areas where I feel like their competition has stolen a bit of a charge on us.<\/p>\n<p>And I do fear that had we been out of stock any longer than we were is quite realistic that we might not have poked our head back into the competition and back into the ring to fight off that that level of competition. And that&#8217;s a that&#8217;s a consequence of a few different things. I think there&#8217;s some algorithmic stuff going on on Amazon. And it is it is inevitably a changing beast. But also there&#8217;s some competition factors.<\/p>\n<p>When I was on the podcast 12 months ago, we were saying how we&#8217;d established differentiation as being a critical thing for us to compete in the market, even before anyone was really talking about branding and things like that in any big way. That now is not commonplace. But there are a few other contenders in the market who have taken that very seriously as seriously as we&#8217;re taking it.<\/p>\n<p>And as a result, we don&#8217;t stand out as the one shining lights in the competition in the marketplace anymore. So actually, we&#8217;re not necessarily as differentiated as we once were. And that then offers up a challenge for us poking our heads again, back into the page one rank the top five rankings and things that aren&#8217;t, especially on amazon.com where the competition is actually quite thin the word is brutal.<\/p>\n<p>Michael Veazey<br \/>\nAbsolutely. Well, that&#8217;s very interesting. Now, the changing nature of Amazon thing is interesting. But what I think is there are two ways to focus on this or two or three one is to focus on Amazon and the change the algorithm and try and hack your way around that.<\/p>\n<p>My personal experiences after being around amazon for quite a long time and being in some Facebook groups for masterminds and serious people for quite a while now. Three and a half years, I guess all three it that&#8217;s a very short term game because Amazon knows damn well. There are smart people out there and they got smarter people in employed in droves to outsource that out. Sorry, outmaneuver that, I should say. But then also, the competition thing is, I think probably what we really need to think about and it&#8217;s not so much Amazon, we need to worry about is the fact that Amazon is ranking What&#8217;s his most relevant and high quality and popular.<\/p>\n<p>Therefore, ultimately, our competition, the other sellers are probably the people we need to worry about most, the fact that having a decent brand is not enough, I guess there&#8217;s always a what you call it an arms race, really. So the thing you&#8217;re making, I guess, is the importance of dominating things. So couple of things to go into.<\/p>\n<p>We&#8217;ll talk about the domination thing and the beloved star principle that I know we&#8217;re both obsessed with. Yeah, and it&#8217;s a favorite thing to discuss the mastermind, because it seems to really ring true with our experience. Right.<\/p>\n<p>But first of all, the question that I know was raised in a meeting recently, and I think you had a personal challenges is the usual way the 10 k collective sometimes called the 10 kicking collective because, as one member famously put it recently, I&#8217;m had a good kicking last month, so I went away and took some action. I&#8217;m like, well, that&#8217;s a bit harsh. We&#8217;re nice, we&#8217;re loving. But that is fair to say that the debate is robust. Although, you know, very good natured, I think, but the question is, then, okay, so let you&#8217;re running out of money to scale, why don&#8217;t you go and get a load of debt to fund more expansion? What&#8217;s your thinking about that?<\/p>\n<p>Ashley Pearce<br \/>\nYeah, so I&#8217;m not averse to the idea of it. And like you say, actually, this is something that&#8217;s been brought up in the mastermind meetings that we&#8217;ve had, I have taken on personal debt, and various other things to get the business to where it is today. Talking about limitations, it&#8217;s one of those areas where I believe I&#8217;ve imposed self-imposed a bit of a mindset limitation, in that I&#8217;ve managed to successfully do it through personal finance.<\/p>\n<p>And I&#8217;m proud of what I&#8217;ve managed to achieve so far, utilizing organic growth to grow the business. And that&#8217;s something that I feel I wear with a great deal of pride. But that can, and I think, is potentially a cloud in the prospect of cloning, the idea of actually going out and getting some private equity funding or similar. But no, we were in a position where we know how much money we need to grow at 50% or above per year, based on stock requirements and things of that. We know how much that will take additional resource that will take in we&#8217;ve actually done some significant hiring this year, which has allowed us to, to kind of shoulder that burden for the next couple of years.<\/p>\n<p>Hopefully, the finance question is, is one that is currently out and currently being answered. And we&#8217;re actually this week been speaking to some financing companies, who could potentially give us essentially overdraft facilities, and which would, which would enable us to really kick on and kind of push off again, 50 to 50 to 80% growth per year target going into next year?<\/p>\n<p>So yeah, the answer is finite finance, one way or another is the inevitable answer you can&#8217;t continue those sorts of pieces, purely on organic growth, at some point, you need to bite the bullet and do things like start hiring overheads, and teams. And those things come at a cost, and you need them before you realize you need them. So, so inevitably, you can&#8217;t modulate those out in some sort of cash flow or, or stop management way.<\/p>\n<p>And you know, if you, if you decide that you&#8217;ve run out of cash, and you can&#8217;t pay your staff this month, they won&#8217;t be hanging around for too long. Whereas, when it comes to stock, you&#8217;ve got the inevitable ability, then to kind of push the order out and just bite the bullet on the fact that you know, okay, we&#8217;re going to be out of stock for a period of time here. But that&#8217;s just what we&#8217;re going to have to deal with. So yeah, there&#8217;s lots of lots of financially type stuff in there. But ultimately, I&#8217;ve come around to the idea probably in the in the particularly in the last couple of months to the fact that actually, to grow this business to the aspirational levels that I want to take it, I&#8217;m going to have to seek some financing or some early stage sort of near term rather, cash generation mechanisms.<\/p>\n<p>Michael Veazey<br \/>\nInteresting. So this is an ongoing, interesting debate, isn&#8217;t it? Because I&#8217;ve been really recently gorging on Jim Collins, great by choice book, which is an interesting one. I mean, obviously, his famous book is good to great, which is, I think, published in about 1989. And then it&#8217;s built to last as well. But the great by choice is more specifically about companies that have grown. It was and I think the period of study they took is 1972 to 2000, into so not incredibly recent, but does include some technology companies and his focus there was on companies that are not just survived, but thrived and done really well in concrete financial terms of return on investment for shareholders, over 30 years in really challenging and choppy and changeable waters. And that&#8217;s exactly what it is.<\/p>\n<p>So from that point of view, he&#8217;s he articulated that there&#8217;s two disciplines that I think you probably are practicing, which is the 20 mile March, I haven&#8217;t consistent targets and hitting them because you very much are and we&#8217;ve got to dig into how you&#8217;re managing to be so accurate with your projection, because I think that&#8217;s pretty unusual. Or at least it&#8217;s not common. And the other thing is that they run pretty conservative balance sheet.<\/p>\n<p>So in a lot of ways, from his perspective, you&#8217;re probably doing a great job from this sort of perspective of the hard charging people, especially Americans, but not only when a couple of hard charges in Britain, British people, that could be that you&#8217;re leaving money on the table. So there&#8217;s always that balance to be struck. Right. And but it sounds like from the Jim Collins perspective, you&#8217;re on the right sort of path there. So talking of which, because we had a fascinating conversation a while ago, about this, let&#8217;s talk about how to not just predict the future, but kind of created, as Peter Drucker said, safest way to predict the future, right? Stop projections and cash flow projections and even revenue projections. How are you being so accurate, this is pretty unusual ?<\/p>\n<p>Ashley Pearce<br \/>\nYeah, so this links back to knowing our limitations when it comes to cash flow, we know how many products we can launch. But we also have targets and an understanding of how many sales we should be getting per month per SKU. And we do measure it on a per month per SKU basis.<\/p>\n<p>What that allows us to do, if you know how many of those units you&#8217;re selling, and what retail price you&#8217;re selling them at, you know, all your fees, and all those things attached, you get your revenue number to drop out on a monthly basis. And that gives you a nice forecast that looks great going out into the future and makes you think, Well, hey, let&#8217;s go in, sit back and book The next plane back out to Barcelona, so we can sit on the beach.<\/p>\n<p>But the realities are that just just going that far. Just doing the the forecasting is by means nowhere near enough. forecasting is great. It allows you to do planning, budgeting, understand what the likelihood is that you can actually hire people and consistently pay them. Because as I say, that&#8217;s a real thing that you need to deal with if you&#8217;re going to take people on. And yeah, we&#8217;ve kind of come up with our own little mechanism. And there&#8217;s several mechanisms, but we, we refer to it internally in the businesses, Amazon sales, velocity management. That&#8217;s not trademarked yet. But you heard it here first. So who were we we manage our sales velocity.<\/p>\n<p>And that sounds like in most people&#8217;s terms, as all you just get it to go as fast as you can. Because of course, that&#8217;s the obvious goal, right? sell as many as you can, as quickly as you can. We&#8217;re linking back to that, that prior conversation may well actually, if cash flow spikes and troughs and things that that are going to cause you serious problems. The you haven&#8217;t physically got the cash to keep yourself in stock. Or you need to meet budgets and things like that, to ensure that you can make the investments that you need to make can you afford to launch this product next quarter? Or do you need to readjust your forecast etc, we need yet we need a mechanism by of checking that forecasts forecast against reality.<\/p>\n<p>So in our business, we have the sales velocity report that comes out every week on a Monday. As a result, the numbers of sales, actual sales in the last week, are taken and then projected forward over the coming month. And so we get a prediction of how many we are will actually sell that month, very early on them before the sales have come to fruition. We know where the SKU are 10%, down 50%, down 10%, up and 50% up.<\/p>\n<p>And as a result, we then on that Monday, have a discussion amongst the team as to what direction we need to push particular SKUs. So if we&#8217;ve got a SKU massively over performing this week, everyone in the conventional way he would have jumping up and down and away with you know, fantastic week here, maybe we can have another week like that. Whereas we can kind of go know when we need to hit the target. So we won&#8217;t actively slow that SKU down. But we won&#8217;t actively promote that SKU.<\/p>\n<p>And we&#8217;ll go about promoting other SKUs that have, for instance, underperform that week, and our on our on our basically predicted to underperform for the month. That way we modulate essentially the sales velocity, and we maintain a sales velocity within a window and operating window. And that&#8217;s operating window writing, it relates all the way back to the core number of what is our liquid cash in the business.<\/p>\n<p>Because that liquid cash in the business is, is the thing that fuels the rest of the system. And if our system starts to throw out stupid numbers, and we start doubling our sales, on certain SKUs and things like that we could very soon cause I all sorts of problems in terms of not being able to reorder stock and things like that. So it also means heavily connecting with having a consistent supply chain and an understanding of what it is that your suppliers going to deliver.<\/p>\n<p>And we really emphasize the fact that we want consistent supply, and we get it. And in terms of in some circumstances where the supplier overperforms. And we had an instance of this last September, I believe they actually delivered five days early. As a result, we didn&#8217;t have the cash in the business because our cash flow forecast had basically determined that no, we would if they delivered on time, we would have liquid cash available to do that. just so happens, the over performance from our supplier actually caused us a problem.<\/p>\n<p>So it&#8217;s not a case of pushing in one direction, shorter lead times faster sales. It&#8217;s actually a case of well, what did we predict? And how do we make sure that we hit that prediction? Because that prediction is the thing that keeps us in business?<\/p>\n<p>Michael Veazey<br \/>\nAmazing. So this is a really I think I can&#8217;t stress enough to people listening really how important I think this is because I think the more grown up businesses that I talked to in that in the masterminds if you scratch the surface, say Oh, yeah, well, you got a three year projection for this, or even in one case, a 10 year projection, which is amazing to me in such a volatile market.<\/p>\n<p>But yeah, I think it&#8217;s so important because I was just thinking about the airline industry. And there was an assumption back in there because I&#8217;m bit of a sort of planes bottom nerd for what it&#8217;s worth. And there was an assumption back in the airline industry that faster was better from about 1945 to the early 70s, when suddenly, the raw fuel, which was fuel, literally, got incredibly expensive. And then suddenly the idea of go over the Atlantic and three hours on Concord, as opposed to very affordably in five or six hours on a Boeing 747 or an Airbus three AC or whatever, became a much more attractive proposition to the airlines, because they might actually have a danger of making a profit.<\/p>\n<p>Famously, Concord was the fastest thing on the on the planet and made incredible loss throughout its career really. And so that&#8217;s a very interesting thing. So faster is not better.<\/p>\n<p>And also the predictability thing, having some degree of control. It just feels a whole bunch more safer and more professional. And may I say if you go out to get investment, which is something I know, we&#8217;ve discussed more investable, because the last thing an investor wants is something that&#8217;s massively unpredictable. At least most investors unless the upside potential is eye watering the huge, but you&#8217;re not the next Uber either. So man, that doesn&#8217;t really work either hide.<\/p>\n<p>So couple of things that I mean, first of all talk about supply chains, you&#8217;ve already talked about the problem of supplier over delivering a being quicker than usual, which almost never happens. If you&#8217;re dealing with Chinese suppliers, you&#8217;re doing pretty well. How do you manage that? Then how do you deal with getting consistently from supply chains consistency of lead time and stuff.<\/p>\n<p>Ashley Pearce<br \/>\nSo again, this is I mean, if we want to get all theoretical about it, you will reference something like the bullwhip effect, which is kind of logistics and supply chain theory about making if you hire the reality, or the direction or the forecast from subsequent partners in the supply chain, they&#8217;ll all kind of make up their own version. And they&#8217;ll add contingencies on and by the time you get to the end of the bullwhip, the wave and the curve is absolutely huge and feels massively erratic.<\/p>\n<p>So the principle there is that if you can give your supply chain the all the people down the chain, more visibility of what it is that you&#8217;re likely to achieve, and what it is you&#8217;re trying to achieve. their expectations are more realistic and set. And what I mean by that is, in December of last year, we provided our suppliers with a prediction for 2019 of our sales.<\/p>\n<p>And essentially that they were there was actually double meaning in that because we were actually trying to see if we could secure some basically supplier finance or something that would allow us to basically stretch that cash flow envelope slightly. We were still in our planning phase around how many products we actually wanted to launch this year. And yeah, that was our initial kind of stab of throwing it back to the supplier to say, Well, what can we do here. And as a result, they got confidence.<\/p>\n<p>Bearing in mind, we&#8217;ve been working with these suppliers since we started. So we&#8217;ve been working with them, but at this point three years. So they understand us as business, they see a consistent order stream coming in every three months. And they were given 12 months visibility of what it was that we were trying to achieve over 2019.<\/p>\n<p>As a result, when we&#8217;ve hit them with orders, they&#8217;ve they&#8217;ve not had massive problems with being able to deliver that we&#8217;ve not caught them out. they&#8217;ve not actively said they are doing this. But we&#8217;re fixtures and fittings, I&#8217;ll call them a used within our product, instead of having to buy just for this order that you can buy with relative comfort in knowing the fact that they&#8217;re going to get the next order and the order after that.<\/p>\n<p>And actually it minimizes the risk for them if they can buy, for instance, a year&#8217;s worth of fixings because it&#8217;s all lot cheaper to buy them in that sort of bulk, knowing the fact that you have a customer sat at the other end of an email. But yet the other side of the world who&#8217;s basically said, yeah, this is what we&#8217;re going to do in 2019, that feels a lot more the risks.<\/p>\n<p>We&#8217;re not managing that in any sort of financial de risking mechanism, that&#8217;s a relationship thing purely at the moment anyway. And that&#8217;s something we&#8217;re looking to enhance with with further building that relationship and visiting China and things like that. I have been saying I&#8217;m going to do that for about 12 months, but haven&#8217;t yet managed to get myself out there. And I&#8217;m really firm up that relationship. But it hasn&#8217;t limited us in our capability to do things.<\/p>\n<p>Michael Veazey<br \/>\nYeah, well, I was talking to somebody the other day for the podcast and as one of the podcasts that by the time this airs been come out already or it will be coming out soon. Which is what an interview with ash Monga who is supply chain expert or sourcing expert in that he runs I make sourcing and lives out in China in Guangzhou, I think it is on the eastern seaboard there anyway.<\/p>\n<p>And and he said, Look, when it comes down to relationships, the best way to get a good relationship with the supplier is based on volume. So the fact that a you&#8217;re giving them good volume, and B, you&#8217;re projecting decent volume is probably the most important component of what is the end of a very much a business relationship is based on numbers always have a choice.<\/p>\n<p>It&#8217;s good to go and press the flesh. But I think people overestimate the importance of that a lot of ways because they they are mathematically numerous people. And that&#8217;s what they work on. And that&#8217;s also to ask was, was emphasizing this as somebody who deals with them day in day out, you know, in a personal basis. So the other question just about that. And this is a projection, by the way, not a commitment or a sort of option on sales or an actual firm sort of orders for every 12 months. Is that right?<\/p>\n<p>Ashley Pearce<br \/>\nYeah, that&#8217;s correct. It was Yeah, it was just our forecast our prediction.<\/p>\n<p>Michael Veazey<br \/>\nIt&#8217;s interesting that you think just the forecast was enough for them, I guess plus the history you&#8217;ve got with them, obviously, that it wasn&#8217;t about creating some contracts in order to get a better deal for them or more consistency, it was about a projection. But which seems realistic based on your history, not a content. Very, very interesting to me.<\/p>\n<p>So again, that says something about how the relationship with Chinese suppliers works to me that there&#8217;s not about what you what it says on paper so much as you&#8217;re communicating with them, but you&#8217;re not making a firm commitment.<\/p>\n<p>Ashley Pearce<br \/>\nYeah. And the so from my experience of working as a supplier in in the manufacturing industry, actually one of the most frustrating things that you can find from from customers is a lack of ability to share and communicate properly. And actually, when somebody shares communicates, clearly improperly, it minimizes the cost and the time and effort that&#8217;s involved in managing that supplier.<\/p>\n<p>And that customer sorry, because at the end of the day, we&#8217;re managing them, but they&#8217;re also managing us, we can&#8217;t forget that. I like to think and I like to feel and I like to aspire to be a great customer to work with. And that&#8217;s that&#8217;s how I I try and conduct myself, I want to be on the top 10 customer list not just because of what we&#8217;re doing in revenue, but because I&#8217;m so easy to deal with and, and very clear about our intentions.<\/p>\n<p>And so that that&#8217;s kind of one of the driving principles, I think in the way that we&#8217;ve approached the supply chain work that we&#8217;ve done. And I say all cascades down as into one big system that links right the way through to, to manage our sales loft on Amazon.<\/p>\n<p>And that&#8217;s such an important factor. And without that, that visibility of end to end, I wouldn&#8217;t have such conviction in talking to the supplier as clearly as I am and communicating as firmly as I am about what it is we&#8217;re trying to achieve.<\/p>\n<p>Michael Veazey<br \/>\nYeah, it makes a great deal of sense. So in other words that you guess, like a lot of these things, you&#8217;ve got to get your own house in order before you worry about external relationships, the businesses, it always like in terms of the sort of businesses and entity that I was reading through and doing a podcast about the Seven Habits of Highly Effective People that snappily titled but by covey which I think is still really really good but um it talks about private victories precede public victories another words you need to be proactive that&#8217;s habit one habit tues begin with the end in mind the habit three is put First things first, your management, your objectives and goals is be clear, then you need to manage relative to those objectives and make sure they actually get implemented. And only once you&#8217;ve got that in order, then can you start worrying about external relationships.<\/p>\n<p>And think when is his habit for that, which is in other words, you know, making sure that your supplier wins in the US. And actually, it all makes sense. But I just want to point out that this is not something anyone else could do if they haven&#8217;t got their house in order in terms of projecting stuff now.<\/p>\n<p>Now we&#8217;re going to do a podcast specifically about that. Because that&#8217;s it&#8217;s a hell of a thing to just gloss over. But yeah, just when it comes to projection, I think I want to just tie one other critical element and in the big picture and then keep listening folks if this is of interest to you, if you don&#8217;t have a cash flow projection for the next one, two or three years or a stock needs projection or sales projects, and then I think you should definitely, definitely tune in because you&#8217;re talking to a sharp minded guy with an engineering degree, something else.<\/p>\n","protected":false},"excerpt":{"rendered":"<!--powerpress_player--><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2Famazingfba%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_001.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fhow-ashley-pearce-got-to-1-million-a-year-on-amazon%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-5\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast: <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_001.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9675-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/amazingfba\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_001.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_001.mp3\">Download<\/a> (Duration: 37:56 &#8212; 26.0MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/32Cryk51sxVlF03B38UeoJ\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><iframe loading=\"lazy\" src=\"https:\/\/player.blubrry.com\/?media_url=https%3A%2F%2Fmedia.blubrry.com%2F10k_collective%2Fcontent.blubrry.com%2F10k_collective%2F10k_001.mp3&amp;podcast_link=https%3A%2F%2Famazingfba.com%2Fhow-ashley-pearce-got-to-1-million-a-year-on-amazon%2F#mode-Light&border-000000&progress-000000\" scrolling=\"no\" width=\"100%\" height=\"165\" frameborder=\"0\" id=\"blubrryplayer-6\" class=\"blubrryplayer\" title=\"Blubrry Podcast Player\"><\/iframe><p class=\"powerpress_links powerpress_links_mp3\" style=\"margin-bottom: 1px !important;\">Podcast (10k-podcast): <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_001.mp3\" class=\"powerpress_link_pinw\" target=\"_blank\" title=\"Play in new window\" onclick=\"return powerpress_pinw('https:\/\/amazingfba.com\/?powerpress_pinw=9675-10k-podcast');\" rel=\"nofollow\">Play in new window<\/a> | <a href=\"https:\/\/media.blubrry.com\/10k_collective\/content.blubrry.com\/10k_collective\/10k_001.mp3\" class=\"powerpress_link_d\" title=\"Download\" rel=\"nofollow\" download=\"10k_001.mp3\">Download<\/a> (Duration: 37:56 &#8212; 26.0MB)<\/p><p class=\"powerpress_links powerpress_subscribe_links\">Subscribe: <a href=\"https:\/\/open.spotify.com\/show\/4eT6nFOral22d9j128g8Nr\" class=\"powerpress_link_subscribe powerpress_link_subscribe_spotify\" target=\"_blank\" title=\"Subscribe on Spotify\" rel=\"nofollow\">Spotify<\/a> | <a href=\"https:\/\/subscribebyemail.com\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_email\" target=\"_blank\" title=\"Subscribe by Email\" rel=\"nofollow\">Email<\/a> | <a href=\"https:\/\/tunein.com\/podcasts\/Podcasts\/10K-Collective-e-Commerce-p1226933\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_tunein\" target=\"_blank\" title=\"Subscribe on TuneIn\" rel=\"nofollow\">TuneIn<\/a> | <a href=\"https:\/\/amazingfba.com\/feed\/10k-podcast\/\" class=\"powerpress_link_subscribe powerpress_link_subscribe_rss\" target=\"_blank\" title=\"Subscribe via RSS\" rel=\"nofollow\">RSS<\/a><\/p><p>Podcast: Play in new window | Download (Duration: 37:56 &#8212; 26.0MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 37:56 &#8212; 26.0MB)Subscribe: Spotify | Email | TuneIn | RSS&nbsp; How Ashley Pearce made his first Million on Amazon? What better way to kick off the $10k Collective podcast than by [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":6545,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"jetpack_post_was_ever_published":false,"_jetpack_newsletter_access":"","_jetpack_dont_email_post_to_subs":false,"_jetpack_newsletter_tier_id":0,"_jetpack_memberships_contains_paywalled_content":false,"_jetpack_memberships_contains_paid_content":false,"footnotes":"","jetpack_publicize_message":"","jetpack_publicize_feature_enabled":true,"jetpack_social_post_already_shared":false,"jetpack_social_options":{"image_generator_settings":{"template":"highway","enabled":false}}},"categories":[4,1838,1840],"tags":[1550],"class_list":["post-9675","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-amazon-fba","category-running-an-ecommerce-business","category-scaling-an-ecommerce-business","tag-10k-collective-podcast","post-wrapper","thrv_wrapper"],"jetpack_publicize_connections":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How Ashley Pearce got to $1 million a year on Amazon - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How Ashley Pearce got to $1 million a year on Amazon - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Podcast: Play in new window | Download (Duration: 37:56 &#8212; 26.0MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 37:56 &#8212; 26.0MB)Subscribe: Spotify | Email | TuneIn | RSS&nbsp; How Ashley Pearce made his first Million on Amazon? What better way to kick off the $10k Collective podcast than by [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:published_time\" content=\"2019-06-06T05:00:17+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-06-29T08:08:40+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Michael Veazey\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michael Veazey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"41 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/\"},\"author\":{\"name\":\"Michael Veazey\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\"},\"headline\":\"How Ashley Pearce got to $1 million a year on Amazon\",\"datePublished\":\"2019-06-06T05:00:17+00:00\",\"dateModified\":\"2020-06-29T08:08:40+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/\"},\"wordCount\":8593,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1\",\"keywords\":[\"10K Collective Podcast\"],\"articleSection\":[\"Amazon FBA Private Label\",\"Running An Ecommerce Business\",\"Scaling An Ecommerce Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/\",\"url\":\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/\",\"name\":\"How Ashley Pearce got to $1 million a year on Amazon - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1\",\"datePublished\":\"2019-06-06T05:00:17+00:00\",\"dateModified\":\"2020-06-29T08:08:40+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1\",\"width\":1280,\"height\":720,\"caption\":\"building an e-commerce team with Ashley Pearce of Future State Media on the 10K Collective Podcast with Amazing FBA Amazon Prodcast\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How Ashley Pearce got to $1 million a year on Amazon\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6\",\"name\":\"Michael Veazey\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g\",\"caption\":\"Michael Veazey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How Ashley Pearce got to $1 million a year on Amazon - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/","og_locale":"en_GB","og_type":"article","og_title":"How Ashley Pearce got to $1 million a year on Amazon - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Podcast: Play in new window | Download (Duration: 37:56 &#8212; 26.0MB)Subscribe: Spotify | Email | RSSPodcast (10k-podcast): Play in new window | Download (Duration: 37:56 &#8212; 26.0MB)Subscribe: Spotify | Email | TuneIn | RSS&nbsp; How Ashley Pearce made his first Million on Amazon? What better way to kick off the $10k Collective podcast than by [&hellip;]","og_url":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_published_time":"2019-06-06T05:00:17+00:00","article_modified_time":"2020-06-29T08:08:40+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/i1.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","type":"image\/png"}],"author":"Michael Veazey","twitter_card":"summary_large_image","twitter_creator":"@amazingfba","twitter_site":"@amazingfba","twitter_misc":{"Written by":"Michael Veazey","Estimated reading time":"41 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#article","isPartOf":{"@id":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/"},"author":{"name":"Michael Veazey","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6"},"headline":"How Ashley Pearce got to $1 million a year on Amazon","datePublished":"2019-06-06T05:00:17+00:00","dateModified":"2020-06-29T08:08:40+00:00","mainEntityOfPage":{"@id":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/"},"wordCount":8593,"commentCount":0,"publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"image":{"@id":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","keywords":["10K Collective Podcast"],"articleSection":["Amazon FBA Private Label","Running An Ecommerce Business","Scaling An Ecommerce Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/","url":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/","name":"How Ashley Pearce got to $1 million a year on Amazon - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#primaryimage"},"thumbnailUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","datePublished":"2019-06-06T05:00:17+00:00","dateModified":"2020-06-29T08:08:40+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","width":1280,"height":720,"caption":"building an e-commerce team with Ashley Pearce of Future State Media on the 10K Collective Podcast with Amazing FBA Amazon Prodcast"},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/how-ashley-pearce-got-to-1-million-a-year-on-amazon\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"How Ashley Pearce got to $1 million a year on Amazon"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]},{"@type":"Person","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/69f28c6c455531885c35067e206abdf6","name":"Michael Veazey","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/348c615c97e00d24e82b27d6cc7c03854430a2b23fd7b95fc33d1c9016496881?s=96&d=mm&r=g","caption":"Michael Veazey"}}]}},"jetpack_featured_media_url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2019\/06\/10k002-1.png?fit=1280%2C720&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/pdKLPE-2w3","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9675","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=9675"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/posts\/9675\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media\/6545"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=9675"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/categories?post=9675"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/tags?post=9675"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}