{"id":1107,"date":"2016-11-13T01:32:53","date_gmt":"2016-11-13T01:32:53","guid":{"rendered":"http:\/\/amazingfba.com\/?page_id=1107"},"modified":"2020-12-29T15:09:39","modified_gmt":"2020-12-29T14:09:39","slug":"mentoring-faqs","status":"publish","type":"page","link":"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/","title":{"rendered":"Mentoring FAQs"},"content":{"rendered":"<p><a href=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-955919_640.png\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-955919_640.png?resize=176%2C300&#038;ssl=1\" alt=\"question-955919_640\" width=\"176\" height=\"300\" data-recalc-dims=\"1\" \/><\/a><\/p>\n<p><strong>Is mentoring the right thing for me now?<\/strong><\/p>\n<p>That depends! Coaching and Mentoring should help anyone with some initiative, focus  and energy to double or triple their initial investment in coaching.<\/p>\n<p>However, this programme is not for serial seminar attenders or shiny object chasers! (Don&#8217;t feel too bad if you recognise yourself here, that was me for years&#8230;) It&#8217;s for those who are motivated action takers. I&#8217;ll need a little detail to know if that&#8217;s you. Hence the application-only process.<\/p>\n<p><strong>Do you work with beginners\/those in early stages?<\/strong><\/p>\n<p>Yes, the &#8220;Zero to Hero&#8221; programme is specifically for those who have Zero turnover so far and are ambitious to launch ASAP.<\/p>\n<p>You will need to have:<\/p>\n<ol>\n<li><strong>Enough money<\/strong> to start a private Label business (so <strong>at least $6000 for inventory as a  minimum PLUS a few hundred for overheads<\/strong>)<\/li>\n<li><strong>Enough time<\/strong> to devote to it (<strong>minimum<\/strong> 20 hours a week)<\/li>\n<li>Willingness to devote a MINIMUM of 6 months to the business model.<\/li>\n<\/ol>\n<p>As long it seems like a good fit (you&#8217;ll need to fill in a short questionnaire and have a short phone call with me to check that before we would work together), and I believe I can at least double your ROI in coaching, I&#8217;ll consider you.<\/p>\n<h3><a href=\"https:\/\/form.jotformeu.com\/72154401452345\" target=\"_blank\" rel=\"noopener noreferrer\">CLICK HERE<\/a> to apply<\/h3>\n<p><a href=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/03\/a476f2094f8f21db5e316ba2cbad2f16.jpg\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/03\/a476f2094f8f21db5e316ba2cbad2f16.jpg?resize=474%2C347&#038;ssl=1\" alt=\"Amazon Mentoring with coffee!\" width=\"474\" height=\"347\" data-recalc-dims=\"1\" \/><\/a><\/p>\n<p><strong>Will you work with just anyone?<\/strong><\/p>\n<p>No. I don&#8217;t want to take your money if I don&#8217;t believe I can help you. If you have a shoestring budget, <strong>please <\/strong>spend it on stock &#8211; as long as you make use of the free training available to you (such as&#8230;on this website! and <a href=\"http:\/\/amazingfba.com\">the podcast<\/a>).<\/p>\n<p>Also, if you are thinking of applying, you should know that I do need you to have done  at least these three things:<\/p>\n<p>1. Read the <a href=\"http:\/\/amazingfba.com\/about\/\">About<\/a> page;<\/p>\n<p>2.  Listened to at last one  <a href=\"http:\/\/amazingfba.com\">Podcast Episode<\/a> (preferably more).<\/p>\n<p><strong>Why? <\/strong>It&#8217;s all about you &#8211; you need to know who you are dealing with, and whether I&#8217;m the right person to help you.<\/p>\n<p>If you do the actions above, I at least know that you know <em>me<\/em>, so can make an informed decision in your own best interests.<\/p>\n<p>We will have a chance to talk on Zoom if you get through the written application. At that point, you should clear up any remaining doubts you have. After that, only if both and I are 100% happy, should we be considering going ahead.<\/p>\n<p><strong>How many people do you mentor at one time?<\/strong><\/p>\n<p>Now I&#8217;ve got the mentoring processes more organised, I&#8217;m willing to have a  maximum of 10 mentees at any one time. This is a <em>maximum<\/em>, but only for the right people!<strong>  <\/strong><\/p>\n<p><a href=\"mailto:%20michael@amazingfba.com\">Email me to ask more<\/a><\/p>\n<h3><a href=\"https:\/\/form.jotformeu.com\/72154401452345\" target=\"_blank\" rel=\"noopener noreferrer\">CLICK HERE<\/a> to apply<\/h3>\n<p>Generally, I close the programme when I&#8217;ve hit my limits of mentoring clients. I generally open it back up as spaces become available. If you apply, and are accepted, I will get in touch to let you know when that happens.<a href=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/03\/d0e8f7d9318af4a44fa47444980908c5-1.jpg\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/03\/d0e8f7d9318af4a44fa47444980908c5-1.jpg?resize=474%2C317&#038;ssl=1\" alt=\"Should I have mentoring?\" width=\"474\" height=\"317\" data-recalc-dims=\"1\" \/><\/a><\/p>\n<p><span style=\"font-size: 14pt;\"><b>Will this course show all the ways to choose the products from the bottom up?<\/b><\/span><\/p>\n<p>Absolutely. While those who have already sold retail arbitrage or wholesale via Amazon will still get a lot out of it, we started with the assumption that you have zero experience of online sales.<\/p>\n<p>We cover everything, including how to get the products (sourcing); the intricacies of Amazon labelling.<\/p>\n<p><b>How does mentoring relate to the <\/b><b><a href=\"http:\/\/amazingfba.com\/PLP\"> Private Label Course<\/a>. <\/b><b>Is the mentorship an upgraded form of the course (with a similar structure but more personally tailored instructions\/information than the course)?<\/b><\/p>\n<p>Yes and no. On the one hand, the course really codifies a lot of the work I&#8217;ve done with mentoring clients over the past two plus years. So if you&#8217;re starting from scratch, we will use the course as the back-bone of our work together. But there is always a need to refine what we do to your exact situation and to make the most of your unique strengths.<\/p>\n<p>If you&#8217;ve already passed the basics stage and have turnover, we will deal with your situation as you need it.<\/p>\n<p><strong>If I&#8217;m not ready to work with you yet, can I apply in a few months&#8217; time? <\/strong><\/p>\n<p>By all means, wait if you feel it&#8217;s right for you &#8211; just know that over time, I have continued to increase the price of the mentoring programme.<\/p>\n<p>So it is likely that I will continue to raise the prices in line with continued demand and the value I put on my time.<\/p>\n<p>That&#8217;s simply because it is very time intensive and not scalable.<\/p>\n<p>Do what is right for you in your business now. If you need to wait a few months and spend your money on inventory instead, by all means do what you need to do.<\/p>\n<h3><a href=\"https:\/\/form.jotformeu.com\/72154401452345\" target=\"_blank\" rel=\"noopener noreferrer\">CLICK HERE<\/a> to apply<\/h3>\n<p><a href=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/03\/skype-1007073_1280.jpg\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2018\/03\/video-call-2942368_640-300x225.png?resize=300%2C225\" alt=\"online mentoring\" width=\"300\" height=\"225\" data-recalc-dims=\"1\" \/><\/a><strong>What are the 3 basic components  of the programme ?<\/strong><\/p>\n<p><strong>1. Zoom Screenshare\/Call four times a month for 1 hour<\/strong>.<\/p>\n<p>Value £$515\/£400\/month.<\/p>\n<p>This can be in person if you prefer, in Hampstead, North London, UK if you live in the UK. I&#8217;m afraid it is not practical for me to travel for this level of mentoring.<\/p>\n<p><strong>2. Reasonable Email Support<\/strong>. Value $125\/£95\/month<\/p>\n<p><a href=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/03\/binary-1327493_1280.jpg\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/03\/binary-1327493_1280.jpg?resize=1280%2C854\" alt=\"binary-1327493_1280\" width=\"1280\" height=\"854\" data-recalc-dims=\"1\" \/><\/a><\/p>\n<p><strong>What is the content of the calls?<\/strong><\/p>\n<p>It depends on what you want from the programme and what I perceive you need to get that.<\/p>\n<p>If you are starting from scratch with online selling, broadly we will be following the tried and tested Zero to Hero System.  This broadly consists of 3 broad areas &#8211; Niche, Source and Launch- which we will work through in a logical and optimised sequence, to maximize your results and streamline your business launch process.<\/p>\n<p>If you already have turnover in ecommerce or on Amazon, but need to refine your private label work, that will be our main focus.<\/p>\n<p>If you&#8217;re already selling private label products but have specific gaps or issues you need help with, then we will focus on those.<\/p>\n<p><b>I see the mentorship offers regular contact via email. Please can you let me know the level of this support, for example would you say an email day with questions is reasonable?<\/b><\/p>\n<p>No, I&#8217;m afraid daily emails on top of the calls would be too much time out of my week to be sustainable.<\/p>\n<p>Besides which, I believe from mentoring experience, if something is complex enough to need that many emails, you are much better served by us discussing it in a call.<\/p>\n<p>So for that reason, I  limit email support to two emails a week, max 10-15 minutes&#8217; work per email.<\/p>\n<p>I honestly don&#8217;t think you&#8217;ll need more, in my experience.<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/03\/book-1750740_1280.jpg?resize=1280%2C960\" alt=\"book-1750740_1280\" width=\"1280\" height=\"960\" data-recalc-dims=\"1\" \/><\/p>\n<p><strong>So how long is the mentoring programme<\/strong> for?<\/p>\n<p>Ideally 6 months; minimum 3 months. If it seems like a good fit, I sometimes offer an initial stand-alone month for us to test drive the relationship and process, but that&#8217;s only as a prelude to longer-term work.<\/p>\n<p><strong>However,   From experience, I would suggest that&#8217;s a bare minimum you need to commit to a mentor or programme to get launched IF you work it full-time and have some luck.  <\/strong>(if we include February and the infamous Chinese New Year holidays, it may be at least one month more).<\/p>\n<p>For the vast majority of people, 6-12 months is a more realistic timescale from idea to first sales.<\/p>\n<p>However, the actual financial commitment is just one month at a time and you can cancel the subscription at any time.<\/p>\n<p><b>Can you teach me how to begin selling on Amazon UK\/EU as well as Amazon USA?<\/b><\/p>\n<p>Yes, I&#8217;ve sold extensively in both European marketplaces and USA and can train you in either or both.<\/p>\n<p>As a fairly fluent German speaker, I can add that I&#8217;m happy to take you into the profitable waters of Germany, the world&#8217;s second largest Amazon marketplace, where you will find amazing opportunities compared to the UK.<\/p>\n<p><b>When are you available? <\/b><\/p>\n<p>Basically I&#8217;m available regularly 10 am- 8 pm Monday- Friday, and Saturday afternoons up till about 6 pm British time.<\/p>\n<p>Those are UK times, so if you&#8217;re in Central Europe, add an hour; if you&#8217;re in USA, East Coast, take away 5 hours; Pacific coast, take away 8 hours.<\/p>\n<p>I&#8217;m about to become available on  Sundays  10 am-2 pm (BST) due to requests from my clients.<\/p>\n<p>Of course, if I&#8217;m already booked to do mentoring, in a meeting with my Amazon business partners, suppliers or running a mastermind meeting etc., I won&#8217;t be available all of those times but generally a fair %age of those is available.<\/p>\n<p>Evenings and weekends are at a premium but if you are prepared to wait a few days, we&#8217;ll find times to suit each other.<\/p>\n<p><strong>Do I get a regular fixed slot for a call with you? Or is each one determined individually?<\/strong><\/p>\n<p>Each call is booked individually to suit both our diaries. In practice, a lot of my clients end up with a pretty regular slot though if you prefer that (works for me!).<\/p>\n<p><strong>How does that work?<\/strong><\/p>\n<p>I use a system called ScheduleOnce &#8211; the system syncs with my diary and offers you only the slots I&#8217;m free for; you just enter 3 possible time slots over a couple of days; then I pick one &#8211; and the system books it. The system also takes account of timezone differences etc. It saves a lot of emails or Skype messages!<\/p>\n<p>Then the system sends us both reminders.<\/p>\n<p>I&#8217;ve been doing this for about two years and the system works very well and reliably.<\/p>\n<p><b>You obviously work hard mentoring &amp; running masterminds &#8211; do you still run your own Amazon businesses?<\/b><\/p>\n<p>Yes absolutely &#8211; I&#8217;m still very active in the USA with one business and in Europe with another, although quite a lot of the day-to-day running has had to be delegated.<\/p>\n<p>In our European business,  we are working on an aggressive expansion plan on Amazon, while developing our own ecommerce site to become a serious profit centre.<\/p>\n<p>I also run masterminds for experienced sellers (the<a href=\"https:\/\/amazingfba.com\/10k-collective-membership-application\/\"> $10K Collective<\/a>) doing between $25k-$250k\/month and am a member of masterminds with people doing up to $1\/2 million to $1 million a month. In both, we work on the nittiest of nitty-gritty of research, sourcing and selling.<\/p>\n<p>In short, I am still very much connected with the day to day reality of what it takes to sell profitably on Amazon!<\/p>\n<p><b>How many months until first PL goes on sale on Amazon?<\/b><\/p>\n<p>It&#8217;s an excellent question, and the answer is: it depends!<\/p>\n<p>If&#8230;<\/p>\n<p>&#8230;you&#8217;re willing to take higher risks and go straight into Private Labelling with no preliminary steps (not my preferred option but possible if you are <em>GENUINELY risk tolerant*<\/em>);<\/p>\n<p><em>*few people are, in my experience<\/em><\/p>\n<p>&#8230;you&#8217;ve got a substantial capital to invest in inventory and marketing (say £10,000 = $13,000 USD approx &#8211; which is HIGHLY advisable anyway);<\/p>\n<p>&#8230;you can CONSISTENTLY invest 20-30 hours a week into growing your Amazon business&#8230;<\/p>\n<p>&#8230;then you can do it in as little as three months. Maybe even two months if you work it full time and are sourcing in the continent your&#8217;e selling in (so source in EU to sell in UK; source in USA to sell in USA, etc.)<\/p>\n<p><strong>HOWEVER&#8230;<\/strong><\/p>\n<p>If&#8230;<\/p>\n<p>&#8230;you&#8217;re wanting to take <strong>calculated<\/strong> risks (my advice) and go through selling a little retail arbitrage for training; and generic products to test the market and for learning BEFORE plunging  into Private Labelling (very much my preferred option);<\/p>\n<p>&#8230;you&#8217;ve got a more limited capital to invest in inventory and marketing in the first few months (minimum is say £5,000 = $6,500 USD approx &#8211; this is the MINIMUM I advise not the RECOMMENDED amount);<\/p>\n<p>&#8230;you can only CONSISTENTLY invest around 20  hours a week into growing your Amazon business&#8230;<\/p>\n<p><strong>&#8230;then it will probably take you around 6 months.<\/strong><\/p>\n<p>If you get distracted by work, pregnancy, bereavement, house moves, property project issues&#8230; (those are just some of what my clients seem to experience!)&#8230;<\/p>\n<p>If you only work 10 hours a week in REALITY (despite best <em>intentions<\/em> &#8211; funny how that is, right?!)&#8230;<\/p>\n<p>&#8230;then in reality you will probably take about 9 months to one year.<\/p>\n<p>I can provide the expertise, the structure and the accountability&#8230;<\/p>\n<p>&#8230;but you have to provide the work ethic, the toughness to survive the mental &#8220;desert&#8221; of business building before you&#8217;ve hit profitable turnover, and the commitment to see it through to your first Private Label product launch.<\/p>\n<p><strong>So is just research and learning for 6-9 months until we launch then?<\/strong><\/p>\n<p>Absolutely NOT! I&#8217;m a huge believer in learning by doing, so unless you really have no time, if you have not yet sold any products online, I will insist that you get cracking with selling something ASAP!<\/p>\n<p>Also, I work with you to get you to the point of placing a modest (probably under $1500 USD) order for generic products within 3 months.  If you get distracted or don&#8217;t put in consistent time, that may drag out to four months. That&#8217;s up to you. I&#8217;ll keep you accountable but I can&#8217;t be a substitute for your own initiative. If only I could do that, I&#8217;d charge $100s of thousands!<\/p>\n<p><strong>Can you entice me with any extra bonuses?<\/strong><\/p>\n<p>Yes! You get access to a small but valuable collection of the key documents I use in my business, such as spreadsheets for checking profit and loss, supplier contact template emails, etc.<\/p>\n<p><b>The intensive (4 hour a month) programme includes FREE access to the Private Label Process course for life. <\/b><\/p>\n<p>The 2&#215;90 mins a month option gives HALF PRICE access to the Private Label Process Course for life.<\/p>\n<p><a href=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/03\/mac-KB-notes-on-wooden-desk.jpg\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/03\/mac-KB-notes-on-wooden-desk-1024x768.jpg?resize=474%2C356\" alt=\"Mentoring bonus documents\" width=\"474\" height=\"356\" data-recalc-dims=\"1\" \/><\/a><\/p>\n<p><b>One question on Amazon in general. You’ve been doing this for a few years now . <\/b><b>You do all the research and due diligence &#8211; how many times out of 10 does it flop?<\/b><\/p>\n<p>That&#8217;s another excellent question &#8211; but not really one I can answer simply. I&#8217;ll do my best&#8230;<\/p>\n<p>First we need to define a define &#8220;flop&#8221; (or &#8220;Fail&#8221;, I guess).<\/p>\n<p><em>All<\/em> things fail eventually (including mega corporations &#8211; Woolworths, BHS, anyone?) and human life!It depends what TIMESCALE you put on them.<\/p>\n<p>If a customised but basically private label product gives you 2-3 years&#8217; profitable sales, I would count that as a success.<\/p>\n<p>It depends on how much time and effort you put into developing it really.<\/p>\n<p><strong>Okay, so what if we say a flop = &#8220;Makes few sales when you launch&#8221;?<\/strong><\/p>\n<p>If you mean &#8220;not make sales&#8221; when launched, maybe 5\/10 do that.<\/p>\n<p>Of those, maybe 1\/2 have just not enough demand (which you should have spotted at the research stage and avoided). That&#8217;s something you should be able to avoid.<\/p>\n<p>The rest mostly get buried on page 10 and are invisible to shoppers. That&#8217;s something else you should be able to see at the research stage, but sometimes a lot of sellers come into the market. That&#8217;s when speed to market combined with a greater understanding of the market, plus some smart customizations, really counts.<\/p>\n<p>If sellers don&#8217;t have a clear launch plan and or don&#8217;t execute a vigorous launch, in a busy\/competitive market, that can guarantee mediocre sales because of being invisible.<\/p>\n<p><strong>So failures  come from low sales?<\/strong><\/p>\n<p>Well, it depends how you define failure.<\/p>\n<p>It&#8217;s easy to get caught up in the excitement of sales coming in.<\/p>\n<p>But when the dust settles and you sit down with your accountant, a slightly harder to recognised failure is failure to profit, despite sales.<\/p>\n<p>&#8220;Me too&#8221; products generally struggle here , ie with no personality, no differentiation from the other products in the market.<\/p>\n<p>If you&#8217;re selling a generic product with no labelling or branding, it&#8217;s going to be a price war. That may or may not leave you sales. But it will definitely hit your profitability.<\/p>\n<p>Unless you have really deep pockets, and can compete purely on volume at super low profit margins, you&#8217;re going to need to develop something unique about the product, customise the product and packaging and get some great photos. Or you&#8217;ll find there&#8217;s no profit left.<\/p>\n<p>2. If you&#8217;re selling a private labelled product (with unique packaging, logo, photos etc.) but which is frankly pretty much the same as the generic versions on Amazon, you&#8217;ll have a few more months&#8217; runway but you&#8217;ll probably end up with the same scenario.<\/p>\n<p><strong>So will ongoing mentoring be at the same price as the 1st set?<\/strong><\/p>\n<p>Yes, I can guarantee that whatever price is agreed at the start of the mentoring relationship, we will stick with that price for the remainder of the relationship.<\/p>\n<p><a href=\"https:\/\/form.jotformeu.com\/72154401452345\" target=\"_blank\" rel=\"noopener noreferrer\">CLICK HERE<\/a> to apply<\/p>\n<p><a style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\" href=\"mailto:%20michael@amazingfba.com\">Email me to ask more<\/a><span style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\">  <\/span><\/p>\n<p><a href=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/calculator-23651_640.png\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/calculator-23651_640-191x300.png?resize=191%2C300\" alt=\"Should I invest in mentoring?\" width=\"191\" height=\"300\" data-recalc-dims=\"1\" \/><\/a><\/p>\n<p><span style=\"font-size: 14pt;\"><strong>So much will it cost?<\/strong><\/span><\/p>\n<p><b>Option 1:  4X1hour calls\/mo<\/b><\/p>\n<p>The full cost, for 4&#215;1 hour zoom calls per week,  is usually $515\/£400 a month. This is a monthly recurring subscription, similar to a direct debit.<\/p>\n<p>However, I&#8217;m now offering two other options:<\/p>\n<p><b>Option 2 2&#215;90 mins\/month (including email support)<\/b><\/p>\n<p>Standard price $385\/£300<\/p>\n<p><b>*NEW* Option 3:  2X1 hour\/month (WITHOUT email support)<\/b><\/p>\n<p>Standard price $250\/£194\/month<\/p>\n<p><b>The intensive (4 hour a month) programme includes FREE access to the <a href=\"http:\/\/amazingfba.com\/PLP\">Private Label Process<\/a> course for life <\/b>(ie you still get access to the course even if we stop doing mentoring programme).<\/p>\n<p><strong>The 2&#215;90 mins a month option gives HALF PRICE access to the Private Label Process Course for life<\/strong> (ie you still get access to the course even if we stop doing mentoring programme).<\/p>\n<p>**LIMITED TIME OFFER**In mid Jan -mid Feb 2019, I&#8217;ll give the next 5 mentees a substantial reduction on their fees! I rarely do this but a combo of neglecting marketing in Q4 2018 (due to building the <a href=\"http:\/\/amazingfba.com\/PLP\">PLP course<\/a>) and a tax bill mean that I&#8217;m offering a limited time reduction in mentoring.<\/p>\n<h3><a href=\"https:\/\/form.jotformeu.com\/72154401452345\" target=\"_blank\" rel=\"noopener noreferrer\">CLICK HERE TO APPLY FOR MENTORING<\/a><\/h3>\n<p><a href=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-1332062_640.png\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-1332062_640-300x300.png?resize=300%2C300\" alt=\"Can I afford Amazon mentoring?\" width=\"300\" height=\"300\" data-recalc-dims=\"1\" \/><\/a><strong>Is this a good use of my money?<\/strong><\/p>\n<p>If you have a shoestring budget, then <strong><em>Please<\/em><\/strong> spend your money on inventory and Amazon Ads! However, if you have enough extra, coaching and mentoring has a long history of being a great investment.<\/p>\n<p>Business coaching, if done right, could produce an ROI (Return on Investment) of anywhere from 100%- 400%. Will that be true for you? The honest answer is: that depends on whether it&#8217;s the right thing for you now, and if it is, whether you&#8217;re an action taker. That&#8217;s why I do my best to ensure there is a good fit before I work with you.<\/p>\n<p><a href=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2015\/07\/Michael-Suit-silver-background-170-KB.jpg\" rel=\"attachment wp-att-18\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2015\/07\/Michael-Suit-silver-background-170-KB-237x300.jpg?resize=237%2C300\" alt=\"Michael Suit silver background 170 KB\" width=\"237\" height=\"300\" data-recalc-dims=\"1\" \/><\/a><strong>That&#8217;s all folks!<\/strong><\/p>\n<p>Thanks for reading- have a think about it, but don&#8217;t think too long if you decide you are interested in working with me!<\/p>\n<p><b><\/b>Any Questions not answered above?<\/p>\n<p>Just <a href=\"mailto: michael@amazingfba.com\">Email me to ask more<\/a>.<\/p>\n<p>Otherwise, I wish you all the best with your Amazon Business!Michael<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Is mentoring the right thing for me now? That depends! Coaching and Mentoring should help anyone with some initiative, focus  and energy to double or triple their initial investment in coaching. However, this programme is not for serial seminar attenders or shiny object chasers! (Don&#8217;t feel too bad if you recognise yourself here, that was me [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":351,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"fullwidth-page.php","meta":{"jetpack_post_was_ever_published":false,"footnotes":""},"class_list":["post-1107","page","type-page","status-publish","hentry","post-wrapper","thrv_wrapper"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.4 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Mentoring FAQs - Amazing FBA - Grow your 7-Figure Amazon Business<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Mentoring FAQs - Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"og:description\" content=\"Is mentoring the right thing for me now? That depends! Coaching and Mentoring should help anyone with some initiative, focus  and energy to double or triple their initial investment in coaching. However, this programme is not for serial seminar attenders or shiny object chasers! (Don&#8217;t feel too bad if you recognise yourself here, that was me [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/\" \/>\n<meta property=\"og:site_name\" content=\"Amazing FBA - Grow your 7-Figure Amazon Business\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AmazonPodcast\/\" \/>\n<meta property=\"article:modified_time\" content=\"2020-12-29T14:09:39+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-955919_640-176x300.png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@amazingfba\" \/>\n<meta name=\"twitter:label1\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"15 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/\",\"url\":\"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/\",\"name\":\"Mentoring FAQs - Amazing FBA - Grow your 7-Figure Amazon Business\",\"isPartOf\":{\"@id\":\"https:\/\/amazingfba.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-955919_640-176x300.png\",\"datePublished\":\"2016-11-13T01:32:53+00:00\",\"dateModified\":\"2020-12-29T14:09:39+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/#primaryimage\",\"url\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-955919_640.png?fit=376%2C640&ssl=1\",\"contentUrl\":\"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-955919_640.png?fit=376%2C640&ssl=1\",\"width\":376,\"height\":640},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/amazingfba.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Amazon FBA Mentoring For New Amazon Sellers (and Experienced Sellers)\",\"item\":\"https:\/\/amazingfba.com\/mentoring\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Mentoring FAQs\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/amazingfba.com\/#website\",\"url\":\"https:\/\/amazingfba.com\/\",\"name\":\"Amazing FBA - Grow your 7-Figure Amazon Business\",\"description\":\"Amazon Coach &amp; Mastermind Convenor\",\"publisher\":{\"@id\":\"https:\/\/amazingfba.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/amazingfba.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/amazingfba.com\/#organization\",\"name\":\"Amazing FBA\",\"url\":\"https:\/\/amazingfba.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"contentUrl\":\"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1\",\"width\":1260,\"height\":241,\"caption\":\"Amazing FBA\"},\"image\":{\"@id\":\"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AmazonPodcast\/\",\"https:\/\/twitter.com\/amazingfba\",\"https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Mentoring FAQs - Amazing FBA - Grow your 7-Figure Amazon Business","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/","og_locale":"en_GB","og_type":"article","og_title":"Mentoring FAQs - Amazing FBA - Grow your 7-Figure Amazon Business","og_description":"Is mentoring the right thing for me now? That depends! Coaching and Mentoring should help anyone with some initiative, focus  and energy to double or triple their initial investment in coaching. However, this programme is not for serial seminar attenders or shiny object chasers! (Don&#8217;t feel too bad if you recognise yourself here, that was me [&hellip;]","og_url":"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/","og_site_name":"Amazing FBA - Grow your 7-Figure Amazon Business","article_publisher":"https:\/\/www.facebook.com\/AmazonPodcast\/","article_modified_time":"2020-12-29T14:09:39+00:00","og_image":[{"url":"https:\/\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-955919_640-176x300.png"}],"twitter_card":"summary_large_image","twitter_site":"@amazingfba","twitter_misc":{"Estimated reading time":"15 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/","url":"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/","name":"Mentoring FAQs - Amazing FBA - Grow your 7-Figure Amazon Business","isPartOf":{"@id":"https:\/\/amazingfba.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/#primaryimage"},"image":{"@id":"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/#primaryimage"},"thumbnailUrl":"https:\/\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-955919_640-176x300.png","datePublished":"2016-11-13T01:32:53+00:00","dateModified":"2020-12-29T14:09:39+00:00","breadcrumb":{"@id":"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/#primaryimage","url":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-955919_640.png?fit=376%2C640&ssl=1","contentUrl":"https:\/\/i0.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/06\/question-955919_640.png?fit=376%2C640&ssl=1","width":376,"height":640},{"@type":"BreadcrumbList","@id":"https:\/\/amazingfba.com\/mentoring\/mentoring-faqs\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/amazingfba.com\/"},{"@type":"ListItem","position":2,"name":"Amazon FBA Mentoring For New Amazon Sellers (and Experienced Sellers)","item":"https:\/\/amazingfba.com\/mentoring\/"},{"@type":"ListItem","position":3,"name":"Mentoring FAQs"}]},{"@type":"WebSite","@id":"https:\/\/amazingfba.com\/#website","url":"https:\/\/amazingfba.com\/","name":"Amazing FBA - Grow your 7-Figure Amazon Business","description":"Amazon Coach &amp; Mastermind Convenor","publisher":{"@id":"https:\/\/amazingfba.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/amazingfba.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/amazingfba.com\/#organization","name":"Amazing FBA","url":"https:\/\/amazingfba.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/","url":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","contentUrl":"https:\/\/i2.wp.com\/amazingfba.com\/wp-content\/uploads\/2016\/10\/cropped-Amazing-FBA-Title-only-artwork-Horizontal-layout1.jpg?fit=1260%2C241&ssl=1","width":1260,"height":241,"caption":"Amazing FBA"},"image":{"@id":"https:\/\/amazingfba.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AmazonPodcast\/","https:\/\/twitter.com\/amazingfba","https:\/\/www.youtube.com\/channel\/UCG_e9eWV4m0n24ExVHnnoKg"]}]}},"jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/PdKLPE-hR","jetpack-related-posts":[],"_links":{"self":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/pages\/1107","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/comments?post=1107"}],"version-history":[{"count":0,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/pages\/1107\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/pages\/351"}],"wp:attachment":[{"href":"https:\/\/amazingfba.com\/wp-json\/wp\/v2\/media?parent=1107"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}